{
  "author": "sirrobzeroone",
  "content_warnings": [],
  "created_at": "2022-08-03T01:50:04.824057",
  "dev_state": "MAINTENANCE_ONLY",
  "donate_url": null,
  "downloads": 1934,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=28498",
  "forums": 28498,
  "game_support": [],
  "issue_tracker": "https://github.com/sirrobzeroone/worm_farm/issues/new/choose/",
  "license": "CC0-1.0",
  "long_description": "# Worm Farm\n\nThanks to Tenplus1 for his excellent Ethereal mod and Xanadu server, without those two this mod wouldn't exist.\n\nSimple mod although hopefully fairly feature rich. Adds a Worm Farm to Minetest which can accept most green waste material which the worms will eat and use to reproduce and create more worms which you can then use for fishing. The worms will also produce worm tea (if bonemeal mod and vessels mod are active) and dirt although slowly. \n\nThe mod is primarily aimed to be used with Ethereal mod's fishing however I have made it fairly easy to configure if you wish to use it with another game or if theres another fishing mod let me know and I'll add support for it.\n\n## Overview\nThe Worms in the worm farm are very self-contained and so long as you keep feeding them something they will produce worms for use when fishing. However if you:\n\n - Keep the Worm Farm Hydrated and\n - Feed them foods they like \n\nThey will produce worms for fishing faster and the population of worms inside the Worm farm will grow, which will also produce worms faster and allow them to eat food faster. Although not a direct simulation of a real life worm farm the worms do like and dislike similar foods to there real life cousins. For example they will rapidly devour melon slices and dislike anything with garlic immensly. The worms in the worm farm will also eat their more favorite foods first.\n\n## API functions\n\n### Register Worm Food/Water\nworm_farm.register_worm_food_water(thing_name, amount, return_empty, type)\n\n####  Register Worm Food\nRegistering a worm food only makes use of the first two fields in the function. The lower the time in seconds the more the worms like the food. It is recommended the lowest you go for their most favorite foods is 4 (seconds). If the defaults are not changed once you exceed 10 secs worm farm population wont increase when they eat that food. Once 20 secs is exceeded the worm population will decline when they eat that food as it i semi-toxic/takes to long for them to eat.\n\nNodes or items can be registered worms will eat both\nexample (only provide 1st two values):\n worm_farm.register_worm_food_water(\"default:paper\", 7 )\n\nWorms can eat paper and it will take them 7 seconds to eat a single piece if no bonus's or penalties are being applied. Once they finish eating a worm will be avaliable to collect and use for baiting fishing hooks.\n\n#### Register Worm Water\nThe worm farm needs to be kept moist to keep the worms happy. Additional items can be registered that hydrate/add water to the farm. If not changed the maximum water storage for the farm is 400 units. A bucket of water will hydrate the farm completely where as a glass of carrot juice from farmign redo only adds 100 units of hydration.\n\nNodes or items can be registered\nexample (provide all four values):\nworm_farm.register_worm_food_water(\"bucket:bucket_water\", 400, \"bucket:bucket_empty\" , \"w\")\n\nWhen the worm farm is right clicked with a bucket of water, it will be filled with 400 units of water/hydration. The player will get an empty bucket back. The \"w\" flag is so the function knows this is a water registration - bit redundant as I could just check for empty item value, future update maybe.\n\n### Register Worm as drop from Nodes\nworm_farm.register_worm_drop(node_name, rarity)\n\nLets you register worms as another drop from a node. This wont disturb the existing nodes drops and will increase the max node drops by +1 basically the worms drop for free. The worms will be inserted in the correct order into the node drop table.\n\nexample:\nworm_farm.register_worm_drop(\"default:dirt\", 40)\n\nThe default dirt nodes drop would now look like this - assuming ethereal is active:\n\n    drop = {\n\t\tmax_items = 2,\n\t\titems = {\n\t\t\t{\n\t\t\t\trarity = 40,\n\t\t\t\titems = {\n\t\t\t\t\t\"ethereal:worm\"\n\t\t\t\t}\n\t\t\t},\n\t\t\t{\n\t\t\t\titems = {\n\t\t\t\t\t\"default:dirt\"\n\t\t\t\t}\n\t\t\t}\n\t\t}\n\t}\n\n\n",
  "maintainers": ["sirrobzeroone"],
  "media_license": "CC0-1.0",
  "name": "worm_farm",
  "provides": ["worm_farm"],
  "release": 13023,
  "repo": "https://github.com/sirrobzeroone/worm_farm",
  "score": 165,
  "screenshots": ["https://content.luanti.org/uploads/37f3c5e3e0.png"],
  "short_description": "Adds a way for worms to be cultivated for fishing - designed for use with Ethereal",
  "state": "APPROVED",
  "tags": ["plants_and_farming"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/37f3c5e3e0.png",
  "title": "Worm Farm",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/sirrobzeroone/worm_farm/releases/13023/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": { "sirrobzeroone/worm_farm": [] },
  "hash": "10fwy99bdabq4hqd9scz7vcscqcwnaypnrvz3m1zmc8rgh9yix29"
}
