{
  "author": "SaKeL",
  "content_warnings": [],
  "created_at": "2021-03-20T18:42:29.174440",
  "dev_state": "MAINTENANCE_ONLY",
  "donate_url": null,
  "downloads": 31890,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=26466",
  "forums": 26466,
  "game_support": [
    {
      "confidence": 10,
      "game": {
        "aliases": ["Minetest/minetest_game"],
        "author": "Luanti",
        "name": "minetest_game",
        "release": 29922,
        "short_description": "The classic \"Minetest\". A lightweight and well-maintained base for modding",
        "thumbnail": "https://content.luanti.org/thumbnails/1/8ffd1409ff.png",
        "title": "Minetest Game",
        "type": "game"
      },
      "supports": true
    }
  ],
  "issue_tracker": "https://bitbucket.org/minetest_gamers/x_bows/issues?status=new&status=open",
  "license": "LGPL-2.1-or-later",
  "long_description": "Adds bow and arrows to Minetest. The goal of this Mod is to make most complete single bow with arrow what will work with MTG damage system, time from last punch as simple as possible. Eventually due to the damage tiers in MTG additional arrows were added.\n\nVideo: https://youtu.be/pItpltmUoa8\n\n## Features\n\n* bow will force you sneak when loaded (optional dep. playerphysics)\n* loaded bow will slightly adjust the player FOV\n* bow uses minetest tool capabilities - if the bow is not loaded for long enough (time from last puch) the arrow will fly shorter range\n* charged bow in inventory will discharge and give back the arrow when not selected\n* arrow uses raycast\n* arrow has chance of critical shots/hits (only on full punch interval)\n* arrow uses minetest damage calculation (including 3d_armor) for making damage (no hardcoded values)\n* arrows stick to nodes, players and entitites\n* arrows remove them self from the world after some time\n* arrows remove them self if there are already too many arrows attached to node, player, entity\n* arrow continues to fly downwards when attached node is dug\n* arrow flies under water for short period of time and then sinks\n* arrows adjusts pitch when flying\n* arrows can be picked up again after stuck in solid nodes\n* registers only one entity reused for all arrows\n* target block reduces fall damage by -30\n* quiver for more arrow storage (can hold only arrows)\n* quiver perks when in inventory (faster arrows, more arrow damage...)\n* quiver shows temporarily its inventory in HUD overlay when loading or shooting (quickview)\n* quiver item shows its content in infotext (hover over the item)\n* X Bows API for creating custom shooters and projectiles\n* 3d quiver shown in 3rd person view (compatible with 3d armor)\n* x_enchanting support\n\n## How To\n\n### Bow\n\nWith the bow selected in hotbar and in your hand, press right click on mouse (PC) or the same action as when placing blocks, to load the bow.\nFor bow to be loaded you have to have arrows in the arrow/quiver inventory - there should be extra tab in your inventory MOD to show arrow and quiver inventory slots.\nArrows and quivers in the players main inventory don't count and will not be used.\nYou have to have arrows and/or quiver in dedicated arrow/quiver inventory slots in order to charge the bow.\nCharging bow will have slight sound effect and can be fired at any time with left click (PC)\nor the same action as when you are digging a block. Waiting for full charge of the bow is recommended\nas it will give the arrow full speed (maximum shooting distance) and chance for critical arrow (double damage).\n\nThere are few indications on how to know when the bow is fully charged:\n\n* there is a distinct \"click\" sound\n* each arrow has \"charge time\" in the description\n* after shooting, arrow will have particle trail\n\nThere are few indications on how to know when the arrow is a critical arrow:\n\n* there is a distinct arrow flying sound\n* after shooting, arrow will have red particle trail\n\nIf you shoot the arrow before the bow is fully charged the speed/distance will be lower and no arrow particle trail will be shown (also no chance for critical arrow).\nChanging the selection in hotbar will unload the bow and give you back arrow from the unloaded bow - this applies also when login in to the game (bow will be discharged and arrow will be returned to inventory) and also when you drop the charged arrow (discharged bow will be dropped with arrow item).\nIf you have `playerphysics` or `player_monoids` mod installed, charged bow will slow you down until you release the arrow.\n\n### Quiver\n\nQuiver item can hold inventory of arrows. When player has quiver in his/hers quiver inventory slot - there should be extra tab in your inventory MOD to show arrow and quiver inventory slots, bow can take arrows from quiver, otherwise arrows outside of the quiver are used to load the bow.\nThough, if arrows from quiver are used to load the bow, the arrows have additional speed and damage.\nIf we are loading/shooting arrows from quiver, there is temporary quickview HUD overlay shown, peeking in to the quivers inventory from which the arrow was taken. Arrows used from quiver will be faster only when the bow is fully charged - see \"How To - Bow\" for more information on how to know when bow is fully charged.\n\nThere are few indications on how to know when the bow shot arrow from quiver:\n\n* there is temporary HUD overview shown peeking in to the quiver inventory\n* after shooting, arrow will have blue/purple particle trail (if bow was fully charged)",
  "maintainers": ["SaKeL"],
  "media_license": "CC-BY-SA-4.0",
  "name": "x_bows",
  "provides": ["x_bows"],
  "release": 30510,
  "repo": "https://bitbucket.org/minetest_gamers/x_bows/src/master/",
  "score": 1040.4,
  "screenshots": [
    "https://content.luanti.org/uploads/b1455213f3.png",
    "https://content.luanti.org/uploads/0070a4d328.png",
    "https://content.luanti.org/uploads/a4875fe7f6.png",
    "https://content.luanti.org/uploads/d9dc003454.png",
    "https://content.luanti.org/uploads/5560c0f496.png",
    "https://content.luanti.org/uploads/0f78c1c0fe.png"
  ],
  "short_description": "Adds bow and arrows with API.",
  "state": "APPROVED",
  "tags": ["pvp", "shooter", "survival", "tools"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/b1455213f3.png",
  "title": "X Bows",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/SaKeL/x_bows/releases/30510/download/",
  "video_thumbnail_url": "https://content.luanti.org/thumbnails/youtube/pItpltmUoa8.jpg",
  "video_url": "https://www.youtube.com/watch?v=pItpltmUoa8",
  "website": "https://bitbucket.org/minetest_gamers/x_bows/wiki/Home",
  "dependencies": { "SaKeL/x_bows": [] },
  "hash": "08a8ysy3nav656n8x5l8i3cdkazciln4iqhyjxm6h7xmjmlj7s3m"
}
