{
  "author": "ResendeTech",
  "content_warnings": [],
  "created_at": "2024-03-02T09:58:02.100209",
  "dev_state": "WIP",
  "donate_url": null,
  "downloads": 245,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": "https://github.com/OpenLearningQuest/minetest_periodic_elements/issues",
  "license": "MIT",
  "long_description": "# Periodic Elements Mod for OpenLearningQuest\n\nThe Periodic Elements Mod for Minetest, designed specifically for OpenLearningQuest, brings the fascinating world of chemistry to your virtual sandbox! This mod introduces elemental blocks representing the first two elements of the periodic table: Hydrogen and Helium. As part of our ongoing educational initiative, we plan to expand the mod to include all 118 elements.\n\n## Features\n\n1. Hydrogen Block\n2. Helium Block\n3. Lithium Block\n4. Beryllium Block\n5. Boron Block\n6. Carbon Block\n7. Nitrogen Block\n8. Oxygen Block\n\n## Installation\n\n1. Clone or download this repository.\n2. Extract the contents into your Minetest mods folder.\n\n## Usage\n\n1. Launch Minetest and create a new world.\n2. Enable the \"Periodic Elements\" mod in the world configuration settings.\n3. Find Hydrogen and Helium blocks in the creative inventory.\n\n## Educational Features\n\n### Instructions for Parents and Guardians\n\nParents and guardians can use this mod as a fun and interactive way to introduce basic chemistry concepts to children. Engage with your child as they explore the elements, and encourage discussions about the properties of Hydrogen and Helium.\n\n### Age Groups/Levels\n\n- **Suitable for ages 6 and above:**\n  - Provides a foundational understanding of basic chemistry concepts.\n  - Encourages creativity through building with elemental blocks.\n  - Offers a unique perspective on chemistry in a creative context.\n\n### Curriculum Alignment\n\nWhile not aligned with a specific curriculum, this mod supports general science education goals, providing an introduction to the periodic table and fundamental properties of elements.\n\n### Educational Goals\n\nThis mod aims to foster an early interest in science, encouraging exploration and curiosity about the world around us. Through interactive gameplay, it introduces basic chemistry concepts in an accessible and engaging manner.\n\n### Instructional Use\n\n#### Chemistry Lessons\n\nThis mod serves as an excellent educational tool for chemistry lessons, especially when introducing the periodic table of elements. Teachers can use the blocks to visually represent elements, with each block featuring the element's symbol in the center and the atomic number displayed on the top left.\n\n1. **Elemental Exploration:**\n   - Encourage students to explore the in-game periodic table and interact with the blocks representing different elements.\n   - Discuss the unique properties of each element, such as their atomic structure, reactivity, and common uses.\n2. **Periodic Trends:**\n   - Challenge students to identify patterns within groups and periods.\n\n#### Creative Assignments\n\n1. **Element Showcase:**\n   - Assign students a project to create a showcase of different elements using the mod.\n   - Each student can be responsible for researching and presenting information about a specific element, then building its block in the game.\n\n2. **Molecular Modeling:**\n   - Explore molecular structures by having students combine different elements to create simple compounds or molecules within the game.\n   - Discuss the chemical reactions and properties of the resulting structures.\n\n#### Interactive Assessments\n\n1. **Element Identification Quiz:**\n   - Use the mod as a tool for quizzes or assessments where students must identify elements based on their symbols and atomic numbers within the game.\n   - Enhance engagement by turning it into a timed challenge.\n\n2. **Periodic Table Scavenger Hunt:**\n   - Create a fun scavenger hunt within the game where students must locate specific elements based on given clues.\n   - Reinforce their understanding of the periodic table's layout and organization.\n\n#### Future Expansion\n\n1. **Stay Updated:**\n   - Keep an eye on future updates as more elements are added to the mod.\n   - Discuss new elements and their significance in the context of the periodic table.\n\n2. **Collaborative Element Building:**\n   - Foster collaboration by assigning groups of students to research and propose designs for upcoming elements to be added to the mod.\n   - Encourage creative and accurate representation of each element.\n\n## Feedback and Contributions\n\nWe welcome any feedback, suggestions, or contributions! Feel free to [open an issue](https://github.com/OpenLearningQuest/minetest_periodic_elements/issues) or submit a pull request to improve the educational experience offered by this mod.\n\n## Credits\n\n- Mod developed by Victor Resende\n\n## License\n\nThis mod is licensed under the [MIT License](LICENSE.txt).\nAll assets for Minetest Periodic Elements by Victor Andrade Resende are marked with CC0 1.0 \n",
  "maintainers": ["ResendeTech", "brylie"],
  "media_license": "CC0-1.0",
  "name": "periodic_elements",
  "provides": ["periodic_elements"],
  "release": 24117,
  "repo": "https://github.com/OpenLearningQuest/minetest_periodic_elements.git",
  "score": 152.5,
  "screenshots": ["https://content.luanti.org/uploads/d708aab570.png"],
  "short_description": "Adds the periodic elements",
  "state": "APPROVED",
  "tags": ["decorative", "education"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/d708aab570.png",
  "title": "Periodic Elements",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/ResendeTech/periodic_elements/releases/24117/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "ResendeTech/periodic_elements": []
  },
  "hash": "08i5qmfv4bi7fxi8r4gi2av53rkw4k8qa0lf83pl7ww2xv9p3srh"
}
