{"author":"Mantar","content_warnings":["alcohol_tobacco"],"created_at":"2021-03-15T22:58:37.748982","dev_state":"ACTIVELY_DEVELOPED","donate_url":"https://liberapay.com/Exile-Team/","downloads":44736,"forum_url":"https://forum.luanti.org/viewtopic.php?t=26835","forums":26835,"game_support":[],"issue_tracker":"https://codeberg.org/Mantar/Exile/issues","license":"GPL-3.0-only","long_description":"# Exile\nCreated by Dokimi\n\nFor Minetest 5.5 through 5.8\n\n### Release 0.3.18\n* Bones of previous exiles, with various items\n* Sun hat and sandals\n* Fires more likely to die out than burn forever\n* SkinsDB support for folks who want that\n* /ping command to reveal your location to players out of range for nametags\n* Comfort and rest improvements\n* UI improvements\n* Fixed hair colors\n* /restart will fix bugged players who closed the death formspec\n\n### Gameplay\nChallenging, at times brutal, wilderness survival with simple technology.\nUse your wits to find food, water, and shelter before succumbing to the elements,\nwhile exploring the mysterious world, and developing your capacities to endure your exile.\n\nFeatures:\nPlayer health effects: hypothermia, exhaustion, disease...\nDynamic nature: Seasonal weather, erosion, water flows through soil...\nBuilding matters: make shelters from the rain, kilns, smelters,...\n\n\tCAUTION: some people may find parts of this game difficult or disturbing.\n\n### Gameplay Guide\nCheck out doc > walkthrough for a more detailed guide.\n\nMany different strategies might work, and part of the fun is figuring out what does,\nand catastrophically does not, work.\n\nHere are some early steps you might pass though:\n\n1. Make basic tools. Find a suitable camp site soon before you get tired.\n2. Build a bed to rest in, shelter, and maybe fire for warmth.\n3. Make a kiln, and make pots. Harvest wild foods while you wait.\n4. Collect water with pots, and build up a water supply.\n5. Farm food, drugs, and fibre to build up supplies.\n6. Explore and gather resources for more advanced tools.\n\nYou start in spring. Soon the hot dry weather of summer will arrive.\nRunning out of water, or getting exhausted by the heat is a real risk.\nAfter that will come the sub-zero conditions of winter.\nStarvation and freezing are hard to avoid without preparation.\n\n\nSome tips and tricks:\n\n- Beds are important. If you're exhausted you get hypothermia/heat stroke. Get under shelter in a nice temperature.\n- Do your crafting, organizing, planning while you rest.\n- Weather: extremes sap your energy. Like real life, walking around in a snowstorm is a bad idea!\n- Temperature: Build a shelter, with a fire place or lots of torches. You can also go underground, caves are safe from weather.\n- Water: you can drink cave drips (click them). Water pots collect rain water. Some plants, and food quench your thirst. If you're desperate, you can try to melt ice, or dig a seepage pit in wet ground and wait for water to flow into it\n- Food: eat stuff and see if you live! You can catch animals with clubs (right click)\n- Clothing: Simple grass clothing can be woven quickly, and can be a lifesaver. Better clothes can be made by soaking bundles of the right kind of plants.\n- Farming: digging tools also can till soil. Punching depleted farm soil with fertilizers will restore it.\n- Keep an eye on \"health effects\". You may have eaten something bad, or have a terrible disease.\n- Drugs: some plants have useful medicinal effects. Be careful not to overdose, however.\n- Go deep enough underground and you might find something....\n- Hardwood trees are more difficult to cut than soft wood, you will need better tools.\n- Build stairs and shelters around your base, this will save you energy and protect you from extremes.\n- You can use sticks to build a ladder, or a pole to shimmy up, to get to high places, or descend if you're careful.\n- Not every step in crafting can be done at a work station. Some things need to be fired, or soaked in water etc.\n- Ovens, kilns, furnaces: build them like you would for real. A fire with access to air, and a sealed chamber that gets heated up.\n- Fires. Blocks are hotter. Charcoal is hotter than wood. Fires can be temporarily extinguished by punching them holding sediment.\n- Charcoal. Make it like you would for real: a wood fire sealed up with no air.\n- Glassmaking: Sand and wood ash can be made into green glass; the ash must be soaked, dried, and roasted to make clear glass. Glass can be melted onto iron trays to make panes for real windows!\n- Iron smelting. This is hard. It needs plenty of charcoal, and a space below the iron mixture for slag to drain out.\n\n\n### Development\nExile is free software - that means it is as good as you choose to make it.\nIt also means development can be erratic and haphazard at times, so be patient!\n\nSee the git repository at\nhttps://codeberg.org/Mantar/Exile/ for known bugs, and to report new ones.\n\n### Credit\nThanks is due to all those whose mods have been adapted for use in Exile (see mod folders for details).","maintainers":["Mantar"],"media_license":"CC-BY-SA-3.0","name":"exile","provides":["animals","artifacts","backpacks","bed_rest","bones","canoe","climate","clothing","crafting","creative","doors","exile_env_sounds","graffiti","health","inferno","lightning","liquid_store","lore","mapgen","megamorph","minimal","mobkit","naturalslopeslib","nodecrafting","nodes_nature","player_api","player_monoids","rings","ropes","sfinv","spears","stairs","tech","volcano","wielded_light"],"release":28413,"repo":"https://codeberg.org/Mantar/Exile","score":3070.2,"screenshots":["https://content.luanti.org/uploads/0195f6298c.jpg","https://content.luanti.org/uploads/9cd8a84967.jpg","https://content.luanti.org/uploads/7215bc86a3.jpg","https://content.luanti.org/uploads/c309ee5c0c.jpg","https://content.luanti.org/uploads/c76039a542.jpg","https://content.luanti.org/uploads/d11944c7f3.png"],"short_description":"Challenging, at times brutal, wilderness survival with simple technology. ","state":"APPROVED","tags":["adventure__rpg","oneofakind__original","survival"],"thumbnail":"https://content.luanti.org/thumbnails/1/0195f6298c.png","title":"Exile","translation_url":"https://translate.codeberg.org/projects/exile/","type":"game","url":"https://content.luanti.org/packages/Mantar/exile/releases/28413/download/","video_thumbnail_url":null,"video_url":null,"website":"https://exile.planetofnix.com/wiki/pmwiki.php?n=Main.HomePage","dependencies":{"Mantar/exile":[]},"hash":"0ikv8yjf2b8j5danny7wbcflxb33brxaym7bxc08f1sx1h1dbib9"}