{
  "author": "GethN7",
  "content_warnings": [],
  "created_at": "2022-02-06T16:25:44.511319",
  "dev_state": "ACTIVELY_DEVELOPED",
  "donate_url": null,
  "downloads": 910,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": null,
  "license": "MIT",
  "long_description": "Easycraft is a mod for easy crafting recipes of many common but hard to make items, especially in singleplayer survival without tedious searching. This was forked from Easy Wool (and can be used to be a drop-in replacement) by Tim7 and goes a lot further. I do plan to add more easy recipes over time to make this more friendly to single player survival modders who simply want to craft without the tedious hassle of hunting down materials, though I intend to keep this base game friendly. This include rare ores, tools, and other things that people who just want to build in survival mode may not want to waste so much time searching for.\n\nAnyone wanting to use my mod to patch them to play nice or use mine as a base to change others is welcome, pursuant to the MIT license. This should work with all versions of Minetest 5.0+, send me comments and suggestions for further improvement or bug reports if need be.\n\n1.3 fixes gold lump recipe overlapping with map recipe, now both should work.",
  "maintainers": ["GethN7"],
  "media_license": "MIT",
  "name": "easycraft",
  "provides": ["easycraft"],
  "release": 11198,
  "repo": null,
  "score": 4,
  "screenshots": ["https://content.luanti.org/uploads/3f6c2213bd.jpg"],
  "short_description": "Provides several easy recipes to make many craftable items. Fork of Easy Wool by Tim7",
  "state": "APPROVED",
  "tags": ["crafting", "singleplayer", "survival"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/3f6c2213bd.png",
  "title": "Easy Craft",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/GethN7/easycraft/releases/11198/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "GethN7/easycraft": []
  },
  "hash": "1c17w9516dzy5v3q27b1viy9smp1s9vwq4n79kpj4mxxayvilip6"
}
