{
  "author": "LissoBone",
  "content_warnings": [],
  "created_at": "2022-10-12T12:20:29.301759",
  "dev_state": "ACTIVELY_DEVELOPED",
  "donate_url": null,
  "downloads": 707,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": null,
  "license": "GPL-3.0-or-later",
  "long_description": "# Ever wanted to play a Dream-style manhunt in minetest?\n## Well, today is YOUR day!\n### Now's your chance to bE A BI (wait, that's from a different game).\n\nManhunt is a mini-game popularized by an american youtuber Dream on youtube, consisting of hunters, usually more than one, whose primary goal is to impede the speedrunner's (or huntee's) progress and eventually kill them using any methods available (speedrunner's death without hunters' intervention also counts). If you aren't familiar with the game, which I highly doubt, you may be wondering: \"How do hunters track the runner's position? What if they literally craft an airplane and travel a thousand blocks in an arbitrary direction, completely disorienting the hunters?\", and I have an answer for all your questions. Hunters' unique tool is the compass, which points directly at the speedrunner regardless of their position, but doesn't reveal their location entirely. So, this mod adds that very compass and a set of tools to manage your game, such as:\n\n* `/addhunter <name>` - adds a hunter to the hunter list.\n* `/removehunter <name>` - if you're not satisfied with your fellow hunter, you can throw them right back into trash and move on with your life.\n* `/hunters` - ever forgot the names of your own children? This command is for you.\n* `/stopmanhunt` - using your admin powers, halt ANY manhunt!\n* `/sethuntee <name>` - currently, only a single player can be a huntee, but the dominant majority would probably not need more. This will possibly be changed in near future.\n* `/startmanhunt` - start the execution process.\n* `/removehuntee <name>` - the feature I completely forgot about, so I added it in a special, separate release that fixes critical bugs.\nHowever, doing ANYTHING listed above requires you to possess hacker powers, or to have a special privilege \"manhuntadmin\".\n\nThe end goal of the hunters is always to simply kill the speedrunner, and this mod comes packed with a special handler that activates if the manhunt is ongoing and the huntee has just been killed.\nHowever, the speedrunner's goal may vary, and it would appear rather uncomfortable to set something specific, so I came up with a suggestion: check out [Warr1024's mod that features a doomsday device](https://content.luanti.org/packages/Warr1024/doomsday/).\n\nThis mod also features a very specil compass that, upon activation, sets up a HUD of a 128x128 compass with a 16x16 red dot which points at the huntee. The activated and deacrivated radars aren't any different, except the HUD (and the very specil optional sounds) may annoy some particular players, so there's an option to switch it on and off.\n\n* Disclaimer: no products advertised in this article are edible. All products listed here are dangerous for children under 6.\n* Choking hazard: 1~6.\n* Choking hazard: 6~17.\n* Choking hazard: 18~100.\n* Choking hazard: 110~10000.\n\nFix: this game is not popular because dream isn't relevant anymore.\n",
  "maintainers": ["LissoBone"],
  "media_license": "CC-BY-SA-4.0",
  "name": "manhunt",
  "provides": ["manhunt"],
  "release": 24626,
  "repo": null,
  "score": 153.9,
  "screenshots": [
    "https://content.luanti.org/uploads/04c7efadd3.png",
    "https://content.luanti.org/uploads/f1251ccc86.png",
    "https://content.luanti.org/uploads/60a8375bcd.png",
    "https://content.luanti.org/uploads/2ca61ef62a.png",
    "https://content.luanti.org/uploads/486f2e8985.png"
  ],
  "short_description": "Play with your friends and enemies in this exciting manhunt game.",
  "state": "APPROVED",
  "tags": ["chat", "hud", "mini-game", "multiplayer", "pvp"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/04c7efadd3.png",
  "title": "Manhunt",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/LissoBone/manhunt/releases/24626/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "LissoBone/manhunt": [
      {
        "is_optional": false,
        "name": "arena_lib",
        "packages": ["Zughy/arena_lib"]
      }
    ],
    "Zughy/arena_lib": [
      {
        "is_optional": false,
        "name": "signs_lib",
        "packages": [
          "NotaB/tolkientest",
          "EmptyStar/asuna",
          "debiankaios/proxima_survival",
          "mt-mods/blockcolor",
          "Wuzzy/hades_revisited",
          "Kimapr/nonsensical_skyblock",
          "zanderdev/skyblock_zero",
          "mt-mods/signs_lib",
          "covertiii/mogue",
          "mt-mods/dreambuilder_game"
        ]
      },
      {
        "is_optional": false,
        "name": "audio_lib",
        "packages": ["Zughy/audio_lib"]
      },
      {
        "is_optional": false,
        "name": "lib_chatcmdbuilder",
        "packages": [
          "rubenwardy/capturetheflag",
          "rubenwardy/lib_chatcmdbuilder",
          "MisterE/blockbomber_editor",
          "hilol/epic_combat"
        ]
      }
    ]
  },
  "hash": "1jrp6l65pr5irzxmy5rynhbsh740a0c1zl9a9ydym242jsvjwmz1"
}
