{
  "author": "StarNinjas",
  "content_warnings": [],
  "created_at": "2023-12-21T23:51:42.356003",
  "dev_state": "LOOKING_FOR_MAINTAINER",
  "donate_url": null,
  "downloads": 4357,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": null,
  "license": "LGPL-2.1-or-later",
  "long_description": "A mysterious event has left you without the gift of sight, plunging you into complete darkness, leaving you to rely solely on the symphony of sounds that now shapes your world. Navigate through a diverse landscape where every sound tells a story – from the rustle of leaves to silent chirps of crickets. Your survival depends on your ability to interpret the rich tapestry of auditory cues, as you adapt to the unexpected transformations in your environment.\n\nHINTS/TIPS:\n\n1. You’re almost completley blind, leaving you to have to figure things out by sound.\n2. Pay attention to your footsteps, and tap around with your hand to figure out the blocks you’re sorrounded by.\n3. You’ll start with a pickaxe. Use /pick to get it back if you lose it.\n4. You can tell what item you’re wielding by scrolling through your hotbar, each item has distinctive sound when wielded.\n5. Hear a sound you don’t like? Get away from it.\n6. Listen to your heartbeat to tell how much health you have; get something to eat as soon as possible.\n7. Items can be crafted into other items via left-clicking on another block; try cooking something in fire and see (well, not see) the results.\n8. You have no inventory. You can access a list of discoveries you’ve made via the “I” key.\n9. Fires are extremly useful for crafting, and keep predators away. Start one by finding flint in gravel, and striking it by flammable things.\n10. Head to lower elevations to find more vegetation.\n11. Food is eaten with RIGHT-CLICK while looking at the ground (not left-click as usual).\n13. The rest you will figure out by yourself. A gameplay video will be on YouTube, watch if you're really stuck.\n\nGoodluck.\n\nNOTE: This game was made for the Minetest Game Jam, and is therefore very beta. ",
  "maintainers": ["StarNinjas"],
  "media_license": "CC-BY-SA-4.0",
  "name": "veil_of_the_unknown",
  "provides": [
    "ambience",
    "awards",
    "bell",
    "fire",
    "give_initial_stuff",
    "item_drop",
    "mobs",
    "mobs_animal",
    "sfinv",
    "vu_base",
    "vu_heartbeat",
    "vu_music",
    "wield_events"
  ],
  "release": 22511,
  "repo": "https://github.com/starninjas/Veil-of-the-Unknown",
  "score": -269.6,
  "screenshots": ["https://content.luanti.org/uploads/4f629b3002.png"],
  "short_description": "Experience a world of complete blindness. Try you best to survive without the gift of sight.",
  "state": "APPROVED",
  "tags": ["jam_game_2023", "oneofakind__original", "survival"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/4f629b3002.png",
  "title": "Veil of the Unknown",
  "translation_url": null,
  "type": "game",
  "url": "https://content.luanti.org/packages/StarNinjas/veil_of_the_unknown/releases/22511/download/",
  "video_thumbnail_url": "https://content.luanti.org/thumbnails/youtube/HJ0bMtyngpU.jpg",
  "video_url": "https://www.youtube.com/watch?v=HJ0bMtyngpU",
  "website": "https://github.com/starninjas/Veil-of-the-Unknown",
  "dependencies": { "StarNinjas/veil_of_the_unknown": [] },
  "hash": "0f3l1sk47nsgdk9r6iz67wlcphnnxnyr5byy5jkvgf86w5n1xrci"
}
