{
  "author": "jara25",
  "content_warnings": [],
  "created_at": "2025-05-03T02:20:49.821260",
  "dev_state": "WIP",
  "donate_url": null,
  "downloads": 231,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=31622",
  "forums": 31622,
  "game_support": [],
  "issue_tracker": "https://codeberg.org/jara25/yams/issues",
  "license": "GPL-3.0-only",
  "long_description": "yams RPG, or \"yams\" for short, is yet another mod soup based on Minetest Game that also includes light RPG elements. Players can gain experience points, level up, and spend stat points to become stronger.\n\nThis game focuses on combat, exploration, and player progression, and there is less emphasis on creative building compared to other games. It is aimed at players that have some familiarity with other voxel survival games.\n\n## Features\n\n* A vanilla MTG world augmented with the Extra Biomes mod\n* Many melee, ranged, and magical weapons to fight mobs with\n* Rebalanced armor stats\n* Sprinting and hunger mechanics\n* Gain EXP and level up by defeating mobs and mining ores\n* A simple stat system that allows players to choose what to prioritize\n* Progressive crafting guide that uses the Craft Lookup mod as a base\n* Familiar mobs that have been tweaked specifically for this game\n* Many types of food to make and eat\n* Status effects that can help or hinder players\n* Many tools provided by various mods that aid in exploration\n* A detailed in-game manual\n* Over 50 awards to aim for\n* ...and some other things for players to discover\n\n## Beginner Tips\n\n* Generally, it is best to craft a wooden pickaxe first, then make stone tools shortly after.\n* The **Craft Lookup** tab is where the crafting guide is located. Add blocks and items to the guide by discovering them, which can be done by picking them up or punching them.\n* Make sure to gather enough food while exploring. Look for crops growing throughout the world. Certain mobs also drop raw meat when defeated.\n* Chopping trees, mining ores, and defeating mobs gives EXP. Use stat points gained from leveling up in the **Level Up** tab. Dying causes some loss of progress towards reaching the next level, but inventory is kept.\n* Many monsters spawn during the night. It is recommended to have a shelter before the sun goes down.\n* It is very important to know that monsters become stronger at lower depths. Make sure to be prepared!\n* View the in-game manual for more details. Go to the **More** tab and click **Help**.\n\n## Usage Notes\n\nOnly the latest stable version of Luanti is officially supported.\n\nThis game is designed for the **v7** mapgen with floatlands. Other mapgens, except for v6, remain enabled if someone wants to experiment with them.\n\nThe gameplay has been designed with PC users in mind. Players on mobile platforms may find this game too difficult.\n\nNote that many of the mods included in yams RPG have been modified, so do not expect everything to be exactly the same as their ContentDB versions.\n\nTry to make sure that your minetest.conf does not have any settings that can interfere with yams RPG, especially if you are familiar with the mods used within this game.\n\n## Known Issues / Warnings\n\nThis game is a work-in-progress. As such, there is currently no guarantee that worlds will not break when new versions are released. Translations are also not supported or currently being accepted as strings may change without any warning. English is the only supported language right now.\n\nIt is not recommended to create a public server using this game at the moment. If you make mods specifically for yams RPG, which is currently discouraged, be aware that your mods may break between releases.\n\nSome prominent issues are listed below:\n\n* PvP is not supported\n* Creative mode has not fully been accounted for\n* Weather can behave strangely\n* Enemy mobs can get stuck or have weird behavior\n* Certain areas within the game are incomplete\n* A few items do nothing\n* The usual jank that WIP games have :)\n\nMost importantly, compatibility with other mods designed for Minetest Game is poor. I have not tested yams with any other mods, so issues are expected to occur when using additional mods. yams RPG does include modified versions of several mods, such as Mobs Redo, but I tried not to break their APIs. It is very likely that I did so on accident, though. Ideally, those mods should be usable in place of the upstream version, but that is probably not the case yet.\n\nThere are a few mod compatibility issues that I am already aware of:\n\n* Silver ore is not present by default, but there is an option to enable them\n* Many items from Farming Redo are not present (a setting to enable them will be added in the future)\n* Some mods from Minetest Game are not present\n* Creatura mobs will integrate poorly with the rest of the game\n\nSimpler mods that only add decorative items and blocks are more likely to work than more elaborate mods. Some quality-of-life and server administration mods may also work.\n\nMod compatibility will improve in the future, but it is already a lot of work to test everything within yams RPG itself, so please be patient :)\n\n## Licensing\n\nNote that while the game as a whole is licensed under the **GPLv3 only**, individual mods retain their original licenses. Any modifications I made to a particular mod are under that mod's license.\n\nIf you are looking for source code for a modified version of a mod, I have pushed all my forks onto Codeberg, and you can navigate to each submodule within this game's Git repository.\n\nSince yams RPG incorporates many mods, assets are under a variety of licenses, not just the CC-BY-SA 3.0 license as stated in the sidebar. That tends to be the most common license used for assets, but if you intend to reuse an asset from this game, make sure to verify the exact license of that asset.\n\nFor a general overview, consult LICENSE.txt and CREDITS.txt within the game's folder or the Git repository. For details regarding the licensing of a particular mod, consult any LICENSE or README files within the mod's folder.\n\nIf you read this far, thank you! Enjoy the game and feel free to leave feedback!",
  "maintainers": ["jara25"],
  "media_license": "CC-BY-SA-3.0",
  "name": "yams",
  "provides": [
    "3d_armor",
    "3d_armor_ip",
    "3d_armor_sfinv",
    "3d_armor_stand",
    "3d_armor_ui",
    "airtanks",
    "anvil",
    "armor_admin",
    "armor_bronze",
    "armor_cactus",
    "armor_crystal",
    "armor_diamond",
    "armor_gold",
    "armor_mithril",
    "armor_nether",
    "armor_steel",
    "armor_wood",
    "auroras",
    "awards",
    "beds",
    "boats",
    "bonemeal",
    "bones",
    "bucket",
    "builtin_item",
    "bweapons_api",
    "bweapons_bows_pack",
    "bweapons_firearms_pack",
    "bweapons_hitech_pack",
    "bweapons_magic_pack",
    "bweapons_utility_pack",
    "cactus_damage",
    "carts",
    "caverealms",
    "climate_api",
    "cloudlands",
    "connected_chests",
    "craft_lookup",
    "creative",
    "default",
    "doc",
    "doors",
    "dungeon_loot",
    "dye",
    "ebiomes",
    "edit_skin",
    "env_sounds",
    "farming",
    "farming_flood",
    "fire",
    "fire_plus",
    "flowers",
    "gadgets_api",
    "gadgets_consumables",
    "gadgets_default_effects",
    "gadgets_magic",
    "glamorous_deaths",
    "hangglider",
    "hbarmor",
    "hopper",
    "hudbars",
    "inventory_icon",
    "lighting_monoid",
    "lightning",
    "loose_rocks",
    "lootchests",
    "lootchests_default",
    "lootchests_magic_materials",
    "magic_materials",
    "mana",
    "mob_horse",
    "mobs",
    "mobs_animal",
    "mobs_crocs",
    "mobs_fish",
    "mobs_ghost_redo",
    "mobs_jellyfish",
    "mobs_monster",
    "mobs_sharks",
    "mobs_skeletons",
    "mobs_turtles",
    "moon_phases",
    "moreores",
    "nether",
    "nyancat",
    "orienteering",
    "other_worlds",
    "pigiron",
    "player_api",
    "player_monoids",
    "playereffects",
    "rainbarrel",
    "redef",
    "regional_weather",
    "ropes",
    "screwdriver2",
    "sfinv",
    "sfinv_bags",
    "sfinv_buttons",
    "shields",
    "shipwrecks",
    "show_wielded_item",
    "sickles",
    "sounds_redone",
    "spawn",
    "spears",
    "sprint_lite",
    "stairs",
    "stamina",
    "stardust",
    "stellar",
    "stellar_armor",
    "stellar_tools",
    "tmw_slimes",
    "tnt",
    "tph_spyglass",
    "tsm_pyramids",
    "tsm_railcorridors",
    "tt",
    "vessels",
    "visual_harm_1ndicators",
    "walls",
    "wieldview",
    "wooden_bucket",
    "wool",
    "xpanes",
    "yams_awards",
    "yams_base",
    "yams_compressed_blocks",
    "yams_doc",
    "yams_effects",
    "yams_farming",
    "yams_mapgen",
    "yams_materials",
    "yams_mobs",
    "yams_monoids",
    "yams_overrides",
    "yams_rpg",
    "yams_tt",
    "yams_weapons"
  ],
  "release": 31858,
  "repo": "https://codeberg.org/jara25/yams",
  "score": 76,
  "screenshots": [
    "https://content.luanti.org/uploads/e2e45e38bf.png",
    "https://content.luanti.org/uploads/7aa90f8604.png",
    "https://content.luanti.org/uploads/39ba04f9ef.png",
    "https://content.luanti.org/uploads/f49509d6ff.png",
    "https://content.luanti.org/uploads/f401307f6b.png"
  ],
  "short_description": "An MTG fork with light RPG elements.",
  "state": "APPROVED",
  "tags": ["adventure__rpg", "mtg", "pve", "survival"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/e2e45e38bf.png",
  "title": "yams RPG",
  "translation_url": null,
  "type": "game",
  "url": "https://content.luanti.org/packages/jara25/yams/releases/31858/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": { "jara25/yams": [] },
  "hash": "1al8sxj98wxq1s2c86w6zklmxdwhimf6hksh7077f15mhzi3bk08"
}
