{
  "author": "Avicennia_g",
  "content_warnings": [],
  "created_at": "2019-10-21T20:16:49.119388",
  "dev_state": null,
  "donate_url": null,
  "downloads": 1944,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": "https://github.com/Avicennia/Whack_A_Corn/issues/new/choose/",
  "license": "MIT",
  "long_description": "**Whack a Corn**\nWhat is this?\n\nA Minetest mod designed to add a corny little minigame to Minetest-games.\nCorny little minigame?\n\nYes. It is a minigame, and it is very very corny.\nWhat the heck is an \"Eggcorn\"?\n\nA better, more importantly visualized, even more importantly whackable way of referring to an \"Oronym\". Which is a very highfalutin' word for a word or phrase that is privy to being misinterpreted for something else that is not entirely unrelated to what the originally-intended-but-garbled-in-transmission was trying to convey. Also it's a corn kernel that was born inside of the body(shell?) of an egg, but not really.\nSo how do I get started in this?\n\nYou smash, you dash, you mash, you lash, you may even crash... (Use your tools to smash the eggcorns that pop in and out of existence like the stuff that comprises the universe, left click, you'd better be quick.) (Right click operations coming soon!)\nNodeCore:\n\nPlace an Eggcorn in the middle of 4 glowing lode prills. Aside from the prills, the area (a 31x31 square centered on the eggcorn, and 3 layers above) must be cleared of all obstructions.\nMTG:\n\nTBD\n\n\nCurrent Toollist:\n\n    wac:warrhammer\n    wac:codex_dimond\n    wac:bec_de_corbin\n    wac:baseball_bat\n    wac:vampirewhip\n    wac:paws\n\nCurrent Eggcorn quirks:\n\n    Simple\n    Melancholy\n    Cheerful\n    Petrifying\n    Myscus\n    Victorious\n    Fruity\n\nThe warrhammer is among the most sturdy, and responsible of all the tools. Enjoy the heft of it in your hands as you smash-and-dash your way around our horribly designed diagonal gameboard. Supposedly nobody knows how it got here, only that they found it hanging in a peculiar fashion in the broom closet with a thumb drive attached to it. The thumb drive conatined only a single text file on it with 3 chars in it (-1,0 and 1).\n\nIf you fancy yourself the more studious- for lack of a better word, \"nerdy\" approach, you can find the codex_dimond lying around somewhere. The book has an insatiable appetite for starfi- \"sea stars\", and it's a bit gaudy; but it's quite a different thing altogether from most of the other tools. And YES it's \"dimond\", no, not \"diamond\"; \"d-i-m-o-n-d\". Please acknowledge the distinction.\n\nIf you're liking the feel of the hammer but feel as if you're not the best at the \"dashing\" part, no need to worry. Our best chemists have recently designed a new tool; a \"whip\" of sorts (They prefer the term \"long chain hydrocarbon\", but that's a bit of a mouthful to say, like most of the stuff they work with). It will take some getting used to if you've spent a lot of time working with the hammer, but it's quite a good tool. They claim that they trained a vampire like a pet to be docile enough to lend them some power to make it, absolutely preposterous. Resultantly it's also called the vampirewhip by the hypebeasts that roam the plains.\n\nI heard something about eggs; where is that in all of this?\n\nIt's there... somewhere at least. The ration of egg to corn is still undefined. Perhaps Mr.Pullum could enlighten you as to his intended ratio. (The consensus is 50-50, but it varies wildly with circumstances)",
  "maintainers": ["Avicennia_g"],
  "media_license": "MIT",
  "name": "wac",
  "provides": ["wac"],
  "release": 2229,
  "repo": "https://github.com/Avicennia/Whack_A_Corn",
  "score": 5.5,
  "screenshots": [
    "https://content.luanti.org/uploads/c1L8UlSfLH.png",
    "https://content.luanti.org/uploads/jAXK3wLRdl.png",
    "https://content.luanti.org/uploads/M6qIxPYm3m.png",
    "https://content.luanti.org/uploads/ygGp1oSinT.png",
    "https://content.luanti.org/uploads/zgSFULcqXQ.png",
    "https://content.luanti.org/uploads/H5v7EFRN9A.png",
    "https://content.luanti.org/uploads/T9Xx1VaPHV.png"
  ],
  "short_description": "Use vaguely familiar tools, weapons and other items to smash \"eggcorns\" in this frantic, Nodecore-flavoured, smash-and-dash styled minigame.",
  "state": "APPROVED",
  "tags": ["mini-game", "pve", "pvp"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/c1L8UlSfLH.png",
  "title": "Whack-a-Corn",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/Avicennia_g/wac/releases/2229/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "Avicennia_g/wac": []
  },
  "hash": "0i419jk28ljaw8j5pyr9bmw6cl01msr95g4xdkcq6r07h5n6vmdl"
}
