{
  "author": "octacian",
  "content_warnings": [],
  "created_at": "2018-10-09T20:18:39.020644",
  "dev_state": null,
  "donate_url": null,
  "downloads": 3509,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=17607",
  "forums": 17607,
  "game_support": [],
  "issue_tracker": "https://github.com/octacian/televator/issues",
  "license": "MIT",
  "long_description": "Televator allows you to create simple elevators in your worlds that work incredibly fast amidst lag and are relatively inexpensive to make. All you need to get started, is to craft an elevator (`televator:elevator`).\n\nElevator nodes can be placed a maximum of 16 nodes apart. If anything obstructs the space between or there is not 2 blocks of space for the player above the next elevator node, the elevator will not work.\n\nOnce standing on an elevator that has other elevators placed with no obstructions above or below it, you can press jump to go up to the next elevator, and sneak to go down the the previous. There are sound effects too! While standing on an elevator you cannot jump normally so as to maintain a consistent feel when ascending and descending.\n\nTelevator does not use any entities, but rather teleports the player from elevator to elevator making it suitable for servers that prefer to use only the most efficient mods. This also helps increase general performance for users with less powerful computers or mobile devices, and provides a smooth and consistent feel.\n\n### Recipe\n![Recipe](https://github.com/octacian/televator/raw/master/.recipe.png)\n\nTelevator currently only supports Minetest Game items for it's recipe, however, I will gladly add support for other subgames on request. If you are unable to see the picture, please try a different browser such a Chrome/Chromium.",
  "maintainers": [
    "octacian"
  ],
  "media_license": "CC-BY-SA-3.0",
  "name": "televator",
  "provides": [
    "televator"
  ],
  "release": 695,
  "repo": "https://github.com/octacian/televator",
  "score": 6.7,
  "screenshots": [
    "https://content.luanti.org/uploads/R5JLYCOvGV.png"
  ],
  "short_description": "Televator allows you to create simple elevators in your worlds that work incredibly fast amidst lag and are relatively inexpensive to make.",
  "state": "APPROVED",
  "tags": [
    "tools",
    "transport"
  ],
  "thumbnail": "https://content.luanti.org/thumbnails/1/R5JLYCOvGV.png",
  "title": "Televator",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/octacian/televator/releases/695/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "octacian/televator": []
  },
  "hash": "10gi69bp6rn42366d7if9nyk9z7a1iih7zpybq6hgg14hdgvc0rv"
}
