{
  "author": "FaceDeer",
  "content_warnings": [],
  "created_at": "2020-03-03T05:23:34.000978",
  "dev_state": null,
  "donate_url": null,
  "downloads": 1421,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=24097",
  "forums": 24097,
  "game_support": [],
  "issue_tracker": "https://github.com/minetest-mods/bulletin_boards/issues",
  "license": "MIT",
  "long_description": "## Bulletin boards\n\nThis mod adds global bulletin boards to Minetest. These are boards where players can post short notes for other players to see, at a nominal cost.\n\n| ![](https://raw.githubusercontent.com/minetest-mods/bulletin_boards/master/screenshot.png) | ![](https://raw.githubusercontent.com/minetest-mods/bulletin_boards/master/screenshot_bulletin.png) |\n\nEach board can hold up to 56 bulletins (in an 8 by 7 grid), with each bulletin having a title and an icon that can be set by the player posting it. Once the bulletin board nears capacity, older bulletins will start being culled from the board to make room for new bulletins. They will be culled by preference starting with the bulletins belonging to the players who have the most bulletins currently posted, followed by the oldest bulletin belonging to those players.\n\nSo for example, if Alice has 1 bulletin on the board, Bob has 2 bulletins on the board, and Collin has 2 bulletins on the board, then when it comes time to cull a bulletin the oldest one belonging to either Bob or Collin will be culled. If that happens to be Bob's, then next time it's time to cull Alice will have 1, Bob will have 1, and Collin will have 2, so the oldest of Collin's bulletins will be culled. This ordering is done to try to balance things out fairly - players that hog the board with multiple bulletins will have their bulletins culled more often, but everyone's single most recent bulletin will stick around as long as possible.\n\nBulletin boards can have a cost associated with posting. If the player has the cost (an item stack) in their inventory, they can post and the cost will be automatically deducted.\n\nBoards are \"global\", in the sense that all instances of a given type of board will have the same content regardless of where they are in the world. This can make them useful as a means of communication over distance as well as time, serving as a sort of public post office.",
  "maintainers": [
    "FaceDeer"
  ],
  "media_license": "CC-BY-SA-3.0",
  "name": "bulletin_boards",
  "provides": [
    "bulletin_boards"
  ],
  "release": 21584,
  "repo": "https://github.com/minetest-mods/bulletin_boards",
  "score": 4,
  "screenshots": [
    "https://content.luanti.org/uploads/PEg2GKIK68.png",
    "https://content.luanti.org/uploads/p2gymGZGIp.png"
  ],
  "short_description": "Allows creation of global bulletin boards where players can post public messages",
  "state": "APPROVED",
  "tags": [
    "building",
    "multiplayer"
  ],
  "thumbnail": "https://content.luanti.org/thumbnails/1/PEg2GKIK68.png",
  "title": "Global Bulletin Boards",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/FaceDeer/bulletin_boards/releases/21584/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "FaceDeer/bulletin_boards": []
  },
  "hash": "1na5yb6a2x1ckhxwlmk2vyjhqfffj1xi1mc5956c8vf94sbm5sw6"
}
