{
  "author": "NO11",
  "content_warnings": [],
  "created_at": "2021-12-19T14:39:24.183404",
  "dev_state": "BETA",
  "donate_url": null,
  "downloads": 13412,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": "https://github.com/NO411/Balloonair/issues",
  "license": "GPL-3.0-only",
  "long_description": "# Balloonair\n## by NO11\n\nA hot air balloon game for Minetest.\n\n![screenshot](https://raw.githubusercontent.com/NO411/Balloonair/main/screenshot.png)\n\nThis game was created during 21 days for the 2021 Minetest GAME JAM.\nEverything (sounds, textures, models, code) was created by NO11 in these 21 days and it is under the GPL 3.0 license.\n\nThe goal of the game is to get the highest score. The score consists of the position of your balloon and the coins you collected.\nTry not to sink down!\nYou can play this game on a server with other players. You can see the scores of all players who have been on the server by running `/scores`.\n\n\n### Gameplay\n\nControl a balloon and fly as far towards the sun as you can.\n\nThere are 3 items which you can collect:\n\n* Gas bottle: drive forward faster\n* Sandbag: you can activate a total of 4, the balloon rises because it is losing weight\n* Shield: protects you from hills or birds, collect shield coins (green coins) to get it\n\nLeft click with the item to activate the boost. After 10 seconds the effect is removed.\nDo not try to hit birds, you will kill them and you will sink! If you hit the ground you lose. Be careful: you only come up with sand and otherwise the balloon will keep sinking.\nCollect coins to get more points!\nDo not worry if everything you see is black in the beginning! Then you spawned in a mountain, but as long as you are in it, you are immortal!\n\nWhile trying not to sink, enjoy the beautiful randomly generated landscape!\n\n\n### Controls\n\nWhere you move the mouse doesn't affect where you fly, you always fly in the direction of the sun and you can only steer right, left, up and down!\n\n* Down: lower the balloon\n* Left: move the balloon to the left\n* Right: move the balloon to the rigth\n* Jump: start game\n* Aux1: abort game\n* Dig: use the selected item\n* Escape: pause game\n\nAt the moment there are no global variables/functions, it is standalone.\nIf it gets enough positive feedback, maybe I'll create a modding API.\n\nThe game supports the current stable Minetest version 5.4.1, but with the 5.5-dev you have an even better gaming experience!\n\n\n##### Warning: Don't be frustrated if you spawn in a bad world and you crash into a mountain. Either use the shield you get at the beginning or you start a new world. Random worlds are nice to look at and a feature of this game, I don't want to do permanent levels! When the Game Jam is over, many other things can be added, such as a decelerator, so that you don't end up in areas of the map that Minetest has not even loaded.\n\n\n\n*Have fun with my game and enjoy your flight, NO11!*",
  "maintainers": ["NO11"],
  "media_license": "GPL-3.0-only",
  "name": "balloonair",
  "provides": ["balloon"],
  "release": 14625,
  "repo": "https://github.com/NO411/Balloonair",
  "score": 829.6,
  "screenshots": [
    "https://content.luanti.org/uploads/67bbae5661.png",
    "https://content.luanti.org/uploads/ad6f8ca8d5.png",
    "https://content.luanti.org/uploads/970463b3d9.png",
    "https://content.luanti.org/uploads/c12ada5979.png",
    "https://content.luanti.org/uploads/48bdf23faa.png"
  ],
  "short_description": "A hot air balloon game created for the 2021 Minetest GAME JAM.",
  "state": "APPROVED",
  "tags": ["jam_game_2021", "oneofakind__original"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/67bbae5661.png",
  "title": "Balloonair",
  "translation_url": null,
  "type": "game",
  "url": "https://content.luanti.org/packages/NO11/balloonair/releases/14625/download/",
  "video_thumbnail_url": "https://content.luanti.org/thumbnails/youtube/ieoJQBVY6ek.jpg",
  "video_url": "https://www.youtube.com/watch?v=ieoJQBVY6ek",
  "website": null,
  "dependencies": { "NO11/balloonair": [] },
  "hash": "015vnrc4wk95s4r3q9bwsbalyyxcay6inc2wjgaxa2z38g1r4y80"
}
