{
  "author": "Sumianvoice",
  "content_warnings": [],
  "created_at": "2023-11-25T02:21:05.122793",
  "dev_state": "BETA",
  "donate_url": null,
  "downloads": 7392,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": "https://codeberg.org/Age_of_Mending/Age_of_Mending/issues",
  "license": "MIT",
  "long_description": "# Age of Mending\n*Formerly Parity of the Minor Bearing*\n\nA game about worldbuilding, homeliness and exploration.\n\n![banner-image](https://raw.githubusercontent.com/SumianVoice/minetestmeta/master/aom_banner.png)\n\n## Warning!\nThis game is **in development**. Expect **sporadic** and occasionally **breaking updates** to happen, even possibly causing world corruption or loss of items. The entire design and structure of the game may change between updates without notice.\n\n*Known* **breaking changes** are listed in the short description, but there is no guarantee this covers all possible breaking changes. If you are on version 20 and the description says the last breaking update was 21, you can be sure that updating to 21 or higher will break at least *something*.\n\nChangelog:\nhttps://codeberg.org/Age_of_Mending/Age_of_Mending/releases\n\n## Quick Overview\n- has a lot of graphical effects that make it **not a potato compatible game**\n- is not \"survival voxel game\" in the *traditional* sense; no tool durability, **no grinding, no progression tree** or dopamine tredmill\n- **somewhat stable**, but **not reliable**; things might be jank but probably won't crash at least in singleplayer\n- a **fair amount of content**, but **not a lot of gameplay** aside from the core premise of building a world for yourself\n- art and \"creative potential\" focused, meaning it cares more about enabling player creativity than about balance or \"things to do\"\n\n## About Alpha\nAs stated in the warning at the top of the page, the game is not in a \"stable release\" state. Instead, I make rapid changes to the game on a \"when I feel like it\" basis. This will be the case until beta when it will move to a more stable and \"careful\" state. Until then, this is a kind of \"preview of development\" first, and a playable game second. You can readily assume any individual part of the game is a **placeholder** and many things will be unpolished or jank. See the issues on the repo for more info.\n\nThe game's design direction may also shift, and with this some feature might be removed. That's the price to pay for a game in alpha. There will be no expectation that the design will continue on the same path.\n\nMy approach to development is this: I want to make a cool game. If you want to play it, here it is. The social contract I'm offering is \"you're free to play this thing I made\" and nothing more.\n\n## Q and A\n### ⠀What kind of game is it?\nIt is a sandbox, mechanics-over-content world building game. The style or setting is early gunpowder era with low fantasy elements (think LoTR level magic at most). The focus is on the player **building**, exploring and defending their own **home and world**. **World building** and creating a place for yourself is what it should be best at. It is not about mining for materials or grinding for better gear, it is about constructing an immersive and meaningful place in a world.\n\n##### ⠀**Is this server-ready?**\nNo, but you're welcome to try, just post your crash reports in the issue tracker.\n##### ⠀**Is it ever going to be finished?**\nYesn't.\n##### ⠀**Is it actually playable as a game?**\nYes, but it's missing a lot of gameplay since it's not as progression focused as a lot of games.\n##### ⠀**How buggy is it?**\nCrashes are somewhat rare usually, and things mostly work, but the problems are less crashes and more \"why are all the caves so cramped\" or \"why can I sneak on ladders\" or \"why am I inside the ground now\" and so on. Not catastrophic, but certainly very jank.\n##### ⠀**Is it stable?**\nNo. It is **not stable.** Fundamental concepts like tool durability, inventories, tool tiers, and more are all *completely up in the air* and may be removed at any time. **I can't and won't be nice about back compatability**, and I won't compromise on that since it would grind development to *even more of a halt than my procrastination does*.\n##### ⠀**Is development active?**\nYou should assume not. I go through periods obsessively working 12 hours on it per day and then go months without even looking at it. Hey, don't judge me like that.\n##### ⠀**Why post it now?**\nPeople ask about it a fair bit, and so I figured I would just throw it on here and forget about it. This package will likely be replaced when entering stable / beta, and this will become the continuing unstable version. Then there would be a new package and new page for the stable version.\n##### ⠀**It looks good, but does all that fancy make it laggy?**\nEh, sort of. In terms of FPS, it's slower than opaque leaves, but substantially faster than fancy alpha all faces leaves. For mapgen, it's slow. Yes. It's slow. That's something to work on during beta or later alpha though as this game isn't even finished conceptually yet. For server step, it's going to be slower than Minetest Game, but it's probably on par with MCL variants. Most parts of the game use timers and node updates instead of ABMs and globalsteps, so it mostly only runs code when it actually kind of needs to. Again something to improve across beta. **It is worth noting that this is not only a pretty game with very little in the way of compromises on art, but it is also not a well optimised game, and will not run on a potato.**\n\nI get about 30-40fps with high shadows and a 300 or so view distance in dense forest areas, and about 40-50 with no shaders, using a GTX 1660ti mobile GPU (6gb, 1.4MHz).  For comparison, in Mineclonia this same sort of test with no shaders is about 28-35fps in less forested areas and about 25fps with shaders. This is planned to be improved as well.\n\n## What would it look like when 'complete'?\nThis is all *unlikely to be achieved any time soon or possibly at all*, but it's the direction the game is heading in. This is the design doc, since it won't fit into CDB: https://docs.google.com/document/d/144b6nOspRn9LL5kVwgvZWrFiqJ4iEi5Qh7tU-OElwHo\n\n## World and lore\nIn the world there will be a few main types of creatures:\n\n* dwarves and humans\n* spirits\n* animals\n* demonkin\n* half-demon half-animal magic beings\n\nThere is some lore to the world (secret), but no story or purpose beyond just \"play the game and do what you want\". There is no end or completion.\n\n## Cheatsheet\nThis obviously contains spoilers. Read at your own risk:\nhttps://docs.google.com/document/d/1AnVzK9VIWa0uqQ6E9vq5Cc85B_E154CC_ZFP-NS9qOw/\n\n　\n### Compatible with mte 5.6+. Other versions unknown. Definitely doesn't work on 4.x\nAlways using the newest version, assume no backwards compatibility.\n\n## Features missing as of version a24\nThese are some things you might assume to be part of a game like this, but are not implemented yet!\n\n1. combat system and *actual weapons* such as spears and swords\n3. mobs - there are some, but nowhere near the level that would be in the final game\n4. any actual crafting guide to tell you how to play the game - instead it has a Terraria-like crafting system, but you're still a bit blind as to what *can* be made if you got more materials\n5. structures - there are small schematic structures and ruins, but not any dungeons and villages etc\n6. spawn setting, spawning in wide areas instead of one point, PVP settings (on by default)\n7. several biomes not present, such as beaches, tundra mountains, arctic oceans / rivers\n\nYou can also see the issues tracker for more info on what to expect.\n\n## What *does* it have then?\n* mapgen and biomes\n* Terraria-like crafting system\n* some mobs\n* mob spawn inhibitors so you can have a safe home and peaceful builds\n* ores, tools, and ore processing\n* status effects for regen, featherfalling, poison etc\n* crops and food\n* cooking, furnaces, ovens\n* pipes for item transport\n* teleporters (hard to get for now)\n* warpberries allowing the player to move between two locations easily\n* bows\n* wings and gliding, flight\n* treefelling with axes\n* ropes for climbing, ladders\n* many many many building materials, types of bricks, shapes, colored terracotta, etc\n* wrench which can bulk-build in a cube / wall / line etc\n* the underworld, with its associated bricks and items\n* a floating island defense gamemode (?windmills join) ... which may or may not work in multiplayer\n* glowing mushroom biome (currently useless, but pretty)\n* an airship\n* lanterns, glow status effect for \"dynamic\" wearable lights, and a special item that allows for even better illumination ;)\n* lots of bugs and I don't mean fireflies\n\nThe game is coded pretty much from the ground up, partially because there is the stipulation that it remains MIT licensed and avoids restrictive licensing, but also because of my predisposition to just make the thing rather than learn someone else's API. As a result, you can fully expect that just about no mods will work with it unless they've been very carefully and deliberately made to work agnostically.",
  "maintainers": ["Sumianvoice"],
  "media_license": "CC-BY-4.0",
  "name": "pmb_core",
  "provides": [
    "age_of_mending",
    "aom_climate",
    "aom_compost",
    "aom_creative",
    "aom_explosives",
    "aom_fixes",
    "aom_fluidapi",
    "aom_gates",
    "aom_goblins",
    "aom_igm",
    "aom_item_entity",
    "aom_itemframe",
    "aom_longship",
    "aom_machines",
    "aom_music",
    "aom_picknode",
    "aom_playerapi",
    "aom_radial",
    "aom_scrap",
    "aom_settings",
    "aom_vehicleapi",
    "aom_warning",
    "aom_wire",
    "asignals",
    "attachto_player",
    "compatlib",
    "gm_windmills",
    "itemdesc",
    "player_info",
    "player_init",
    "player_model",
    "player_sprint",
    "player_swimming",
    "playerphysics",
    "pmb_admin_tools",
    "pmb_ambience",
    "pmb_animals",
    "pmb_bow",
    "pmb_combat",
    "pmb_cooking",
    "pmb_crafters",
    "pmb_dimensions",
    "pmb_doors",
    "pmb_dummy",
    "pmb_dyes",
    "pmb_elementals",
    "pmb_entity_api",
    "pmb_entity_base",
    "pmb_fengold",
    "pmb_fenn",
    "pmb_fire",
    "pmb_flora",
    "pmb_fonts",
    "pmb_food",
    "pmb_gamemodes",
    "pmb_glass",
    "pmb_hammer",
    "pmb_hand",
    "pmb_hud",
    "pmb_humanoid",
    "pmb_inventory",
    "pmb_items",
    "pmb_kelar",
    "pmb_kits",
    "pmb_lantern",
    "pmb_lights",
    "pmb_liquids",
    "pmb_map_base",
    "pmb_mirecaves",
    "pmb_mob_spawn",
    "pmb_muskets",
    "pmb_node_update",
    "pmb_on_generated",
    "pmb_pipes",
    "pmb_rope",
    "pmb_sch",
    "pmb_seelie",
    "pmb_soil",
    "pmb_sounds",
    "pmb_spawn",
    "pmb_spawn_inhibitors",
    "pmb_statusfx",
    "pmb_stone",
    "pmb_storage",
    "pmb_tcraft",
    "pmb_terracotta",
    "pmb_tools",
    "pmb_transit",
    "pmb_trees",
    "pmb_underworld",
    "pmb_util",
    "pmb_vars",
    "pmb_weather",
    "pmb_wield",
    "pmb_wings",
    "pmb_wood",
    "pmb_wrench",
    "sum_airship",
    "wield3d",
    "world_storage"
  ],
  "release": 28772,
  "repo": "https://codeberg.org/Age_of_Mending/Age_of_Mending.git",
  "score": 1553.2,
  "screenshots": [
    "https://content.luanti.org/uploads/b071ebaa2b.jpg",
    "https://content.luanti.org/uploads/f069923472.jpg",
    "https://content.luanti.org/uploads/6e44149789.jpg",
    "https://content.luanti.org/uploads/200e7850c4.jpg",
    "https://content.luanti.org/uploads/adc082ce07.jpg",
    "https://content.luanti.org/uploads/717648daf5.jpg",
    "https://content.luanti.org/uploads/c5b9b67789.jpg",
    "https://content.luanti.org/uploads/ed7d6acb5b.jpg",
    "https://content.luanti.org/uploads/42e798199d.jpg",
    "https://content.luanti.org/uploads/17e29ccd5d.jpg",
    "https://content.luanti.org/uploads/5c94160569.jpg",
    "https://content.luanti.org/uploads/c5c99dd306.jpg",
    "https://content.luanti.org/uploads/5496b92f32.jpg",
    "https://content.luanti.org/uploads/950e44365f.jpg",
    "https://content.luanti.org/uploads/87ccb8fcbf.jpg",
    "https://content.luanti.org/uploads/2a7ab38236.jpg",
    "https://content.luanti.org/uploads/3204e93d53.jpg",
    "https://content.luanti.org/uploads/2be5019522.jpg",
    "https://content.luanti.org/uploads/199ac79cb1.jpg",
    "https://content.luanti.org/uploads/3c068b513d.jpg",
    "https://content.luanti.org/uploads/c3bdb2f576.jpg",
    "https://content.luanti.org/uploads/ad2c9261a2.jpg",
    "https://content.luanti.org/uploads/be881a08a2.jpg"
  ],
  "short_description": "Age of Mending: Sandbox game about building your own world and exploring a new one. Last breaking changes: a28",
  "state": "APPROVED",
  "tags": ["adventure__rpg"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/b071ebaa2b.png",
  "title": "Age of Mending",
  "translation_url": null,
  "type": "game",
  "url": "https://content.luanti.org/packages/Sumianvoice/pmb_core/releases/28772/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "Sumianvoice/pmb_core": []
  },
  "hash": "036kvch6iyd6c2sfxhhbyg8qph5fnz1j7znwlfpdaj74z4m5ya1d"
}
