{
  "author": "Mr. Rar",
  "content_warnings": [],
  "created_at": "2022-04-27T16:21:23.962867",
  "dev_state": null,
  "donate_url": null,
  "downloads": 11533,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=17075",
  "forums": 17075,
  "game_support": [],
  "issue_tracker": "https://github.com/minetest-mods/edit/issues/new/choose/",
  "license": "MIT",
  "long_description": "\n## Overview\n\n\nThis mod named `edit` allows copying, pasting, filling, deleting, opening and saving 3D areas.\nSchematics are loaded and saved from .mts files located in the world sub folder `schems`.\n\nThis mod was inspired by the Fill Start and Fill End blocks in Manic Digger.\n\n![screenshot](https://raw.githubusercontent.com/minetest-mods/edit/master/screenshot.png)\n\n## Items\n\n| Name        | Item ID          | Image                              |\n| ----------- | ---------------- | ---------------------------------- |\n| Copy        | edit:copy        | ![](https://raw.githubusercontent.com/minetest-mods/edit/master/textures/edit_copy.png)        |\n| Paste       | edit:paste       | ![](https://raw.githubusercontent.com/minetest-mods/edit/master/textures/edit_paste.png)       |\n| Fill        | edit:fill        | ![](https://raw.githubusercontent.com/minetest-mods/edit/master/textures/edit_fill.png)        |\n| Replace     | edit:replace     | ![](https://raw.githubusercontent.com/minetest-mods/edit/master/textures/edit_replace.png)     |\n| Open        | edit:open        | ![](https://raw.githubusercontent.com/minetest-mods/edit/master/textures/edit_open.png)        |\n| Save        | edit:save        | ![](https://raw.githubusercontent.com/minetest-mods/edit/master/textures/edit_save.png)        |\n| Undo        | edit:undo        | ![](https://raw.githubusercontent.com/minetest-mods/edit/master/textures/edit_undo.png)        |\n| Circle      | edit:circle      | ![](https://raw.githubusercontent.com/minetest-mods/edit/master/textures/edit_circle.png)      |\n| Mirror      | edit:mirror      | ![](https://raw.githubusercontent.com/minetest-mods/edit/master/textures/edit_mirror.png)      |\n| Screwdriver | edit:screwdriver | ![](https://raw.githubusercontent.com/minetest-mods/edit/master/textures/edit_screwdriver.png) |\n| Polygon     | edit:polygon     | ![](https://raw.githubusercontent.com/minetest-mods/edit/master/textures/edit_polygon.png)     |\n| Bag         | edit:bag         | ![](https://raw.githubusercontent.com/minetest-mods/edit/master/textures/edit_bag.png)         |\n\n\n## Dependencies\n\nNone\n\n\n## Usage\n\n### Copy Tool\n\nWhen the copy tool is placed at opposite corners of an area, the area is copied. When the copy tool is placed for the first time, a marker entity is placed. To cancel the copy operation, punch the marker. When a copy tool is placed a second time, the selected area is copied and the markers are removed.\n\n\n### Paste Tool\n\nThe paste tool is used for pasting the area copied by the copy tool or a schematic loaded with the open tool. When a paste tool is placed, the copied area or schematic is placed at the corner of the paste tool. The copied area can be rotated by punching while holding the paste tool.\n\n\n### Fill Tool\n\nThe fill tool is used to fill a 3D area with a certain item. Start by placing the fill tool two times at opposite corners of the desired area.\n\nOnce a second fill marker is placed, a dialog appears listing all items in the players inventory. A search field is also available to search all items. Clicking an item will cause it to be used used for filling the selected area. Clicking on a blank inventory slot will cause the selected area to be filled with air. To cancel the fill, press the \"X\".\n\n\n### Replace Tool\n\nThe replace tool is used to replace certain nodes in a 3D area with a selected item. Start by placing the replace tool two times at opposite corners of the desired area.\n\nOnce a second replace marker is placed, a dialog appears listing all node types in the selected area. Check the nodes that should be replaced and then press the \"OK\" button to proceed with the next step. Next a dialog will pop up showing all the items in the players inventory. A search field is also available to search all items. Clicking an item will cause it to be used used to replace the nodes that were checked earlier. Clicking on a blank inventory slot will cause the checked nodes to be replaced with air. To cancel the replace, press the \"X\".\n\n\n### Open Tool\n\nRight click with this tool to load .we or .mts schematics from the world subfolder `schems` for pasting.\nLarge .we files may fail to load.\n\n\n### Save Tool\n\nRight click with this tool to save copied area as a .we or .mts schematic in the the world subfolder `schems`.\n.mts is the native schematic for Minetest. However it does not support node meta data so some nodes will not be properly saved.\nFor example, the contents of a chest will be missing.\n.we is the WorldEdit format. It supports node meta data but it produces much larger files than .mts.\nLarge .we files may fail to load.\n\n\n### Undo Tool\n\nRight click with this tool to undo a world modification like filling or pasting.\nUse a second time to redo the undo.\nOnly the most resent edit operation can be undone.\n\n\n### Circle Tool\n\nThis tool is used to create round structures. Place the tool to activate circle mode. A center point marker is placed wherever the circle tool is placed. In circle mode, any node that is placed will be repeated in a circle around the center point. Node digging is also repeated in the same way. To place or dig a node without it repeating it in a circle, press the aux1 key (E) while placing or digging. To exit circle mode, punch the circle center marker.\n\n\n### Mirror Tool\n\nThis tool is used to mirror the placement or digging of nodes. Place the tool to activate mirror mode. A center point marker is placed wherever the mirror tool is placed. In mirror mode all placed or dig nodes are mirrored. To place or dig a node without mirroring, press the aux1 key (E) while placing or digging. The mirror tool supports four modes, X, Z, X and Z, and eighths. To switch modes, right click the center marker. To exit mirror mode, punch the center marker.\n\n\n### Screwdriver\n\nThis tool is used for rotating nodes that support rotation. Right clicking a node with the screwdriver rotates the node around the X or Z axis depending on the player's position. Left clicking a node with the screwdriver rotates the node clockwise around the Y axis. Param2 types `wallmounted`, `facedir`, and `degrotate` are supported. The node is rotated 90 degrees for all param2 types except `degrotate` where the node is rotated by either 1.5 or 15 degrees. If the aux1 key (E) is held while rotating a `degrotate` node, the rotation angle will be increased by 4x.\n\n\n### Polygon Tool\n\nThis tool is used to create non-concave polygons in 3D space. Place the polygon tool to create markers. Each marker will create a triangle between itself, the last marker placed, and the first marker placed. The first marker placed will be green. To finish the polygon, place a marker on top of the green marker. After doing so, a dialog will appear to select a node or item to fill the polygon.\n\n\n### Bag\n\nThe bag tool is used to place random items from a list of items. Dig (left click) with the bag to open the bag's inventory. Any item from the player inventory can be moved into the bag. The bag has 16 item slots. When placing the bag an item from the bag is randomly chosen to be placed. If a stack of several items is present in the bag, the item will be more likely to be placed than a single item. The probability of being placed is proportional to the item's count divided by the total count of items in the bag. For example, the probability of getting wood would be 75% for a bag with 3 wood and 1 dirt. Bags can be combined with other edit tools, for example, to fill an area with random kinds of dirt.\n\n\n## Settings\n\n### edit_paste_preview_max_entities\n\nIf the copied area has a larger number of nodes, some nodes will be randomly excluded from the preview.\n\n\n### edit_max_operation_volume\n\nThe maximum volume of any edit operation. Increase to allow larger operations.\n\n\n### edit_fast_node_fill_threshold\n\nWhen the fill operation has a larger volume then the specified number, fast node fill will be used. To disable fast node placement, set the threshold to be equal to the max operation volume. To disable slow node placement, set the threshold to 0. With fast node placement, callbacks are not called so some nodes might be broken.\n\n\n### edit_polygon_preview_wire_frame_threshold\n\nIf one side of the polygon preview is greater than this setting, a wire frame is used instead of the full preview. The full preview fills the entire polygon with preview entites. If the polygon gets big, the full preview will quickly crash a server. The wire frame preview outlines the triangle componants of the polygon. This setting only affects the preview. The polygon is always completely filled regardless of this setting.\n\n\n## Privileges\n\nEdit tools and nodes can only be used by players with `edit` privilege.\n\n\n## License\n\nMIT by MrRar check [License](https://raw.githubusercontent.com/minetest-mods/edit/master/LICENSE.txt) file, this mod was started by MrRar, \nminetest-mods community.",
  "maintainers": ["Mr. Rar"],
  "media_license": "CC0-1.0",
  "name": "edit",
  "provides": ["edit"],
  "release": 29024,
  "repo": "https://github.com/minetest-mods/edit",
  "score": 1772.6,
  "screenshots": [
    "https://content.luanti.org/uploads/c32218bfaa.png",
    "https://content.luanti.org/uploads/da432dc35d.png"
  ],
  "short_description": "Allows copying, pasting, filling, deleting, replacing and saving 3D areas",
  "state": "APPROVED",
  "tags": ["building_mechanics", "creative", "world_tools"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/c32218bfaa.png",
  "title": "Edit",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/Mr.%20Rar/edit/releases/29024/download/",
  "video_thumbnail_url": "https://content.luanti.org/thumbnails/youtube/4pl2JhVnT9k.jpg",
  "video_url": "https://www.youtube.com/watch?v=4pl2JhVnT9k",
  "website": null,
  "dependencies": { "Mr. Rar/edit": [] },
  "hash": "0jha0srlyz0g810fh4xqdia9l0pxwhn27yg11h2hiq47zw1fny5h"
}
