{
  "author": "Noodlemire",
  "content_warnings": [],
  "created_at": "2020-07-13T00:15:06.908661",
  "dev_state": null,
  "donate_url": null,
  "downloads": 3423,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=25060",
  "forums": 25060,
  "game_support": [],
  "issue_tracker": "https://github.com/Noodlemire/projectile/issues/new/choose/",
  "license": "LGPL-2.1-only",
  "long_description": "The moment I read that collision info is now given to entities' on_step function in the 5.3.0 changelog, I immediately wanted to try it out in a mod.\n\nThis mod adds a couple types of bows and slingshots to the game. The main difference between a bow and slingshot in this mod, is the kind of available ammo. Slingshots can fire a few different small objects as projectiles, which are relatively easy to obtain in large quantities. Bows are a lot more powerful, but require more time \"charging\" up a shot before they can fire at full power, and require arrows made from less common resources.\n\nThe basic ammunition for slingshots is the rocks from hardtrees. They can also fire mese crystal fragments that activate mesecon effectors as long as said mod is active, and obsidian shards which are almost as strong as an arrow.\n\nBasic arrows are made from flint, sticks, and feathers. Feathers can come from mobf, creatures, or mobs redo. Fire arrows can be made by combining arrows with torches. Four high velocity arrows can be made from combining four arrows with a gold ingot. Lastly, bomb arrows can be made from combining arrows with TNT sticks.\n\nBasic bows and slingshots are made from sticks and string. If you have the basic_materials mod, you can craft upgraded steel versions using bars and wire.\n\nTo use slingshots or bows, right-click to start charging. Rather than holding and releasing the button, you must press right-click again to fire. You can cancel a charge by left-clicking or selecting a different hotbar item. The ammo used is selected from the first usable item found in your main inventory, when looking in ascending numberical order. In other words, if multiple ammo types are in your inventory, projectiles to the left are chosen before ones to the right, and projectiles in high rows will be chosen before ones in low rows.",
  "maintainers": [
    "Noodlemire"
  ],
  "media_license": "LGPL-2.1-only",
  "name": "projectile",
  "provides": [
    "projectile"
  ],
  "release": 4832,
  "repo": "https://github.com/Noodlemire/projectile.git",
  "score": 162,
  "screenshots": [
    "https://content.luanti.org/uploads/OckicjKhxY.png",
    "https://content.luanti.org/uploads/EL4aO3QvMf.png",
    "https://content.luanti.org/uploads/zVerpXoGgt.png",
    "https://content.luanti.org/uploads/z9YZe2G894.png",
    "https://content.luanti.org/uploads/bk1zWNB0HO.png"
  ],
  "short_description": "Adds various projectile weapons which work based off of MT 5.3.0's new collision info provided to objects' on_step functions.",
  "state": "APPROVED",
  "tags": [
    "pve",
    "pvp",
    "survival",
    "tools"
  ],
  "thumbnail": "https://content.luanti.org/thumbnails/1/OckicjKhxY.png",
  "title": "Projectiles",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/Noodlemire/projectile/releases/4832/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "Noodlemire/projectile": []
  },
  "hash": "00w3g4cmnfgwj98sz4i1w8ic73q4zgwabbhaify49pbialfyyd5k"
}
