{
  "author": "mt-mods",
  "content_warnings": [],
  "created_at": "2022-09-26T13:14:41.847717",
  "dev_state": "ACTIVELY_DEVELOPED",
  "donate_url": null,
  "downloads": 578,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": "https://github.com/mt-mods/beerchat/issues",
  "license": "LGPL-3.0-only",
  "long_description": "Beerchat\n-----------------\nStandalone chat channel mod\n\n### Features\n\n* Chat channels\n* Whispering (`$ hello there`)\n* Shortcommands (`#channel hello` `@player hello`)\n* Optionally protected chat channels\n* Message cleanup tools like control code and Discord custom emoji tag cleaner\n* Moderation tools like channel banning and restricting chat features\n* Matterbridge-integration (IRC/Discord/matrix/etc)\n\n### Selectable components\n\n* `mute` is enabled by default. Allows players to mute other players.\n* `me` is enabled by default. Allows sending special formatted \"/me message here\" messages to channel.\n* `hash` is enabled by default. Allows switching channels with \"#channelname\" and sending to channel with \"#channelname message here\".\n* `pm` is enabled by default. Allows \"@player message here\" to send private messages to players.\n* `whisper` is enabled by default. Allows \"$ message here\" to send message to nearby players.\n* `jail` is disabled by default. Adds \"/chat_jail playername\" and \"/chat_unjail playername\" commands.\n* `ban` is disabled by default. Adds \"/channel_ban [#channel] playername\" and \"/channel_unban [#channel] playername\" commands.\n* `remote_mute` is disabled by default. Allow muting remote users.\n* `cleaner` is disabled by default. Removes control characters from incoming messages.\n* `override` is enabled by default. Overrides for message handlers provided by other mods.\n* `colorize` is enabled by default. Allows colorizing messages on specified channels.\n* `announce` is disabled by default. Set server wide announcements.\n* `force2channel` is enabled by default. Adds command \"/force2channel channel,player\".\n* `password` is enabled by default. Adds complaints for bad password (default or empty).\n* `event-logging` is enabled by default. Adds logging and info messages for certain events.\n* `alias` is disabled by default. Allows linking channels through channel aliases.\n\nTo enable or disable components use `beerchat.enable_<name>` in Minetest configuration file.\nFor example to enable server wide announcement feature and disable whispering you should add following to the Minetest configuration file:\n```ini\nbeerchat.enable_announce = true\nbeerchat.enable_whisper = false\n```\n\nSome of the selectable features either require or can use more configuration options, unfortunately many of these are currently undocumented but fortunately most are found from top of the said feature source code file. All of these source files are within `plugin` directory.\n\n### Using selectable features\n\n**Whisper**, in addition to what is in short description, also allows setting range with `$10 hello there!` so only players closer than 10 nodes will see messages. Default is 32 nodes, maximum is 200 nodes. Additionally you can toggle whisper mode with preset range by using dollar-range command without any message, for example `$10` to activate whisper mode with 10 node range. When in whisper mode you do not need to use any commands or dollar sign to whisper, every message you send is automatically whispered. To return back to normal chat mode, use dollar without range or message, for example `$`.\n\n**Jail** default channel name is `grounded`. Jailing locks players to that channel and disallows channel switching, channel joining, private messages, whispering. Jailed players can only talk publicly in jail channel. Unjailing removes these restrictions, removes player from jail channel and returns player to to their original channel. Normally anyone can join jail channel if they want but joining can be restricted with password. Forcing player out of the jail channel with force2channel will also remove jail restrictions from target player.\n\n### More documentation\n\nSome of the commands added through selectable features have usable documentation included in game, this is available with built in `/help` command. For example `/help server-announce` will display basic information on how to use that command and is often enough to efficiently use said command. On the other hand we have to admit that there is more features than what is documented, to find these either read the code or if you know what you want you can very well come ask if feature you are looking for is hidden under the hood.\n\nSome incomplete documentation and installation instructions for extended use are available here: https://github.com/mt-mods/beerchat/",
  "maintainers": [
    "mt-mods",
    "SwissalpS",
    "OgelGames",
    "-SX-",
    "BuckarooBanzay"
  ],
  "media_license": "CC-BY-SA-4.0",
  "name": "beerchat",
  "provides": ["beerchat"],
  "release": 25013,
  "repo": "https://github.com/mt-mods/beerchat/",
  "score": 3.1,
  "screenshots": ["https://content.luanti.org/uploads/2a2c3ea347.png"],
  "short_description": "standalone chat channel mod",
  "state": "APPROVED",
  "tags": ["chat", "server_tools"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/2a2c3ea347.png",
  "title": "Beerchat",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/mt-mods/beerchat/releases/25013/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": "https://github.com/mt-mods/beerchat/",
  "dependencies": {
    "mt-mods/beerchat": []
  },
  "hash": "1m4njm1l6gm8x0s0zcz2lb52vi7sgfavqnqj41pgcpa0g1rs5ksp"
}
