{"author":"Noodlemire","content_warnings":[],"created_at":"2020-01-13T23:00:48.364627","dev_state":null,"donate_url":null,"downloads":1465,"forum_url":"https://forum.luanti.org/viewtopic.php?t=20255","forums":20255,"game_support":[],"issue_tracker":"https://github.com/Noodlemire/clumpfall/issues/new/choose/","license":"LGPL-2.1-only","long_description":"This mod is designed to set most typical nodes, including ones added by other mods, so that they fall in a very particular way: They will only start falling if there are no Clump Fall Nodes connected to their bottom side, edges, or corners, and they will not fall all at once, but rather a continuous series of \"clumps\", each about one second after another. This falling method is used to reduce lag overall when a large amount of nodes come loose and begin falling, as instead of 100+ nodes slowing down the world, several sets of 10+ nodes will cascade down with only minimal slowing to anything else. Additionally, due to the nature of how a Clump Fall Node is determined to be needing to fall or not, pyramid structures are often very effective for construction under this mod, and also very often form inside caverns and over structures that have large, easily collapsable ceilings.\n\nNodes that are considered to be \"Clump Fall Nodes\" are everything that falls outside of the Falling Nodes, Attached Nodes, Liquid, and Unbreakable groups. Anything that doesn't belong to those groups, including nodes that are registered by other mods, will fall into this category.","maintainers":["Noodlemire"],"media_license":"LGPL-2.1-only","name":"clumpfall","provides":["clumpfall"],"release":9072,"repo":"https://github.com/Noodlemire/clumpfall","score":152.8,"screenshots":[],"short_description":"Makes most nodes able to fall without enough support.","state":"APPROVED","tags":["building","environment","pve"],"thumbnail":null,"title":"Clump Fall Nodes","translation_url":null,"type":"mod","url":"https://content.luanti.org/packages/Noodlemire/clumpfall/releases/9072/download/","video_thumbnail_url":null,"video_url":null,"website":null,"dependencies":{"Noodlemire/clumpfall":[{"is_optional":false,"name":"entitycontrol","packages":["Noodlemire/voxeldungeon","Noodlemire/entitycontrol"]}],"Noodlemire/entitycontrol":[]},"hash":"1azqmxi1axy640dx3jnffpm44a1lzvwz0d6rjxkjwgbvapnz4w5z"}