{
  "author": "Warr1024",
  "content_warnings": [],
  "created_at": "2024-03-06T13:01:03.723307",
  "dev_state": "ACTIVELY_DEVELOPED",
  "donate_url": "https://liberapay.com/Warr1024",
  "downloads": 307,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": null,
  "license": "MIT",
  "long_description": "This mod defines a number of discrete stops for camera angles, and allows a player to use special input sequences to:\n\n- Snap the camera angle (pitch and yaw) to the nearest stop.\n- Turn the camera (pitch, yaw, or both) one single step.\n\nThis can be particularly useful for consistent orienting of the player in sightless gaming conditions, such as:\n\n- Games with no visuals, such as [Veil of the Unknown](https://content.minetest.net/packages/StarNinjas/veil_of_the_unknown/)\n- Blindfolded speedrunning\n\nEach camera movement will make a distinct sound.\n\nUse with a gamepad or joystick (and AntiMicroX, if Minetest still lacks game pad support) is recommended to precisely control angle stepping inputs and avoid moving the camera accidentally.\n\n### Control Inputs\n\n- Stand still (pressing no other inputs) and press and hold Aux1\n- To snap the camera to the nearest stop, do nothing else and release Aux1 after a short amount of time (just enough for 1 server step to recognize the input).\n- To change the camera angle by 1 step, nudge the camera in the direction you want to turn before releasing Aux1.\n\t- 8 directions (including diagonals) are supported.\n\t- There is a small dead zone (nudge must be large enough)\n\t- Nudges should not be too large (avoid wrapping around on horizontal axis)\n\nNote that it is currently (as of MT 5.8) not possible to change the camera angle without sending the player a position update, which will cause movement jank, and hence why the camera control gestures are not supported while moving.\n\n### Configuration\n\nConfiguration can be accessed in the **Content: Mods** setting section of the Minetest settings menu.\n\nThe number of horizontal and vertical angle stops can be adjusted by configuration, but default to 45 degree angles.\n\nThe size of the dead zone (the amount of movement tolerated before a deliberate camera movement is detected) can be adjusted.\n",
  "maintainers": [
    "Warr1024"
  ],
  "media_license": "MIT",
  "name": "anglegrinder",
  "provides": [
    "anglegrinder"
  ],
  "release": 24222,
  "repo": "https://gitlab.com/sztest/anglegrinder",
  "score": 5.8,
  "screenshots": [
    "https://content.luanti.org/uploads/87cf161f92.webp"
  ],
  "short_description": "Snap camera to discrete angles",
  "state": "APPROVED",
  "tags": [
    "player_effects"
  ],
  "thumbnail": "https://content.luanti.org/thumbnails/1/87cf161f92.png",
  "title": "Angle Grinder",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/Warr1024/anglegrinder/releases/24222/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "Warr1024/anglegrinder": []
  },
  "hash": "0yfchx4fndndq0ak1rvycicc4dr0lmgg1czw27zgkh9fr1a98x3c"
}
