{
  "author": "advtrains_supplemental",
  "content_warnings": [],
  "created_at": "2023-12-21T16:33:02.087556",
  "dev_state": "ACTIVELY_DEVELOPED",
  "donate_url": null,
  "downloads": 1518,
  "forum_url": null,
  "forums": null,
  "game_support": [
    {
      "confidence": 10,
      "game": {
        "author": "Minetest",
        "name": "minetest_game",
        "release": 29742,
        "short_description": "The classic \"Minetest\". A lightweight and well-maintained base for modding",
        "thumbnail": "https://content.luanti.org/thumbnails/1/8ffd1409ff.png",
        "title": "Minetest Game",
        "type": "game"
      },
      "supports": true
    }
  ],
  "issue_tracker": "https://codeberg.org/advtrains_supplemental/advtrains_train_jpntlr600/issues",
  "license": "AGPL-3.0-only",
  "long_description": "# Japanese Tram TLR0600\n## by takaosan\n\nThis mod is an extension for Advtrains that provides the front and rear units of a light rail tram inspired by the Japanese TLR0600 from Toyama. The tram features a modern exterior and has a detailed interior and would look good in most modern urban settings.\n\nThe current version of this mod includes a generic matched pair of front and rear units. If this mod is used with the optional [AdvTrains Livery Tools](https://content.minetest.net/packages/Marnack/advtrains_livery_tools/) modpack, players will be able to customize the livery of these trams in game by using the Livery Designer Tool.\n\nThis mod also still includes the now deprecated original four matched pairs of front and back units in blue, green, red and yellow. They are not available by default but can be enabled via the \"Include deprecated trams\" mod setting (default = Disabled).  Unless playing in an existing game which used an earlier version of this mod or in a game that is not using the AdvTrains Livery Tools mod, these deprecated wagons should not be needed since they can be easily replicated with the livery tool.\n\nThe following livery templates are currently defined for the trams in this mod:\n\n* \t\"Toyama\" - This template can be used to replicate the livery style of the deprecated units which is based on the livery of the trams in Toyama, Japan. It allows for customization of the service color surrounding the doorways and in various windows as well as the exterior walls, window trim and seats.\n* \t\"Ribbon\" - An optional multicolored ribbon meanders around the exterior of the unit. It can be colored to match the service line if desired. The exterior walls, window trim and seats can also be customized.\n* \t\"Upper-Lower Split\" - This template allows for different colors to be applied to the upper and lower portions of the exterior walls as well as an optional service color stripe. The window trim and seats can also be customized.\n\nSeveral predefined liveries based on these templates are also available in the livery tool, including four predefined liveries that replicate the deprecated trams.\n\nNote that the livery tool will open and display information for the deprecated units but there are no livery customization options or predefined liveries for these units. Thus, it will only allow the player to view but not modify these older wagons.\n\nThe new generic tram units will have crafting recipes when this mod is used along with with the default mod from Minetest Game. As it was in earlier versions of this mod, the deprecated trams have no crafting recipes so players will need to use the /give or /giveme command to acquire these units when playing in survival mode.\n\nThis mod features a system that updates the appearance of the trams such that they appear to be realistically illuminated at night. Since the system is only based on the time of day, however, it has some limitations, such as the illumination effect not being applied if a tram is located in a darkened area such as a tunnel during the daytime. This feature can be disabled via the \"Use illuminated appearance of trams during the night\" mod setting (default = Enabled).\n\nThe driver's stand is accessed in the front unit which is the one without the pantograph on its roof.\n\nThese units have sounds but not animated doors.\n\n### Download\n* Current version: https://codeberg.org/advtrains_supplemental/advtrains_train_jpntlr600\n* Original version: https://github.com/takao-soramu/advtrains_train_jpntlr600\n\n### Installation\n * Extract .zip contents to: [path to minetest folder]/mods/advtrains_train_jpntlr600\n * Sample textures have been provided for future reference: ./sample_textures\n\n### Licence\n* License of code: GNU AGPL version 3 (see License.txt)\n* License of media: CC-BY-SA 3.0 (see LICENSE_media.txt)\n\nThe following copyrights apply:\n* Original code and assets copyright (C) 2020 takaosan\n* Some code copyright (C) 2020 Maverick2797\n* Some code copyright (C) 2022 W3RQ01\n* Some code and assets copyright (C) 2023 Marnack\n\n### Credits\n* Original Author: Takaosan\n* Contributions by Maverick2797\n\t* Tidy code\n* Contributions by W3RQ01\n\t* Update max speed\n* Contributions by Marnack\n\t* Add mod setting to control illuminated appearance of trams\n\t* Improve activation timing of illumination effect\n\t* Add a new generic version of the TLR0600 tram pair that can be modified with the livery designer tool from the optional AdvTrains Livery Tools modpack.\n\t* Deprecate the original 4 pairs of trams that have preset colors and add a mod setting to control if they should be included in the game.\n\t* Generalize the nighttime illuminated tram effect to also apply to the new generic TLR0600 trams, including those with customized liveries.\n\t* Add crafting recipes for the generic TLR0600 trams when this mod used with Minetest Game.\n\n### More Information\n* See https://advtrains.de/ for more information about Advtrains\n\nUse of this mod is at your own risk. The author and contributors can not be held liable or responsible for any damages caused by using any part of this mod.\n\n\nこのModは、Minetest向けADVTRAINS Modのアドオンデータです。これ単体では利用できません\n\nこのModで生じたいかなる損害も、製作者は一切の責任を負いません\n\nADVTRAINS Modのライセンスを継承します\n",
  "maintainers": [
    "advtrains_supplemental",
    "Blockhead",
    "W3RQ01"
  ],
  "media_license": "CC-BY-SA-3.0",
  "name": "advtrains_train_jpntlr600",
  "provides": [
    "advtrains_train_jpntlr600"
  ],
  "release": 26981,
  "repo": "https://codeberg.org/advtrains_supplemental/advtrains_train_jpntlr600",
  "score": 37.9,
  "screenshots": [
    "https://content.luanti.org/uploads/b7c37b4bb3.png",
    "https://content.luanti.org/uploads/0cc4d365a3.jpg",
    "https://content.luanti.org/uploads/f928b8a25a.png"
  ],
  "short_description": "A tram for Advtrains inspired by the Japanese TLR0600 tram.",
  "state": "APPROVED",
  "tags": [
    "simulation",
    "transport"
  ],
  "thumbnail": "https://content.luanti.org/thumbnails/1/b7c37b4bb3.png",
  "title": "Advtrains Japanese Tram TLR0600",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/advtrains_supplemental/advtrains_train_jpntlr600/releases/26981/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "advtrains_supplemental/advtrains_train_jpntlr600": [
      {
        "is_optional": false,
        "name": "advtrains",
        "packages": [
          "orwell/advtrains"
        ]
      }
    ],
    "orwell/advtrains": []
  },
  "hash": "0mpgfwx09kg7bb726lr6pmqpqfq6aljwkgid57xil3p3w6ij73b9"
}
