{"author":"Neuromancer","content_warnings":[],"created_at":"2024-02-11T03:12:05.922544","dev_state":"ACTIVELY_DEVELOPED","donate_url":null,"downloads":464,"forum_url":"https://forum.luanti.org/viewtopic.php?t=30228","forums":30228,"game_support":[],"issue_tracker":"https://github.com/Neuromancer56/hero_jetpack/issues","license":"MIT","long_description":"#This mod recreates the flight mechanic of the game H.E.R.O.\n\nhero_jetpack is a fork of sum_jetpack mod by Sumi (info@sumianvoice.com)\nThe point of this mod is to be a part of a set of mods that recreate the game H.E.R.O. in Minetest.  (one of my favorite childhood games)  \nTo that end, one of the major changes is that this forked version of mod requires you to tap or press the space bar to maintain altitude making flying more interesting and challenging.  However this mod can also be used even if it is not part of H.E.R.O. game.  Another change is that the jetpack is now activated using the left mouse button so that it can be activated even when pointing at a node which is common in mines.\n\nUsage: \n\n* To enable:  hold down *left* mouse button with jetpack in your hand until you hear the jetpack start.\n*  Shift/Sneak to disable\n*  When you run out of fuel, craft a full jetpack by putting fuel above the pack in the crafting grid.\n\nIf you want to try out where I'm going with the game (very early phases) check out [this collection](https://content.minetest.net/collections/Neuromancer/hero_test/).  Be sure to adjust the settings as I have noted in the comments.  \n\n### H.E.R.O (Atari 2600)\n\nH.E.R.O. gameplay can be seen here: https://www.youtube.com/watch?v=nD0VTuVQ6Tg\nThere will be a number of mods all beginning with \"hero_\" so that eventually if you enable all of them you will essentially be playing the game hero.\n\nHero Player Manual: https://atariage.com/manual_html_page.php?SoftwareLabelID=228\n\nThe plan is to have all of these \"hero\" mods function as stand alone mods so that they can combined in other ways with other mods to work with and create other games.\n\nFrom [Wikipedia](https://en.wikipedia.org/wiki/H.E.R.O._(video_game)):\n\n> H.E.R.O. (an acronym standing for Helicopter Emergency Rescue Operation) is a single-player video game published by Activision. First developed for the Atari 2600 and released in March 1984, the game was ported to many of the home computers and gaming consoles of that era. In the game, the player uses a helicopter backpack and other tools to rescue victims trapped deep in a mine.\n>    The player assumes control of Roderick Hero (sometimes styled as 'R. Hero', a play on 'our hero'), a one-man rescue team. Miners working in Mount Leone are trapped, and it's up to Roderick to reach them. \n>\n> The player is equipped with a backpack-mounted helicopter unit, which allows him to hover and fly, along with a helmet-mounted laser and a limited supply of dynamite. Each level consists of a maze of mine shafts that Roderick must safely navigate in order to reach the miner trapped at the bottom. The backpack has a limited amount of power, so the player must reach the miner before the power supply is exhausted.\n>    A number of obstacles stand between Roderick and the miners. Some mine shafts are blocked by cave-ins, which require dynamite to clear, but Roderick must not stand too close when the dynamite explodes. The helmet laser can also destroy cave-ins, but it does so much more slowly than dynamite. Some mine sections are illuminated by lanterns. If the lantern is somehow destroyed, the layout of that section becomes invisible; exploding dynamite will light up the mine for a very short time. The mine shafts are populated by spiders, bats and other unknown creatures that are deadly to the touch; these creatures can be destroyed using the laser, or will also be destroyed if they are close to exploding dynamite. In later levels, the player must contend with magma, which, like cave-ins, can be dynamited to clear a path, but like the mine creatures, is lethal when touched. Lastly, some deep mines are flooded, forcing players to hover safely above the water. Points are scored for each cave-in cleared and each creature destroyed. When the player reaches the miner, points are awarded for the rescue, along with the amount of power remaining in the backpack and for each remaining stick of dynamite. Extra lives are awarded for every 20,000 points scored.\n\t \nYou can play it here:  \nPay what you want:  https://lowcarb.itch.io/hero-is-back\n Online Atari Version (more klunky) https://www.retrogames.cz/play_228-Atari2600.php?language=EN Just hit \"f12\"  to start.\n\n","maintainers":["Neuromancer"],"media_license":"CC-BY-4.0","name":"hero_jetpack","provides":["hero_jetpack"],"release":24276,"repo":"https://github.com/Neuromancer56/hero_jetpack","score":12.8,"screenshots":["https://content.luanti.org/uploads/22f6f716b5.png"],"short_description":"Jetpack that works like challenging one in H.E.R.O. game.","state":"APPROVED","tags":["mini-game","player_effects","transport"],"thumbnail":"https://content.luanti.org/thumbnails/1/22f6f716b5.png","title":"Hero Jetpack","translation_url":null,"type":"mod","url":"https://content.luanti.org/packages/Neuromancer/hero_jetpack/releases/24276/download/","video_thumbnail_url":null,"video_url":null,"website":"https://forum.minetest.net/viewtopic.php?t=30228","dependencies":{"Neuromancer/hero_jetpack":[{"is_optional":false,"name":"playerphysics","packages":["Wuzzy/mineclone2","Sumianvoice/pmb_core","VoxelForge/voxelforge","Wuzzy/lazarr","ryvnf/mineclonia","TestificateMods/playerphysics","Wuzzy/hades_revisited","Casimir/voxelgarden","Wuzzy/shadow_forest","Wuzzy/playerphysics","Wuzzy/glitch","Sumianvoice/extra_ordinance"]}],"TestificateMods/playerphysics":[]},"hash":"0zykn4jynzz6c6vyx86ihhrgbg6c4py7yfgjhmrg6cjdjhj3vwv6"}