{
  "author": "GreenXenith",
  "content_warnings": [],
  "created_at": "2021-04-12T23:00:14.394983",
  "dev_state": null,
  "donate_url": null,
  "downloads": 4322,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=26565",
  "forums": 26565,
  "game_support": [],
  "issue_tracker": "https://github.com/GreenXenith/greek/issues",
  "license": "MIT",
  "long_description": "_It's all Greek to me._  \n\nThis mod is completely dependency-agnostic, meaning no extra mods are required to have any content. Some mods are optionally required to provide certain crafting recipes (see [Dependencies](#dependencies)). All non-`greek` recipe items are configurable (see [Configuration](#configuration)).\n\n## Contents\n* Polished marble\n* Carved marble tiles\n* Painted marble tiles\n* Marble pillars\n* Marble detailing (acroterions, triglyphs, metopes)\n* Gilded gold\n* Vases\n* Lamps and fire bowls\n* Blue doors and shutters\n* Stairs for most listed nodes\n\nSee [the complete item list](https://github.com/GreenXenith/greek?tab=readme-ov-file#full-lists) for more details.\n\n## Dependencies\nAll listed dependencies are only defaults and are configurable unless noted otherwise.\n\n* `stairs`: May provide more up-to-date stair placement functionality. Not required for stairs.\n* `dye`: Used in numerous color recipes, mainly render and painted tiles (non-configurable).\n* `darkage`: Provides marble and chalk (used in polished marble and cement, respectively).\n* `building_blocks`: Provides marble for polished marble.\n* `technic_worldgen`: Provides marble for polished marble.\n* `default`: Provides silver sandstone (for cement), gold block (for gilded gold), clay (for red clay), and steel ingot (for locked doors). Also provides various `group:wood`s.\n* `basic_materials`: Provides padlock for locked doors.\n\n## Configuration\nAll craftitems are configurable via the `minetest.conf` using settings listed in [settingtypes.txt](https://github.com/GreenXenith/greek/blob/master/settingtypes.txt). Craftitem settings use a comma-deliminated list of itemstrings. Each item listed, if available, will be used as a valid item in crafting recipes using that item type. Some `greek` implementations are included by default, but may be disabled by removing the items from their lists.  \n\nConfigurable item types:\n\n* Marble: Used to craft polished marble. Polished marble is in turn used to craft all other marble-related items.   \n  NOTE: If [greeknodes compaitibility](#compatibility) is enabled, at least one registered item must be in this list.\n* Limestone: Used to craft cement for render.\n* Cement: Used to craft render.\n* Gold block: Used to craft gilded gold.\n* Clay: Used to craft red clay.\n* Blue wood: Used to craft doors and shutters.\n* Lock: Used to craft locked doors.\n\nOther settings:\n\n* Stairs in creative inventory\n* Dye consumption upon coloring\n* Maximum vase capacity\n* Snuff fire bowls on dig\n* Enable `greeknodes` aliases\n* Alias `greeknodes` marble to polished marble\n* Alias `greeknodes` tar to building_blocks equivalents\n\nSee [settingtypes.txt](https://github.com/GreenXenith/greek/blob/master/settingtypes.txt) for defaults.  \n\n## Compatibility\nThis mod is the successor to my old `greeknodes` mod. Aliases are registered by default to convert old `greeknodes` items to `greek` items. For this to be successful, at least one valid marble item must be configured, or aliasing to polished marble must be enabled. Compatibility can be [disabled](#configuration) entirely, of course.\n\n## Implementations\n### Coloring\nSome nodes (render, painted tiles) have 8 available colors variants. They can be obtained by combining them with a dye (dye is consumed by default) or punching a colorable node with a dye.\n\n### Stairs\nI need to be able to use dye punch-coloring on certain stairs (painted tile, render). Default stairs has two issues:\n\n* Takes explicit definition values instead of a whole definition\n* Doesn't return what items were actually registered\n\nAs such, I've rolled my own implementation near-identical to that of default stairs, but a bit more succinct and generic. I've used the rotation functions from default stairs, and it will poll for a more up-to-date function if default stairs is enabled.\n\n### Doors\nDepending on external mods for content would not be very dependency-agnostic, so I've opted to roll my own doors as simply as I could manage. My implementation is smaller and in some ways more naive than default doors, but it works as well as I'd like.\n\nDoors are implemented using only 2 (a, b) nodes per type rather than 8 (a, b, c, d, for unlocked and locked). An open A door is identical to a closed B door, and vise-versa, provided the front and back of the door texture is identical. Locked doors are implemented using param2 palette index (locked doors have a silver handle). They can only be obtained via crafting.\n\nDoors also support skeleton keys. As an extended key feature, you can bind already-bound keys to unbound doors.\n\n### Craftrings\nSome nodes have many near-identical variants (such as metopes). Rather than making a unique crafting recipe for each node, a \"craftring\" is registered to loop through all possible variants. Placing one version of the item in the crafting grid will output the next version. The last variant will return the first variant (to form the loop).\n\nAs crafting large amounts of certain variants can be tedious, variants can be copied. Placing 2 of a target variant in the crafting grid with another variant will output the target variant and keep the other 2 target variants.\n\n```\n+-+-+-+    +-+-+-+  +-+\n|A|A|B| -> |A|A| |  |A|\n+-+-+-+    +-+-+-+  +-+\n```\n\n## Todo\n* Configurable sounds\n* Translation support\n* Posable statues\n* ???",
  "maintainers": ["GreenXenith"],
  "media_license": "MIT",
  "name": "greek",
  "provides": ["greek"],
  "release": 22570,
  "repo": "https://github.com/GreenXenith/greek",
  "score": 170.4,
  "screenshots": [
    "https://content.luanti.org/uploads/QALLSEpgIB.png",
    "https://content.luanti.org/uploads/kS9LqK2lDf.png",
    "https://content.luanti.org/uploads/moPdWoQWZF.png",
    "https://content.luanti.org/uploads/8qyZ4HtcIt.png"
  ],
  "short_description": "A large assortment of Greek architecture blocks and materials.",
  "state": "APPROVED",
  "tags": ["building", "decorative"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/QALLSEpgIB.png",
  "title": "Greek",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/GreenXenith/greek/releases/22570/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": { "GreenXenith/greek": [] },
  "hash": "08kj2wqcdzlj6sjiw8bqkkj1rnkjb8p04lwpjn8m1p8dgvrykjld"
}
