{"author":"42tpac","content_warnings":[],"created_at":"2024-04-04T08:36:50.878797","dev_state":"BETA","donate_url":null,"downloads":421,"forum_url":null,"forums":null,"game_support":[{"confidence":11,"game":{"author":"Minetest","name":"minetest_game","release":29742,"short_description":"The classic \"Minetest\". A lightweight and well-maintained base for modding","thumbnail":"https://content.luanti.org/thumbnails/1/8ffd1409ff.png","title":"Minetest Game","type":"game"},"supports":true}],"issue_tracker":null,"license":"LGPL-2.1-or-later","long_description":"**Sane Tools**\n\nIntroducing three new tools to remove the insanity of digging one node at a time. Spending that much time digging just doesn't seem reasonable to me. I can't fathom how some professional voxel game players spend so much time on such a tedious task - the time investment is tremendous, and the end result is the same. I find no diminished sense of accomplishment when using these tools.\n\nThat's why I've named this mod \"Sane Tools.\" It aims to enhance the survival mode experience, as I primarily play in survival mode and I'm unaware of its usefulness in other game modes. (I did try to come up with a \"nicer\" name but my imagination failed me)\n\nThis mod adds tools that I've found useful in the survival mode of a similar game and a third new one:\n\n* The 3x3 hammer\n* The builder wand, which adds a new layer of the same nodes to the pointed node\n\nAnd I've also introduced a new idea (at least for me) for a third tool:\n\n* The scraper, which removes one layer of nodes to the pointed node.\n\nHammer and Builder Wand video:\n[(https://youtu.be/Mm1PR00Czok)]\n\nScraper video:\n[(https://youtu.be/fLtMCQWlduk)]\n\n**State of Development:**\n\nThese tools work as I envisioned them, and I don't think I'll have enough motivation to change them, except maybe for the repair mechanism.\n\n**Tools Durability:**\n\n* Regardless of durability, the tools will not be destroyed and can be repaired at any time.\n\n**Limitations:**\n\nDo not use this mod if you are also using a stamina mod. Since multiple nodes are removed, your health will often be insufficient.\nNo undo function is implemented. While one might think an undo function would be required with the ability to add or remove multiple nodes, the scraper and builder wand have almost opposite functions, so I don't see an undo being implemented.\n\n**Mod Compatibility:**\n\nTested with the TechAge mod, but stamina was removed (see limitations if you use stamina mods).\nCan still be used alongside the HammerMod.\nWorks perfectly with the Anvil repair tools mod, though it's not necessary.\n\n**Bugs:**\n\n**New Bugs Found:**\n\n* Some nodes perform certain processing after being placed—for example, the Techage Electrical Cable.\nThis processing does not occur when the node is placed using the Build Wand.\nIn this case the Electrical Cable will not connect to it's neighbor.\n(I will try to fix this—any help is welcome)\n* When placing seeds with the Build Wand the seeds will not be connected to the Farm Dirt and the seeds will not gernimate. (I will try to fix this—any help is welcome)\n\n** less severe **\n\n* Occasionally, the hammer fails to correctly identify the orientation of the pointed face, mainly when doing multiple diggings without interval.\n* Occasionally, the scraper fails to remove the entire layer and removes just one node. Just point to the adjacent node, and everything should work fine.\nThese bugs cannot be reproduced at will. If you can identify what's wrong, I'll definitely take a look at it.\n\n**Future Changes (not likely):**\n\nThe current repair mechanism only requires one stick, which is too cheap. I hope to find a better repair method.\nI hope to have the energy to create a YouTube video demonstrating these tools. For now, there's a video for the hammer and builder, and another for the scraper.\n\n* Well, I would like to look in to allow for translations...\n\n**Thanks:**\nThis is my first mod for Minetest and my first Lua code. I used the HammerMod mod to learn Lua and Minetest modding. Some code from the HammerMod may still be present, but I believe it's minimal.","maintainers":["42tpac"],"media_license":"LGPL-2.1-or-later","name":"sane_tools","provides":["sane_builderwand","sane_hammer","sane_scraper","sane_shared"],"release":29665,"repo":null,"score":177.1,"screenshots":["https://content.luanti.org/uploads/bc9883ea6e.png","https://content.luanti.org/uploads/a00fb0f977.png","https://content.luanti.org/uploads/ac02e305f3.png","https://content.luanti.org/uploads/eb34970815.png"],"short_description":"Adds a 3x3 hammer, a one layer wand builder and a one layer scraper","state":"APPROVED","tags":["building_mechanics","tools"],"thumbnail":"https://content.luanti.org/thumbnails/1/bc9883ea6e.png","title":"Sane Tools","translation_url":null,"type":"mod","url":"https://content.luanti.org/packages/42tpac/sane_tools/releases/29665/download/","video_thumbnail_url":"https://content.luanti.org/thumbnails/youtube/Mm1PR00Czok.jpg","video_url":"https://www.youtube.com/watch?v=Mm1PR00Czok","website":null,"dependencies":{"42tpac/sane_tools":[]},"hash":"0kfv2amvgcyvk5y0q02i7mbjbfsnh1jv5m3s39k7mmb3dhlpb4bp"}