{
  "author": "Warr1024",
  "content_warnings": [],
  "created_at": "2020-07-03T01:35:40.702479",
  "dev_state": "MAINTENANCE_ONLY",
  "donate_url": "https://liberapay.com/Warr1024",
  "downloads": 1299,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": null,
  "license": "MIT",
  "long_description": "## Puzzle/Adventure Map System using Node Protection Mechanic\n\n*Compatible/tested with NodeCore, but probably/maybe works with a lot of other Minetest games*\n\nThis mod aids in the creation of maps for adventure, puzzle, escape room, etc play modes.  Most nodes are protected from being changed, but the map author can exempt specific nodes/locations that the player is supposed to interact with to solve the puzzle.\n\n### How To Use:\n\n- Grant yourself `protection_bypass` to allow full access to map.  Grant any other privs necessary to access the tools you need to build.\n\n- Build the puzzle map.\n\n- Grant yourself the `puzzlemap` priv to gain access to the puzzlemap tools.\n\n- Make room in your inventory, then use the `/puzzlemaptools` command to summon the set of tools for managing puzzle map acess.\n  \n- Punch a node with the \"by Position\" tool to allow access to just that specific location.  Players will be able to dig/place anything at that location.\n\n- Punch a node with the \"by Node Type\" tool to allow access to all nodes of a specific type.  Players will be able to dig/place that type of node anywhere.\n\n- Punch a node with the \"by Exact node\" tool to allow access only to a specific node at that specific location.  Players will only be allowed to interact with that exact node at that location; if it is removed/changed they will not be allowed anymore (until/unless the map resets it).\n\n- Sneak+punch with any of these tools will apply the rule to the space above the surface you're punching, including air/liquids.\n\n- Punch things again to toggle access back off. Check the totals to make sure they match expectations.\n\n- You will be able to see markings surrounding nodes for which access has been granted.  Note that for some, particularly the \"exact\" type, you will only see the markings if the node is *currently* accessible based on the rule, e.g. there may be \"exact\" match types that are not currently visible because the node currently in that position does not match.\n  \n- If you screw up and want to start over again, `/puzzlemapreset`.  Note that this will remove *all* access and require you to re-permit everything from scratch, and there is no confirmation on reset.\n\n- Make use of fly, noclip, etc. to bypass your mechanisms so you can leave them in a ready-to-play state.\n\n- When finished, drop the tools (they will dematerialize automatically) and `/revoke` yourself the protection_bypass, fly, noclip, etc. privs.\n\n- Make a backup copy of the map, so you don't have to reset all mechanisms manually.\n\n- Play-test the map as an ordinary player.  Remember to check to make sure each thing you should be able to access works, *and* spot-check to ensure things you're not supposed to be able to access block you.\n",
  "maintainers": ["Warr1024"],
  "media_license": "MIT",
  "name": "puzzlemap",
  "provides": ["puzzlemap"],
  "release": 26832,
  "repo": "https://gitlab.com/sztest/puzzlemap",
  "score": 4.4,
  "screenshots": ["https://content.luanti.org/uploads/5371c6bb8b.webp"],
  "short_description": "Puzzle/Adventure Map System using Node Protection Mechanic",
  "state": "APPROVED",
  "tags": ["creative", "puzzle"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/5371c6bb8b.png",
  "title": "PuzzleMap",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/Warr1024/puzzlemap/releases/26832/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "Warr1024/puzzlemap": []
  },
  "hash": "0akzgb6b28a91b5syrni9j1130dhh9p3fk8zqxf1x1h839nb3g9p"
}
