{"author":"FaceDeer","content_warnings":[],"created_at":"2018-05-27T07:01:06.005341","dev_state":null,"donate_url":null,"downloads":1674,"forum_url":"https://forum.luanti.org/viewtopic.php?t=16511","forums":16511,"game_support":[],"issue_tracker":"https://github.com/minetest-mods/breadcrumbs/issues/","license":"MIT","long_description":"This mod adds a specialized type of sign block that's intended to be used while exploring caves and other twisty mazes to make navigation easier.\n\nPath markers are initially crafted in a \"blank\" state. Equip the stack of markers and click on anything with them to bring up a form where you can enter a short text label for this stack of markers. This initializes the stack of markers with that label. They can then be placed on surfaces like normal signs, but the text of the sign is predefined. It will read:\n\n    <label> #1\n    placed by <player name>\n\nEach subsequent sign placed from this stack will increment the number count, and will also add a line of text indicating how many meters away the previous sign in the stack was placed. If you right-click on the sign a stream of particles will be displayed that travel in the direction the previous sign lies in. This should allow much easier \"backtracking\" along the path of signs. Good practice is to choose a label that describes the starting point of your expedition, since the trail of signs you leave behind will send travelers in the direction of that origin.","maintainers":["FaceDeer"],"media_license":"MIT","name":"breadcrumbs","provides":["breadcrumbs"],"release":16424,"repo":"https://github.com/minetest-mods/breadcrumbs","score":2.2,"screenshots":["https://content.luanti.org/uploads/eLwsT8xZeJ.png"],"short_description":"Path marker signs for use when exploring a twisty maze of passages that are all alike.","state":"APPROVED","tags":["survival","transport"],"thumbnail":"https://content.luanti.org/thumbnails/1/eLwsT8xZeJ.png","title":"Breadcrumbs","translation_url":null,"type":"mod","url":"https://content.luanti.org/packages/FaceDeer/breadcrumbs/releases/16424/download/","video_thumbnail_url":null,"video_url":null,"website":null,"dependencies":{"FaceDeer/breadcrumbs":[]},"hash":"078x1vcz6bmpc9pbaq9yfn2qgx0rnk9cfg7rcy0gwd52s8fy1l3k"}