{"author":"Marnack","content_warnings":[],"created_at":"2023-02-01T08:30:28.880477","dev_state":"ACTIVELY_DEVELOPED","donate_url":null,"downloads":3002,"forum_url":null,"forums":null,"game_support":[{"confidence":11,"game":{"author":"Minetest","name":"minetest_game","release":29742,"short_description":"The classic \"Minetest\". A lightweight and well-maintained base for modding","thumbnail":"https://content.luanti.org/thumbnails/1/8ffd1409ff.png","title":"Minetest Game","type":"game"},"supports":true},{"confidence":11,"game":{"author":"wsor4035","name":"farlands_reloaded","release":29611,"short_description":"lightweight game to explore and create","thumbnail":"https://content.luanti.org/thumbnails/1/fc00acef4f.png","title":"Farlands Reloaded","type":"game"},"supports":true},{"confidence":11,"game":{"author":"Wuzzy","name":"hades_revisited","release":23418,"short_description":"Work in Progress. You have stranded on the planet Hades. Use your limited supplies to survive and use terraforming to create a beautiful habitable place. (EARLY TEST VERSION)","thumbnail":"https://content.luanti.org/thumbnails/1/9781fc4ca1.png","title":"Hades Revisited","type":"game"},"supports":true},{"confidence":11,"game":{"author":"ryvnf","name":"mineclonia","release":29735,"short_description":"Survival sandbox game inspired by Minecraft.","thumbnail":"https://content.luanti.org/thumbnails/1/864a6133e4.png","title":"Mineclonia","type":"game"},"supports":true},{"confidence":11,"game":{"author":"Wuzzy","name":"mineclone2","release":29214,"short_description":"Survive, farm, build, explore, play with friends, and do much more. Inspired by Minecraft, pushing beyond.","thumbnail":"https://content.luanti.org/thumbnails/1/55ab4fc1b5.png","title":"VoxeLibre (formerly MineClone2)","type":"game"},"supports":true}],"issue_tracker":"https://github.com/Marnack/classic_coaches/issues","license":"AGPL-3.0-only","long_description":"This mod is an extension for [Advanced Trains](https://content.minetest.net/packages/orwell/advtrains/) that adds a set of four intercity style passenger wagons, all of which have liveries that can be customized in-game by their owning players.\n\n## Wagons\n\nAll of the wagons in this mod are loosely based on passenger coaches used for European inter city railway service during the late 20th and early 21st centuries.\n\n### Corridor Coach Class 1\n\nThis wagon features modern compartment style seating with corridor access to adjoining wagons.  Each compartment contains six extra wide first class airline style seats with a folding center table and stylish overhead shelving.\n\nThe wagon is modeled with 24 seats.  Up to 4 players can board each wagon.\n\n### Corridor Coach Class 2\n\nThis wagon also features modern compartment style seating with corridor access to adjoining wagons.  Each compartment contains six standard second class airline style seats with a folding center table, two small side tables and standard overhead shelving. \n\nThe wagon is modeled with 24 seats.  Up to 4 players can board each wagon.\n\n### Open Coach Class 1\n\nThis wagon features modern open plan style seating with vestibule access to adjoining wagons.  Each row contains three extra wide first class airline style seats.  Stylish overhead shelving is located along both sides of the wagon.\n\nThe wagon is modeled with 18 seats.  Up to 3 players can board each wagon.\n\n### Open Coach Class 2\n\nThis wagon also features modern open plan style seating with vestibule access to adjoining wagons.  Each row contains four standard second class airline style seats.  Standard overhead shelving is located along both sides of the wagon.\n\nThe wagon is modeled with 32 seats.  Up to 5 players can board each wagon.\n\n## Livery Customization\n\nLike some other mods for **Advanced Trains**, this mod supports using the bike painter tool from the [bike mod](https://content.minetest.net/packages/Hume2/bike/) to allow players to paint a portion of their wagon a custom color.  In addition to supporting that tool, however, this mod also introduces support for the livery designer tool included in the [AdvTrains Livery Tools modpack](https://content.minetest.net/packages/Marnack/advtrains_livery_tools/) that allows players to customize the appearance of their wagons.  By using the livery designer tool, players will be have access to more customization options.\n\nBoth the bike painter and the livery designer tools are optional and can be used interchangeably on wagons from this mod.\n\n### Bike Painter Tool\n\nIn addition to using the bike painter to change a color, this mod also allows players to use the bike painter tool to alter the appearance of their wagons  by selecting a different livery template.  These templates each have a different texture and a different area of the wagon that is affected when colorized by the painter.\n\nIn order to support the selection of livery templates, this mod handles the bike painter tool slightly differently than other mods.  Specifically, the bike painter can be used to select which livery template is applied to a wagon as well as colorize one aspect of the livery.  This is accomplished by using the bike painter tool's \"alpha\" value to select a livery template instead of a transparency level.  Valid alpha values can range from 0 to n where n is one less than the number of livery templates that have been defined for the wagon.  Values greater than n cause the bike painter to have no effect.  Currently, this mod defines 7 livery templates for each of its 4 wagons.\n\nThe bike painter tool's RGB value otherwise works as usual to define a custom color but that color is only applied to the livery template's first overlay, if defined.  Also, an RGB value of #000000 has a special meaning in that instead of setting the color to black, it resets the color to its default value.  (Consider using color \"#010000\", \"#010101\" or something similar for black if needed.) This \"#000000\" RBG value only applies to the bike painter and does not have a special meaning when using the livery designer tool. \n\nIf a livery template has no overlays defined, then the RGB value has no effect but the alpha value is still used to select the template.  (Currently, all livery templates defined in this mod have multiple overlays.)\n\n#### Examples:\n\nBike Painter Value|Result\n---|---\n#000000**00**|Applies livery template #00 with its default colors (this is the wagon's initial appearance)\n#000000**01**|Applies livery template #01 with its default colors\n#FF0000**02**|Applies livery template #02 with a red color applied to the first overlay of the livery template\n#00FF00**03**|Applies livery template #03 with a green color applied to the first overlay of the livery template \n#00092B**07**|No effect due to livery template #07 not being defined.\n\nNote that the bike painter tool first clears any livery customization that may have previously been applied to the wagon.\n\n### Livery Designer Tool\n\nThe livery designer tool has a graphical user interface that allows easier access to livery template selection and supports independent colorization of multiple overlays of the livery.  It also allows players to preview and select predefined liveries.  See the livery designer tool's documentation included in the **AdvTrains Livery Tools** modpack for more information.\n\n## Game Support\nAs with **AdvTrains**, the Classic Coaches mod is compatible with many games when playing in creative mode and fully supports survival mode in [Minetest Game](https://content.minetest.net/packages/Minetest/minetest_game/) and its many variants.  However, Classic Coaches also supports survival mode in games that are not based on **Minetest Game** including the following:\n\n- [Farlands Reloaded](https://content.minetest.net/packages/wsor4035/farlands_reloaded/)\n- [Hades Revisited](https://content.minetest.net/packages/Wuzzy/hades_revisited/)\n- [Minecloneia](https://content.minetest.net/packages/ryvnf/mineclonia/)\n- [VoxeLibre](https://content.minetest.net/packages/Wuzzy/mineclone2/) (formerly known as MineClone2)\n\nNote that support for survival mode in those games is subject to potential breakage in the future if those games change their materials or crafting system.\n\n## Recent Changes\n### [1.0.0] - 2024-05-24\n- Remove dependencies on mods from Minetest Game\n- Add support for survival mode in additional games\n\n### [0.9.1] - 2023-10-18\n - Use current Minetest internationalization system\n - Minor code cleanup\n\n### [0.9.0] - 2023-01-28\n - Initial Beta release\n\n## Author's Notes\n\n1) These wagon models are the same ones that I created in 2022 with the intention of adding them to the [Moretrains](https://content.minetest.net/packages/gpcf/moretrains/) mod pack.  However, with multiple variations of the Moretrains modpack currently in use, I have decided to release these wagons separately in this mod for easier distribution and to use them for showcasing new livery customization functionality.  Both the liveries and the crafting recipes in this mod are different from the those that I created for Moretrains so they won't conflict with one another if used in the same game.\n\n## Licenses\n\nCopyright © 2022-2023 Marnack\n\n- Classic Coaches code is licensed under the GNU AGPL version 3 license, see the included LICENSE.txt for details.\n- Unless otherwise specified, Classic Coaches media (models, textures, images  and sounds) are licensed under [CC BY-SA 3.0 Unported](https://creativecommons.org/licenses/by-sa/3.0/).\n\n### Attributions\n\nThe following items from prior art were included in whole or in part in this mod:\n\n- From the mod for Minetest named \"moretrains_basic\" in the \"minetest-moretrains\" modpack:\n\t- Models and textures for the bogie, wheels and buffers (CC BY-SA 3.0 by rbduck)\n\n- From the mod for Minetest named \"advtrains_train_jre231\" in the \"JR_E231series_modpack\" modpack:\n\t- Portions of the code to support livery customization via the bike painter tool (LGPL 2.1 by Mainote plants lab).\n","maintainers":["Marnack"],"media_license":"CC-BY-SA-4.0","name":"classic_coaches","provides":["classic_coaches"],"release":25198,"repo":"https://github.com/Marnack/classic_coaches","score":189.4,"screenshots":["https://content.luanti.org/uploads/0117e91a4c.png","https://content.luanti.org/uploads/ebc0063553.png","https://content.luanti.org/uploads/83953d4a90.png","https://content.luanti.org/uploads/0aa95ec6ae.png","https://content.luanti.org/uploads/3a32f1a2da.png","https://content.luanti.org/uploads/e5b75c5d27.png"],"short_description":"Passenger coaches with customizable liveries for use with the advtrains mod.","state":"APPROVED","tags":["simulation","transport"],"thumbnail":"https://content.luanti.org/thumbnails/1/0117e91a4c.png","title":"Classic Coaches","translation_url":null,"type":"mod","url":"https://content.luanti.org/packages/Marnack/classic_coaches/releases/25198/download/","video_thumbnail_url":null,"video_url":null,"website":null,"dependencies":{"Marnack/classic_coaches":[{"is_optional":false,"name":"advtrains","packages":["orwell/advtrains"]}],"orwell/advtrains":[]},"hash":"14rcw2rmjrdm1dpmlhlx9kq2h7g3z7b2yva6l58nlfi77fvvp2wi"}