{
  "author": "Warr1024",
  "content_warnings": [],
  "created_at": "2019-08-28T20:54:07.009333",
  "dev_state": "ACTIVELY_DEVELOPED",
  "donate_url": "https://liberapay.com/Warr1024",
  "downloads": 2451,
  "forum_url": null,
  "forums": null,
  "game_support": [
    {
      "confidence": 1,
      "game": {
        "author": "Warr1024",
        "name": "nodecore_alpha",
        "release": 29712,
        "short_description": "Early-access edition of NodeCore with latest features (and maybe bugs)",
        "thumbnail": "https://content.luanti.org/thumbnails/1/db1a942e1a.png",
        "title": "NodeCore ALPHA",
        "type": "game"
      },
      "supports": true
    },
    {
      "confidence": 1,
      "game": {
        "author": "Warr1024",
        "name": "nodecore",
        "release": 29711,
        "short_description": "Discover and invent in a surreal, unsympathetic world of cubes, patterns, and abstractions.",
        "thumbnail": "https://content.luanti.org/thumbnails/1/8078c595ae.png",
        "title": "NodeCore",
        "type": "game"
      },
      "supports": true
    }
  ],
  "issue_tracker": "https://discord.gg/NNYeF6f",
  "license": "MIT",
  "long_description": "This mod was created primarily for the use-case of the official unofficial NodeCore multiplayer server.  Due to ongoing development on map generation and ore distribution, we sometimes reset the world.  However, players don't always want to start from scratch every time.  This mod provides a not-totally-gameplay-breaking method for players to preserve some of their property across resets.\n\n**For Players:**\n\n* One platform exists for each player, and players can only summon their own platform.\n* A platform can only exist in one place in the world at a time, and cannot be re-summoned once already placed.\n* A platform can only be moved by summoning or banishing, and cannot be dug. †\n* Anything inside the platform, other than the core and frame itself, can be modified.  This includes the cobble floor sections it ships with.\n* Every few seconds, the platform's core emits a puff of particles to indicate its contents synced off-world successfully.\n* Everything in node-space is saved, including placed nodes, shelves/containers and their contents, all settled item stacks, node inventories and metadata.  Moving entities, players, and player inventories are not stored.\n* After a world reset, summoning the platform in the new world will restore its saved contents from the previous world.\n* The recipe for summoning the platform is a square cobble platform of the same configured width as the dais (default 9), with a hole in the middle filled by an Eggcorn sprout, and one Eggcorn on each of the 4 platform corners.  Pummel the sprout with another Eggcorn.\n* Everything else in the space where the platform is to be summoned must be air (anything else, including water, must be excavated).\n* Fire may not spread into or within a dais (by default).\n* Access restrictions on the platform's contents are configurable.  By default, solid lode cubes, lode crates and their contents, and totes and packed contents are protected, and only the platform's owner can access them.\n*  It is possible for players to place things into someone else's dais (via dropping/throwing) that they then can't pick back up.  This is a known issue and not preventable.\n* A platform can be banished by the player who owns it by pummeling the core with an eggcorn, but only if it's returned to *exact* \"original\" condition (empty except for the cobble floor).\n\nThe default platform size (configurable) is **9x9 at the base, 5 high**.\n\n**For Server Operators:**\n\n* When resetting the map, remove `map.sqlite`, `players.sqlite`, and `mod_storage` (or corresponding artifacts for your back-end).\n* Make sure the `nc_exmachina` dir is *preserved*.\n* Keep `env_meta.txt`, and add a large number of seconds (eg 32 million for each year the map existed) to gametime as a safety margin.  This ensures things inside the dais do not experience reverse time flow. \n* If you want a new map seed, you can remove or reset `map_meta.txt`, otherwise you will get a fresh copy of the same terrain.\n* The platform size is configurable, but platforms can only be safely restored in worlds where the size configuration matches.\n* If you are using any tool, such as worldedit, to preserve sections of the map:\n  * The best option is to ensure no dais exists within any preserved area. Use `/exmachina_banish` to banish them.\n  * If you preseve any dais in-world, you will need to manually edit the `mod_storage/nc_exmachina` file and ensure its core position is registered in the new world, but all daises not transferred are removed.\n\n*†  Moving or otherwise modifying the platform via worldedit or similar mods may be possible, but voids its warranty.*\n",
  "maintainers": [
    "Warr1024"
  ],
  "media_license": "MIT",
  "name": "nc_exmachina",
  "provides": [
    "nc_exmachina"
  ],
  "release": 26224,
  "repo": "https://gitlab.com/sztest/nc_exmachina",
  "score": 2.9,
  "screenshots": [
    "https://content.luanti.org/uploads/7196dd61a0.webp"
  ],
  "short_description": "An other-worldly platform to preserve some of your stuff across map resets for NodeCore",
  "state": "APPROVED",
  "tags": [
    "building",
    "inventory",
    "technology",
    "transport",
    "world_tools"
  ],
  "thumbnail": "https://content.luanti.org/thumbnails/1/7196dd61a0.png",
  "title": "Dais Ex Machina",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/Warr1024/nc_exmachina/releases/26224/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "Warr1024/nc_exmachina": [
      {
        "is_optional": false,
        "name": "nc_tree",
        "packages": [
          "Warr1024/nodecore",
          "Warr1024/nodecore_alpha"
        ]
      },
      {
        "is_optional": false,
        "name": "nc_items",
        "packages": [
          "Warr1024/nodecore",
          "Warr1024/nodecore_alpha"
        ]
      },
      {
        "is_optional": false,
        "name": "nc_api_all",
        "packages": [
          "Warr1024/nodecore",
          "Warr1024/nodecore_alpha"
        ]
      },
      {
        "is_optional": false,
        "name": "nc_terrain",
        "packages": [
          "Warr1024/nodecore",
          "Warr1024/nodecore_alpha"
        ]
      }
    ]
  },
  "hash": "0i1v3sgv11y0axsw6j5f0wir6j04dkp2v68v5pg35yfcwancy8sr"
}
