{
  "author": "ZenonSeth",
  "content_warnings": [],
  "created_at": "2022-11-25T11:36:03.853254",
  "dev_state": "BETA",
  "donate_url": null,
  "downloads": 1114,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=18546",
  "forums": 18546,
  "game_support": [],
  "issue_tracker": "https://github.com/ZenonSeth/treasure_chest/issues/new/choose/",
  "license": "MIT",
  "long_description": "Treasure Chest is a small mod for the Minetest game that adds a kind of chest made for world designers.\nThe chest has no crafting recipe, so it has to be obtained by /giveme or other commands.\n\nThe intended use and original idea, comes from trying to design challenges in a survival world,\nand having some way to automatically reward players who complete the challenges.\n\nThe rewards can be somewhat randomized, with a probability for each one, and can reset after\na specified time, on a per user basis, after being given out.\n\nWhen the chest is used by someone without the `give` privilege, the chest will attempt to give\na copy of the items inside it (with some chance) to the user. The chest then records the last time\nthis user has tried to get the items, and the user will then have to wait for a timeout period to\nexpire before he/she can have a chance of obtaining the items again. This timeout period is per-user.\n\nFor someone with the `give` privilege, the chest will display a GUI that allows you to configure it.\n\n- 1st input: Refresh Time: An integer value\n  - The number of minutes of gametime that must pass before the chest can give its items out again.\n  - This is on a per-user basis, so two users can always obtain the reward if they use the chest, but if the same user tries to use it before the refresh timeout, he will get nothing.\n  - Passing -1 (negative one) as the refresh time makes the chest a one-time use per player. \n\n- 2nd line: Six input: Integer values\n  - Probabilities, ranging 0..100, of how likely a reward is to be given to a user. Randomly determined each time the chest is used. Associated with the inventory slot below each one\n\n- 3rd line: Six inventory slots\n  - The items to be given out, as associated by the probabilities above them. Each slot can hold a regular item stack. Items stacks are given out as a whole, so the user will get either the whole item stack, or nothing from that slot. Item stacks in these slots are not taken by regular users using the chest, instead they get copied.\n",
  "maintainers": [
    "ZenonSeth"
  ],
  "media_license": "MIT",
  "name": "treasure_chest",
  "provides": [
    "treasure_chest"
  ],
  "release": 27544,
  "repo": "https://github.com/ZenonSeth/treasure_chest",
  "score": 164.6,
  "screenshots": [
    "https://content.luanti.org/uploads/1da216a745.png",
    "https://content.luanti.org/uploads/b2d2afef22.png"
  ],
  "short_description": "Adds a block called Treasure Chest that hands semi-randomized rewards on a timer.",
  "state": "APPROVED",
  "tags": [
    "adventure__rpg"
  ],
  "thumbnail": "https://content.luanti.org/thumbnails/1/1da216a745.png",
  "title": "Treasure chest",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/ZenonSeth/treasure_chest/releases/27544/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "ZenonSeth/treasure_chest": []
  },
  "hash": "044xg1bmyh68qpsni7v77hqvzav4ymfdmgh1q32f7hw4dw20y2w6"
}
