{"author":"Marnack","content_warnings":[],"created_at":"2023-02-01T08:44:21.076154","dev_state":"BETA","donate_url":null,"downloads":4974,"forum_url":null,"forums":null,"game_support":[],"issue_tracker":"https://github.com/Marnack/advtrains_livery_tools/issues","license":"AGPL-3.0-only","long_description":"Currently in Beta release, AdvTrains Livery Tools is an extension for [Advanced Trains](https://content.minetest.net/packages/orwell/advtrains/) that adds APIs for mod developers to support more livery options for their wagons and locomotives.  It also adds a livery designer tool that can be used by players in-game to view and customize the liveries of their wagons and locomotives from participating mods. The following are examples of participating mods:\n\n* [Advtrains Japanese Tram TLR0600](https://content.minetest.net/packages/advtrains_supplemental/advtrains_train_jpntlr600/)\n* [Classic Coaches](https://content.minetest.net/packages/Marnack/classic_coaches/)\n* [DlxTrains](https://content.minetest.net/packages/Marnack/dlxtrains/) \n* [Sim Trains](https://content.minetest.net/packages/Nazalassa/sim_trains/)\n* [Subways](https://content.minetest.net/packages/sylvester_kruin/subways/)\n* [TfL S7 Stock Modpack](https://content.minetest.net/packages/advtrains_supplemental/tfl_s7_stock_modpack/)\n\n## Included mods\n\nPlease see the README file in each of the included mod folders for detailed information.\n\n- **AdvTrains Livery Database** - This mod provides an API for AdvTrains mods to register their wagons and associated livery information with a non-persistent in-game database for sharing with other mods.  Other mods can then use this data to preview, manipulate or apply livery designs to registered wagons.\n- **AdvTrains Livery Designer** - This mod provides an in-game tool that enables players to view and modify the livery of their wagons.  *The wagons must be from participating mods that register their wagons with the AdvTrains Livery Designer and that have livery information added to the AdvTrains Livery Database.*\n\n## Design Goals\n\nThis modpack is the key component of a livery customization system for Advanced Trains designed to benefit both players and mod developers.  The design goals for the livery customization system included the following:\n\n* Provide an Advanced Trains specific alternative for the commonly used bike painter tool that offers more in-game wagon livery customization options for wagon owners.  The new designer tool should be able to work interchangeably with the bike painter tool in that the new tool should be able to customize wagons previously painted with the bike painter tool and the bike painter tool should be able to paint wagons previously updated with the new designer tool.\n* Develop a livery sharing mechanism that allows mods to share and extend livery customization information.\n* Support some of the livery customization features found in some existing wagon mods by providing for optional callback functions that can be used by those mods can handle their particular implementations.\n* Implement support for a \"livery pack\" concept in which mod developers can create mods that extend the livery customization options for wagons that are defined in other mods that participate in this livery customization system.\n* Support mods that add tools and nodes that can interact with a wagon's livery and appearance.\n* Allow for easy extension of livery customization options.  In other words, it should be relatively easy to extend the number and type of customization options that can be included in a livery template.  It is not assumed, however, that updating the livery designer tool to accommodate such additions will necessarily also be as easy.\n\nNote that fully achieving and maintaining all of these goals could require some trade-offs that might limit some of the customization options that can be supported.   Those will need to be evaluated as they arise to find the right balance between ease-of-use and capability.\n\n## Definition of key terms\n\n**Appearance** - The overall appearance of a wagon or locomotive can include several factors, including it livery, its loads (if it's a freight wagon), its apparent age, service information (display boards, line number, etc.), its unit number, etc.\n\n**Livery** - The paint/color scheme of a wagon or locomotive, including logos and other decorative markings.  A livery typically represents the brand or identity of the railway organization that owns the vehicle.  A vehicle's livery is not the only factor that can affect a wagon's appearance.\n\n**Loads** - Freight wagons can have items in their inventory that affect their appearance.  These items are sometimes referred to as loads in this context.  Wagons that have loads can require alternate models and/or textures to be used in constructing their appearance.\n\n**Texture** - An image file that is used in constructing the appearance of a wagon or locomotive.  More than once texture can be used to construct that appearance.\n\n## Game Support\n\nAs with **AdvTrains**, AdvTrains Livery Tools is compatible with many games when playing in creative mode and fully supports survival mode in [Minetest Game](https://content.minetest.net/packages/Minetest/minetest_game/) and its many variants.  However, AdvTrains Livery Tools also supports survival mode in games that are not based on **Minetest Game** including the following:\n\n- [Farlands Reloaded](https://content.minetest.net/packages/wsor4035/farlands_reloaded/)\n- [Hades Revisited](https://content.minetest.net/packages/Wuzzy/hades_revisited/)\n- [Minecloneia](https://content.minetest.net/packages/ryvnf/mineclonia/)\n- [VoxeLibre](https://content.minetest.net/packages/Wuzzy/mineclone2/) (formerly known as MineClone2)\n\nNote that support for survival mode in those games is subject to potential breakage in the future if those games change their materials or crafting system.\n\n## Recent Changes\n### [0.9.0] - 2025-01-18\n - Minor refactoring and updates for API\n - Optimize PNGs\n\n### [0.8.5] - 2024-05-25\n - Remove obsolete dependencies from modpack.conf\n\n### [0.8.4] - 2024-05-24\n - Remove dependencies on mods from Minetest Game\n - Add Support for survival mode in additional games\n\n### [0.8.3] - 2023-10-18\n - Use current Minetest internationalization system\n\n### [0.8.2] - 2023-10-13\n - Minor code cleanup\n - Fix database API function to return proper template values (Thanks to y5nw)\n\n### [0.8.1] - 2023-04-08\n - Add mod version utilities\n - Minor code cleanup\n - Add missing parameter needed for a callback function\n\n### [0.8.0] - 2023-02-01\n - Initial Beta release\n\n## Author's Notes\n\n1) The included **AdvTrains Livery Designer** is a *livery* designer, not an appearance designer.  Other factors that impact the appearance of a wagon or locomotive are handled separately by other tools, other nodes, or by special code in their respective mods.\n\n## Licenses\n\nCopyright © 2023-2025 Marnack\n\n- AdvTrains Livery Tools code is licensed under the GNU AGPL version 3 license, see the included LICENSE.txt for details.\n- Unless otherwise specified, AdvTrains Livery Tools (images, textures and sounds) are licensed under [CC BY-SA 3.0 Unported](https://creativecommons.org/licenses/by-sa/3.0/).\n","maintainers":["Marnack"],"media_license":"CC-BY-SA-3.0","name":"advtrains_livery_tools","provides":["advtrains_livery_database","advtrains_livery_designer"],"release":29393,"repo":"https://github.com/Marnack/advtrains_livery_tools","score":537.1,"screenshots":["https://content.luanti.org/uploads/4471712759.png","https://content.luanti.org/uploads/aa60a6abb2.png","https://content.luanti.org/uploads/d01c3ddac6.png","https://content.luanti.org/uploads/5e0d915e74.png","https://content.luanti.org/uploads/f3935f4289.png"],"short_description":"Livery tools for Advanced Trains mods.","state":"APPROVED","tags":["library","simulation","transport"],"thumbnail":"https://content.luanti.org/thumbnails/1/4471712759.png","title":"AdvTrains Livery Tools","translation_url":null,"type":"mod","url":"https://content.luanti.org/packages/Marnack/advtrains_livery_tools/releases/29393/download/","video_thumbnail_url":null,"video_url":null,"website":null,"dependencies":{"Marnack/advtrains_livery_tools":[{"is_optional":false,"name":"advtrains","packages":["orwell/advtrains"]}],"orwell/advtrains":[]},"hash":"01lnsw7dpzb7n6cipdwwviqdsbirjalv0d9sbxsqp92aqh5dgjm3"}