{
  "author": "Skivling",
  "content_warnings": [],
  "created_at": "2024-02-17T02:19:17.436459",
  "dev_state": "WIP",
  "donate_url": null,
  "downloads": 600,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=30459",
  "forums": 30459,
  "game_support": [
    {
      "confidence": 11,
      "game": {
        "aliases": ["Minetest/minetest_game"],
        "author": "Luanti",
        "name": "minetest_game",
        "release": 30625,
        "short_description": "The classic \"Minetest\". A lightweight and well-maintained base for modding",
        "thumbnail": "https://content.luanti.org/thumbnails/1/8ffd1409ff.png",
        "title": "Minetest Game",
        "type": "game"
      },
      "supports": true
    },
    {
      "confidence": 11,
      "game": {
        "author": "Wuzzy",
        "name": "repixture",
        "release": 28179,
        "short_description": "Simplistic sandbox survival game that plays in mostly lush biomes in a mostly peaceful world and only simple technologies.",
        "thumbnail": "https://content.luanti.org/thumbnails/1/9f2f5e75ae.png",
        "title": "Repixture",
        "type": "game"
      },
      "supports": true
    },
    {
      "confidence": 11,
      "game": {
        "author": "Wuzzy",
        "name": "mineclone2",
        "release": 30536,
        "short_description": "Survive, farm, build, explore, play with friends, and do much more. Inspired by Minecraft, pushing beyond.",
        "thumbnail": "https://content.luanti.org/thumbnails/1/55ab4fc1b5.png",
        "title": "VoxeLibre (formerly MineClone2)",
        "type": "game"
      },
      "supports": true
    },
    {
      "confidence": 11,
      "game": {
        "author": "Wuzzy",
        "name": "glitch",
        "release": 27010,
        "short_description": "You’re lost in cyberspace. Collect electrons, unlock new sectors and find your destination",
        "thumbnail": "https://content.luanti.org/thumbnails/1/f8309307c6.png",
        "title": "Glitch",
        "type": "game"
      },
      "supports": false
    },
    {
      "confidence": 11,
      "game": {
        "author": "Warr1024",
        "name": "nodecore",
        "release": 29711,
        "short_description": "Discover and invent in a surreal, unsympathetic world of cubes, patterns, and abstractions.",
        "thumbnail": "https://content.luanti.org/thumbnails/1/8078c595ae.png",
        "title": "NodeCore",
        "type": "game"
      },
      "supports": false
    },
    {
      "confidence": 11,
      "game": {
        "author": "MeseCraft",
        "name": "mesecraft",
        "release": 30046,
        "short_description": "Work in Progress. The best game for Minetest. A survival game with new depth, mechanics, biomes, mobs and many essential additions. Has a focus on being fun, user-friendly, stable, and minimalist but featured.",
        "thumbnail": "https://content.luanti.org/thumbnails/1/bd43210a7e.png",
        "title": "MeseCraft",
        "type": "game"
      },
      "supports": true
    },
    {
      "confidence": 11,
      "game": {
        "author": "EmptyStar",
        "name": "asuna",
        "release": 30050,
        "short_description": "A vibrant world of beautiful biomes. Explore, discover, create.",
        "thumbnail": "https://content.luanti.org/thumbnails/1/f334649d84.png",
        "title": "Asuna",
        "type": "game"
      },
      "supports": true
    },
    {
      "confidence": 11,
      "game": {
        "author": "_Irevol_",
        "name": "citadel",
        "release": 26596,
        "short_description": "A time-traveling puzzle game",
        "thumbnail": "https://content.luanti.org/thumbnails/1/79ce26c109.png",
        "title": "Citadel",
        "type": "game"
      },
      "supports": false
    },
    {
      "confidence": 11,
      "game": {
        "author": "Sumianvoice",
        "name": "backroomtest",
        "release": 26182,
        "short_description": "A game about exploring uncanny, vaguely unsettling, liminal spaces. The goal is to explore, be lost, wander. Can you find all the levels?",
        "thumbnail": "https://content.luanti.org/thumbnails/1/7f0ec19e49.png",
        "title": "Backrooms Test",
        "type": "game"
      },
      "supports": false
    },
    {
      "confidence": 11,
      "game": {
        "author": "Mantar",
        "name": "exile",
        "release": 30063,
        "short_description": "Challenging, at times brutal, wilderness survival with simple technology. ",
        "thumbnail": "https://content.luanti.org/thumbnails/1/0195f6298c.png",
        "title": "Exile",
        "type": "game"
      },
      "supports": false
    },
    {
      "confidence": 11,
      "game": {
        "author": "yaman",
        "name": "alter",
        "release": 23340,
        "short_description": "A challenging puzzle game in a dystopian future.",
        "thumbnail": "https://content.luanti.org/thumbnails/1/7550c290b5.png",
        "title": "Alter",
        "type": "game"
      },
      "supports": false
    },
    {
      "confidence": 11,
      "game": {
        "author": "Wuzzy",
        "name": "hades_revisited",
        "release": 30576,
        "short_description": "Work in Progress. You have stranded on the planet Hades. Use your limited supplies to survive and use terraforming to create a beautiful habitable place. (EARLY TEST VERSION)",
        "thumbnail": "https://content.luanti.org/thumbnails/1/40f8802c3d.png",
        "title": "Hades Revisited",
        "type": "game"
      },
      "supports": false
    },
    {
      "confidence": 11,
      "game": {
        "author": "Wuzzy",
        "name": "shadow_forest",
        "release": 27445,
        "short_description": "The forest has been overrun by the Shadows who’ve cursed it with eternal darkness. You’re the Wizard of Light; you’re the only hope to break the curse.",
        "thumbnail": "https://content.luanti.org/thumbnails/1/d70eb6f359.png",
        "title": "Shadow Forest",
        "type": "game"
      },
      "supports": false
    },
    {
      "confidence": 11,
      "game": {
        "author": "siegment",
        "name": "loria",
        "release": 16565,
        "short_description": "Work in Progress. Survival in hardcore acid-alien sci-fi themed world ",
        "thumbnail": "https://content.luanti.org/thumbnails/1/JRJSgu2BV4.png",
        "title": "Loria (alpha)",
        "type": "game"
      },
      "supports": false
    },
    {
      "confidence": 11,
      "game": {
        "author": "Casimir",
        "name": "voxelgarden",
        "release": 29860,
        "short_description": "A classic game for exploring, survival and building. Maintained by rudzik8",
        "thumbnail": "https://content.luanti.org/thumbnails/1/d936c3fce1.png",
        "title": "Voxelgarden",
        "type": "game"
      },
      "supports": false
    }
  ],
  "issue_tracker": "https://codeberg.org/Skivling/DrWho_Tardis/issues",
  "license": "GPL-3.0-or-later",
  "long_description": "[![Minetest](https://img.shields.io/badge/Minetest-5.0+-blue.svg)](https://www.minetest.net) [![License](https://img.shields.io/badge/License-GPLv3%20and%20CC%20BY--SA%204.0-green.svg)](LICENSE.md) [![Join the community](https://img.shields.io/badge/mtrx.nz-join_community-teal?style=flat-square&logo=matrix)](https://matrix.to/#/#drwho_tardis:mtrx.nz) [![ContentDB](https://content.minetest.net/packages/Skivling/drwho_tardis/shields/downloads/)](https://content.minetest.net/packages/Skivling/drwho_tardis/)\n\n# DrWho_Tardis\n\nA [Minetest](https://minetest.net) mod that adds various items, nodes, Daleks, and a working TARDIS from the sci-fi show Doctor Who. Forked from PiDemon's `tardis_new`, which is unmaintained.\n\nFor a more detailed explanation of everything included, see the [**wiki**](https://codeberg.org/Skivling/DrWho_Tardis/wiki). Download from the in-game content manager, here on ContentDB, or on Codeberg.\n\n## Features:\n\n- **TARDISes**: Simply craft a tardis, place it on the ground, and walk through the door.  You'll have to craft seperate console units to control and fly your tardis.\n- Console Units: Console units control your tardis. Place them in your tardis, and right click on them to use them.  Most consle units should be pretty self-explainatory if you understand X/Y/Z coordinates.\n- **Daleks**: The enemy of the TIme Lords, now in Minetest! Brown variants can fly, and Gray ones can't. They have high health, shield, deal a lot of damage and can also set things on fire and blow things up. Turn off 'Mob Griefing' in Mobs Redo API settings to disable that.\n- **Cybermen**: You will also be able to find Cybermen, who are weaker than Daleks but will still try to kill you. They drop steel ingots.\n- Time Rotor: Used to power the tardis. It will slowly generate power that is used for all tardis operations. Having multiple time rotors in your tardis will not generate power -faster. Right click on it to see how much power your Tardis has.\n- Monitor: Displays your current position, destination, power, ect. RIght click to view.\n- **Sonic Screwdriver**: Can be created from a button on the fuctions console unit. You get a randomized texture, out of 4 textures for each third of the screwdriver,  creating the possibility for 64 (4^3) unique combinations.\n- Gallifreyan Lab: Used to create arton crytals (from mese) and compressed space time (from diamond blocks). It does not require fuel, but is notably bad for your health!\n- Vortex Manipulator: Easy time travel (also notably bad for your health)\n- **Dalekanium Tools**: Better than diamond, Dalekanium made from azbantium, gold, steel, and obsidian, or dropped from Daleks.\n- **Dalekanium Armor**: Protect yourself against all foes, including Daleks. Very strong armor.\n- Gaunlet of Rassilon: A powerful weapon, once held by [Rassilon](https://tardis.fandom.com/wiki/Rassilon) himself.\n- **Achievements**: Using the `awards` API mod, there are several achievements for you to reach while playing.\n- Gallifreyan Chests: Very large, very expensive. \n- Chat command (/summon_tardis) can be used to summon your Tardis (if you have the `bring` privelege).\n- See TODO.md to see what new features are planned.\n\n### Console Units:\n\n- XYZ Axis Console Units: Use this to set your \n  destination. There are 6 levers - increase and decrease for each X, Y, \n  and Z. Clicking these will change the destination coordinate by the \n  Travel Factor, which is set at the top of the screen.\n- Exterior Control Console Unit (Chameleon Circuitry): Changes how the outside of your Tardis looks.\n- Warp Lever Console Unit: The go button. Teleports your Tardis to your set destination.\n- Waypoint Console Unit: Used to set up to three waypoints. Using a waypoint will automatically set your destination to the position the Tardis was in when the waypoint was set. Useful for travelling back to home base or deep underground for mining.\n- Functions Console Unit: Can locate a player, create diamond tools, biscuits, sonic screwdrivers, and heal you.\n- Find Biome Console Unit: Allows you to travel to a \n  specific biome, and shows a list of all biomes in your world on the \n  right. It will not work 100% of the time, but should be good enough.\n- Tardis Monitor Screen: Displays your current position, destination, power, etc. RIght click to view.\n\n### Sonic Screwdriver Functions:\n\n- Lockpick: Click on a steel door/trap door to unlock it (even if it isn't yours!)\n- Summoning: Sneak and click a block to summon your tardis (requires three power)\n- Sonic Knock Back: Sneak and click to an entity to knock the entity backwards (works better the farther away you are from the entity)\n- Sand Conversion: Click (and not sneak) on sand to convert it to silver sand.\n- Glass Conversion: Click on glass to turn it into obsidian glass.\n- Obsidian Reversal: Click on obsidian to turn it into lava.\n- **Mesecon Hacking**: Click on mesecon wires to turn them on/off.\n- Digiline Hacking: Click on digiline wires to send messages through them. (only works if no message currently is being sent to the channel)\n- Scan: Click (and not sneak) on an entity to scan it.\n- Locking: Click on your Tardis to lock/unlock it.\n- Accelerated Growth: Click on dirt to grow grass on it (in a later update growing crops with be supported).\n- **Unique, randomized texture**: Currently there are 4 textures for each third of the screwdriver, and they are all randomised together to create the possibility for 64 (4^3) unique combinations when you create the Sonic Screwdriver.\n\n### Gallifreyan Lab Recipes\n\n- Diamond Blocks to Compressed Space Time.\n- Diamonds to Azbantium Shards\n- Mese Blocks to Diamonds\n- Mese to Arton Crystals\n- Copper Ingot to Steel Ingots\n- Coal Lump to Tin Lumps\n- Steel Block to Mese Crystals\n- Dirt to Coal Lumps\n\n### Dependencies\n\n###### Required:\n\n- `default` for crafting recipes and basic functionality. This mod is made for MTG and ones based on it, none others. MineClone support may be added in the future.\n\n- `mobs` (Mobs Redo API) is used to make the Daleks and Cybermen.\n\n- `findbiome` is used to make the Find Biome Console Unit work.\n  \n  - `biomeinfo` is required if you use v6 mapgen\n\n###### Recommended, but optional:\n\n- `3d_armor` for the Dalekanium Armor set. Makes fighting Daleks and Cybermen a lot easier!\n\n- `doors` so that the Sonic Screwdriver can interact with, lock and unlock doors and trapdoors. Included in MTG by default.\n\n###### Optional:\n\n- `awards` to get achievements in game.\n\n- `pick_axe_tweaks` support for Dalekanium Pickaxe\n\n- `toolranks` support for Dalekanium tools.\n\n- `mesecons` to allow for Mesecon Hacking with the Sonic.\n\n- `digilines` to be able to use the Sonic to send messages through them.\n\n- `subtitles` for sound effects.\n\n### Known Bugs\n\n- Some mobs die when they enter the Tardis.\n- Gallifreyan Chests sometimes have to be double clicked to open.\n- Cave generation occasionally breaks through the Tardis.\n  - Will be fixed when the TARDIS interiors are in a separate dimension.\n- Sometimes the TIme Rotors are not able to generate power.\n  - To fix this, just break it and re-place it.\n\n##### Migrate from `tardis_new` to `drwho_tardis`\n\nA full step-by-step guide for migrating can be found on the Wiki [here](https://codeberg.org/Skivling/DrWho_Tardis/wiki/Migration)\n\n### Contribute + Follow Development\n\n- Star and follow this repository.\n\n- Join the Matrix space: [#drwho_tardis:mtrx.nz](https://matrix.to/#/#drwho_tardis:mtrx.nz)\n  \n  - General: For general discussions about the mod, Doctor Who in Minetest, and anything else that makes sense.\n  \n  - Dev: For developer discussions about the mod. \n  \n  - Announcements: Any announcements I feel need to be shared. These are also put on Mastodon.\n  \n  - All the rooms are end-to-end encrypted, so it might take a bit of time to synchronise messages when you join. Don't message in the first 20+ minutes to aid this and avoid sending messages incorrectly.\n\n- Submit bug reports - either on Codeberg or on Matrix. The more detail the better, it would be best to have the full error message. Make sure you are running the latest version of MInetest first though.\n\n- Help write the wiki / documentation. Ask in the matrix dev channel and we'll give you some pages to work on. This will be barely written by the core devs as we focus on the mod itself.\n\n- Help translate - On Codeberg Weblate, linked in the header.\n\n- Help design textures - It would be great to have better Tardis textures, console sets, etc. We also need some for the achievements.\n\n### License Details\n\nThis mod is fan-made Doctor Who content. It is the work of Skivling and other individual contributors, working from the previous work of PiDemon. It is not endorsed by, associated with, or approved by the BBC. Doctor Who and all related Trademarks are property of the BBC and no infringement is being attempted.\n\n`DrWho_Tardis` Minetest Mod\nCopyright (C) 2024 Skivling\n\nThis program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\n\nAll textures, models and logos included in the `DrWho_Tardis` Minetest Mod are licensed under CC BY-SA 4.0, unless otherwise noted.\n\nMore license details and a copy of the license can be found in LICENSE.txt",
  "maintainers": ["Skivling"],
  "media_license": "CC-BY-SA-4.0",
  "name": "drwho_tardis",
  "provides": ["drwho_tardis"],
  "release": 30681,
  "repo": "https://codeberg.org/Skivling/DrWho_Tardis",
  "score": 11.8,
  "screenshots": [
    "https://content.luanti.org/uploads/23b2385f93.png",
    "https://content.luanti.org/uploads/eb09781b61.jpg",
    "https://content.luanti.org/uploads/72244b74b4.png",
    "https://content.luanti.org/uploads/5e7ac7914b.jpg",
    "https://content.luanti.org/uploads/4a441a14f2.png",
    "https://content.luanti.org/uploads/40613fda0c.png",
    "https://content.luanti.org/uploads/b8a751947d.png",
    "https://content.luanti.org/uploads/c57375d215.png"
  ],
  "short_description": "Adds various items, blocks, Daleks, and a working TARDIS from the sci-fi show Doctor Who.",
  "state": "APPROVED",
  "tags": ["mobs", "technology", "tools", "transport"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/23b2385f93.png",
  "title": "Doctor Who Tardis",
  "translation_url": "https://translate.codeberg.org/projects/drwho_tardis/",
  "type": "mod",
  "url": "https://content.luanti.org/packages/Skivling/drwho_tardis/releases/30681/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": "https://skivling.codeberg.page/projects/drwhomod",
  "dependencies": {
    "Skivling/drwho_tardis": [
      {
        "is_optional": false,
        "name": "findbiome",
        "packages": [
          "Hi_World/newplanet",
          "Wuzzy/mineclone2",
          "VoxelForge/voxelforge",
          "EmptyStar/asuna",
          "Wuzzy/findbiome",
          "ryvnf/mineclonia"
        ]
      }
    ],
    "Wuzzy/findbiome": []
  },
  "hash": "1ybnw6zf5h079add4m697c4v4ki6a6gk0hv92kcwn92xdnjmvzx0"
}
