{
  "author": "BigBear",
  "content_warnings": [],
  "created_at": "2023-03-31T19:13:18.772320",
  "dev_state": "BETA",
  "donate_url": null,
  "downloads": 1027,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": "https://gitlab.com/m4895/elektron/-/issues",
  "license": "MIT",
  "long_description": "# Elektron\n*Note new in V0.6 : Wind power and 'placer' devices.\n\n## Summary\nProvides core functionality for electrical-like power and electronic-like circuits.\nIt shares many similarities with redstone and mesecons+technic, but is a different design.\nIt tries to combine the two concepts of electrical power and logic circuits more closely to better facilitate gameplay.\n\n## Player Guide\n### Main concepts\n\nWire is used to connect devices and transmit power or a signal between them.\nPower and signals are independent\n\n_Signals_:: Signals are digital true/false (0 or 1). Signals are used to perform logic and make decisions.\n\n_Power_:: Power is analogue (0 or more), and is necessary for some devices to function. Power is generated by some devices and consumed by others, similar to DC electricity.\n\n### Wires\nBoth signals and power are transmitted between devices using wires. There are\nthree different types of wire, Red, Blue, and Green. Each color behaves exactly\nthe same, and is governed by the following rules.\n\n#### Power\n* Power is added to a circuit in a cumulative fashion by devices (e.g. Solar panels).\n* Power is consumed from a circuit in a cumulative fashion by devices (e.g. a lamp)\n* There is no top limit to the power that can flow through a circuit.\n\n#### Signal\n* Signals are binary either true of false (on or off, 1 or 0) \n* When mulitple signals are put into the same circuit it behaves like an OR gate, (if any input is true, the circuit is true)\n* Whether a circuit has power or not is irrelevant to its signal value, signal and power are independent.\n\n### Devices\n\n#### Solar\nThis will generate power in high light conditions, usually during daytime. The\namount of power varies (1 to 4) depending on the amount of light. Only one wire\nshould be connected to a solar panel, if mulitple wires are connected only one\nwill recieve the power.\n\n#### Lamp\nLamps consume power (1 unit), and provide a light source of 10.\n\n#### Logic Gate\nThis is a multipurpose logic gate. It provides `AND`, `NOT` and `XOR` in a\nsingle block. This is enough to create any imaginable logic circuit.\n\n#### Button\nA button is a block that emits a signal. Right click on the block changes\nthe signal from true to false, or false to true. It is a manual on/off switch.\n\n#### Switch\nA Switch will connect two circuit together if it recieves a _true_ signal. The\ntwo circuits will diconnect if the signal reverts to false.  It has mulitple\ninputs which are on the sides of the node. They act as an OR gate if one or\nmore true signals are recieved, the connection is made.\n\nThe four signal inputs are sides of the block, the two circuits to be connected\nare on the top and bottom of the block. \n\n#### Activator \nThis can be though of as a 'right-clicker' device. The activator takes a single\npower input which may be connected to any of its five sides. The sixth side is\nfacing the node to be _activated_. If the activator's power input turns on, it\nwill simulate a right click on the target node (e.g. open a door).  The target\nnode can either be directly in front of the activated side, or a gap of one\nblock away. \n\nIt will also function if the gap is filled with another (inert) node (e.g. dirt,\nstone, wood) etc. This means the activator can be hidden behind walls, ceilings\nor floors if desired.\n",
  "maintainers": [
    "BigBear"
  ],
  "media_license": "CC-BY-4.0",
  "name": "elektron",
  "provides": [
    "elektron"
  ],
  "release": 18211,
  "repo": "https://gitlab.com/m4895/elektron",
  "score": 162.3,
  "screenshots": [
    "https://content.luanti.org/uploads/9535d86a7e.jpg"
  ],
  "short_description": "Electricity-like power and devices",
  "state": "APPROVED",
  "tags": [
    "technology"
  ],
  "thumbnail": "https://content.luanti.org/thumbnails/1/9535d86a7e.png",
  "title": "Elektron",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/BigBear/elektron/releases/18211/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": "https://gitlab.com/m4895/elektron/-/blob/master/README.adoc",
  "dependencies": {
    "BigBear/elektron": []
  },
  "hash": "01r911sda6nl1lv0g31nai113561zqfm15bzm719wm2pr4wh549p"
}
