{
  "author": "cronvel",
  "content_warnings": [],
  "created_at": "2020-09-02T14:49:42.907208",
  "dev_state": null,
  "donate_url": null,
  "downloads": 1364,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=25283",
  "forums": 25283,
  "game_support": [],
  "issue_tracker": null,
  "license": "MIT",
  "long_description": "## Landscape Shaping\n\nThis mod add various tools with God-like power to reshape the landscape.\nThis is meant for creative mode, so those *magic wands* have no crafting recipe yet.\n\nAlso, **you should backup your world** before using this, because a mistake can really mess things up.\n\nCurrent magic wands:\n\n* **Transmute wand:** left click copy a node, right click change pointed node into the copy node, existing rotation is preserved\n* **Blow wand:** blow nodes away, left click is like TNT, blowing away anything within the radius, right-click do the same but only for the upward hemisphere instead\n  of the whole sphere, the later is useful to flatten an area\n* **Flat hemisphere wand:** fill the downward hemisphere with the pointed node's type (left-click) or the copied node (right-click), useful to fill holes\n* **Flat square wand:** fill the area of a thin horizontal square at the y-level of the pointed node, with the pointed node's type (left-click)\n  or the copied node (right-click), useful to pave things quickly\n* **Water wand:** left-click: remove all water around (sphere), right-click create a water hemisphere\n* **Lava wand:** works like the water wand for lava\n* **Fall wand:** all nodes within the radius will fall if there isn't anything solid below. Beware, in-range cavern will collapse! Non-blocky things that receive\n  the falling node will be destroyed (snow slabs, grass, ...)\n* **Cover wand:** cover the landscape within the radius with a layer of dirt (left-click) or a layer of the copied node (right-click)\n* **Smooth wand:** smooth the heightmap of the surrounding landscape, left-click: smooth just a bit (just one smooth pass),\n  right-click: smooth more (multiple pass depending on the current wand radius, each pass average with 20 neighbors instead of the 8 closest).\n  Grass and things like snow slabs are preserved in the process, for each voxel on top of the heigtmap, two voxels above and two voxels\n  below are preserved (they move along), but don't mess with trees!\n",
  "maintainers": ["cronvel"],
  "media_license": "MIT",
  "name": "landscape_shaping",
  "provides": ["landscape_shaping"],
  "release": 4965,
  "repo": "https://gitlab.com/cronvel/mt-landscape-shaping",
  "score": 8,
  "screenshots": [
    "https://content.luanti.org/uploads/Sy7OrjzBHb.png",
    "https://content.luanti.org/uploads/hV7wrnQCzt.jpg",
    "https://content.luanti.org/uploads/YlWPJMRvgN.jpg"
  ],
  "short_description": "Landscape shaping tools and API",
  "state": "APPROVED",
  "tags": ["creative"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/Sy7OrjzBHb.png",
  "title": "Landscape Shaping",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/cronvel/landscape_shaping/releases/4965/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "cronvel/landscape_shaping": []
  },
  "hash": "0vaahspwjd19ixql97m957j0mb5z884m6wx1lx1lhyz4fpf136y0"
}
