{
  "author": "JALdMIC",
  "content_warnings": [],
  "created_at": "2024-07-30T12:21:42.394860",
  "dev_state": "WIP",
  "donate_url": null,
  "downloads": 229,
  "forum_url": null,
  "forums": null,
  "game_support": [
    {
      "confidence": 11,
      "game": {
        "author": "Minetest",
        "name": "minetest_game",
        "release": 29742,
        "short_description": "The classic \"Minetest\". A lightweight and well-maintained base for modding",
        "thumbnail": "https://content.luanti.org/thumbnails/1/8ffd1409ff.png",
        "title": "Minetest Game",
        "type": "game"
      },
      "supports": true
    }
  ],
  "issue_tracker": null,
  "license": "CC-BY-SA-4.0",
  "long_description": "##### English\nWarning:\nThis mod is not compatible with other mods that modify the player like 3d armor, because of this using both together can give problems.\n\nDescription: \nThis mod is to try to promote Makehuman and give the player a more realistic model using it, it is also inspired a bit by the character of Carl Johnson from GTA Sand Andreas in that the appearance of the character varies according to his mass and musculature.\n\nDetails:\nThe low version have less than 1000 vertex(775 aprox), the mediun detail have betwen 1000 and 2000 vertex, the high quality have 7000 vertex aprox, I use custom topologies instead of the original because these have 13 000 vertex what is like to much even for the more powerful machines, and the high custom topology have half of this and the models look very similar, also i decided to made diferent mods with the diferent model qualities so the package isn't too big (all together is like 50 mb) and made it easier to download and upload, is you like this mod maybe will like the Makehuman software or their plugin for Blender.\n\n##### Español\nAdvertencia:\nEste mod no es compatible con otros mods que modifican al jugador como 3d_armor por lo que usarlos juntos puede dar problemas .\n\nDescripcion:\nEste mod es para tratar de promover Makehuman y darle al jugador un modelo mas realista usando este,tambien se inspira un poco en el personaje de Carl Johnson de GTA Sand Andreas en que la apariencia del personaje varia segun su masa y su musculatura.\n\nDetalles:\nLa version baja tiene menos de 1000 vertices(775 aproximado), la de detalle medio tiene entre 1000 vertices, los de alta calidad tienen 7000 vertices aproximado pero este se encuentra en un mod aparte, he usado unas topologias customizada en vez de la original porque esta tiene unos 13 000 vertices aproximados lo que es mucho incluso para las maquinas mas potentes (al menos eso creo), y la topologia de alta calidad que he creado tiene la mitad y los modelos lucen muy similares,tambien decidi hacer diferentes mods para las diferentes calidades de modelos para asi no hacerlo muy grande (todo junto tiene como 50 mb) y hacerlo mas facil de descargar y subir, si te gusta este mod tal vez te guste Makehuman o su plugin para Blender.",
  "maintainers": ["JALdMIC"],
  "media_license": "CC-BY-SA-4.0",
  "name": "aw_personaje_anthro",
  "provides": ["aw_personaje_anthro"],
  "release": 27361,
  "repo": null,
  "score": 308.1,
  "screenshots": ["https://content.luanti.org/uploads/ca267f8061.png"],
  "short_description": "This mod is for try to sponsor the Makehuman and give the player a more realistic model",
  "state": "APPROVED",
  "tags": ["creative"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/ca267f8061.png",
  "title": "aw_personaje_anthro",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/JALdMIC/aw_personaje_anthro/releases/27361/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "JALdMIC/aw_personaje_anthro": []
  },
  "hash": "1p26m2nhymcqmjvyvslcjriqnpnk27hda8fq4869cj6lk0a30wmw"
}
