{
  "author": "ApolloX",
  "content_warnings": [],
  "created_at": "2021-10-27T20:29:10.479966",
  "dev_state": null,
  "donate_url": null,
  "downloads": 2620,
  "forum_url": null,
  "forums": null,
  "game_support": [
    {
      "confidence": 11,
      "game": {
        "author": "Minetest",
        "name": "minetest_game",
        "release": 29742,
        "short_description": "The classic \"Minetest\". A lightweight and well-maintained base for modding",
        "thumbnail": "https://content.luanti.org/thumbnails/1/8ffd1409ff.png",
        "title": "Minetest Game",
        "type": "game"
      },
      "supports": true
    },
    {
      "confidence": 11,
      "game": {
        "author": "Wuzzy",
        "name": "mineclone2",
        "release": 29214,
        "short_description": "Survive, farm, build, explore, play with friends, and do much more. Inspired by Minecraft, pushing beyond.",
        "thumbnail": "https://content.luanti.org/thumbnails/1/55ab4fc1b5.png",
        "title": "VoxeLibre (formerly MineClone2)",
        "type": "game"
      },
      "supports": true
    }
  ],
  "issue_tracker": "https://github.com/Beanzilla/credits/issues",
  "license": "MIT",
  "long_description": "# Credits\n\nA physical and digital currency.\n\n## What's in the box\n\n* Physical representation of a digital currency. (Use `/credits dump ##` Where # is number of coins to convert to a physical item, as of v1.3 the physical item will now hold all the value in whole, rather than in quantity of items)\n* Digital currency. (And a player can `/credits load` to convert all credits in their inventory to convert the physical item back to digital, as of v1.3 the `/credits load` command will only load physical items in the players hand, and using the item without looking at something will also load the credits in hand)\n* An API for performing general calculations (Such as getting the total balance of the player (both physical and digital), adding or taking credits, etc)\n* Interest rate (Gives players a percent of their digital credits per in-game day)\n* Want to change something? Just take a peek in the settings.lua file for a setting for it.\n\n> Please note, Interest rate will only provide a percent of digital credits. (Physical is not included in interest)\n\n## Why Digital and Physical?\n\n### Why Digital\n\nDigital allows a player to have a very large amount of currency without needing to carry all that around. (instead the mod holds the number in memory)\n\nIn a Digital form it is slightly easier to know how much a player has. (Where as the physical would require this mod to check their inventory each time I want a balance)\n\n> I made it so a player can convert from Digital to Physical so that a player can give another player a Physical item as payment. (Though `/credits pay playername ##` works too)\n\n### Why Physical\n\n> Phyiscal item now currently breaks other shop mods, a shop will be provided in this mod to correct a major bug/issue. (Shop mods like smartshops, and the shop provided in currency go by item_name and item:get_count(), but physical credits have a meta value which contains the amount they are worth)\n\nPhysical was added to provide a way for a player to in some sense \"save\" credits so if they tend to spend all their credits they could convert some to physical then hide that in a chest.\n\nIt was also added to allow completely physical item trades. (For those who don't trust the `/credits pay playername ##` command, or are using it at a shop)\n\n> I made it so a player can convert Physical back to Digital for when they don't want the Physical items sitting around. (As digital can't be stolen)\n\n\n## Command Reference\n\nOr just /help and select credits to see all commands for credits. (`/credits` is the base command)\n\n### Dump\n\n`/credits dump ##`\n\nConverts ## of credits into the physical (provided there is space in the player's inventory and they have ## of credits)\n\n> No limit was achieved in v1.3 thanks to the fact that all the # will be stored into 1 credit (1 phyiscal item)\n\n### load\n\n`/credits load`\n\nConverts ALL physical credits into the digital. (thus all the physical coins are removed from the player's inventory)\n\n> As of v1.3 this will only load any credits in your hand (if it's not in your hand it won't load it)\n\n### pay\n\n`/credits pay playername ##`\n\nSends ## of credits in digital form to the playername (provided that player has a credits account which is created on first login that the mod recognizes, and the player issuing this command has ## of credits)\n\n> This keeps everything digital (Use dump and load to physically trade credits)\n\n### bal\n\n`/credits bal`\n\nCalculates total number of credits the player has. (Also gives a breakdown of digital and physical credit counts)\n\n> I.E. Assuming I had 10 credits in digital and 100 in physical:\n>\n>        Total:    110\n>\n>        Digital:  10\n>\n>        Physical: 100\n",
  "maintainers": [
    "ApolloX"
  ],
  "media_license": "MIT",
  "name": "credits",
  "provides": [
    "credits"
  ],
  "release": 12302,
  "repo": "https://github.com/Beanzilla/credits",
  "score": -138.3,
  "screenshots": [
    "https://content.luanti.org/uploads/4be7a55684.png"
  ],
  "short_description": "A currency which can be digital or physical",
  "state": "APPROVED",
  "tags": [
    "commerce"
  ],
  "thumbnail": "https://content.luanti.org/thumbnails/1/4be7a55684.png",
  "title": "Credits",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/ApolloX/credits/releases/12302/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "ApolloX/credits": []
  },
  "hash": "1x5s5hfhydj4lb4cn8rhb5lsrkz2j86i6cn40diccd2qvpmv6hj0"
}
