{
  "author": "Marnack",
  "content_warnings": [],
  "created_at": "2024-05-25T05:10:59.138177",
  "dev_state": "BETA",
  "donate_url": null,
  "downloads": 458,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": "https://github.com/Marnack/advtrains_crafting_compatibility_patch/issues",
  "license": "AGPL-3.0-or-later",
  "long_description": "# AdvTrains Crafting Compatibility Patch\n\n*DISCLAIMER: This is currently a Beta release intended for community evaluation and feedback.  Although it has been tested and functions as expected, be sure to make the necessary backups before using in established games.*\n\n**AdvTrains Crafting Compatibility Patch** allows the the crafting of items such as tracks, signals, signs, etc. from the [AdvTrains](https://content.minetest.net/packages/orwell/advtrains/) mod while playing in survival mode of games that are not based on \"Minetest Game\".\n\n***Note: This patch is typically not needed when using AdvTrains in \"Minetest Game\" or its variants.***\n\n![](screenshot.png)\n\nAdvTrains is not game specific and its items can always be acquired when playing in creative mode.  However, it is not always possible to craft its items when playing in survival mode in some games.  The reason for this is that AdvTrains registers its crafting recipes with the assumption that it is being used by \"Minetest Game\" or a game based on some of the mods from \"Minetest Game\".  This means that if AdvTrains is used in a game without the necessary mods, some or all of its crafting recipes may not be usable due to unavailable items.  In that case, the only way to get critical items such as track, tools, wagon parts, signs & signals and platforms when playing in survival mode would be to have the *creative* or *give* privilege or, if playing on a multi-player server, the admin provides the items via shops, chests, etc.  This mod adds the crafting recipes for items from AdvTrains to a select set of games that are not based on \"Minetest Game\" using suitable material substitutions from the respective game.  It currently adds crafting support for the following games:\n\n- [Farlands Reloaded](https://content.minetest.net/packages/wsor4035/farlands_reloaded/)*\n- [Hades Revisited](https://content.minetest.net/packages/Wuzzy/hades_revisited/)*\n- [Minecloneia](https://content.minetest.net/packages/ryvnf/mineclonia/)\n- [VoxeLibre](https://content.minetest.net/packages/Wuzzy/mineclone2/)\n\n\t*Some AdvTrains items related to Lua automation will remain uncraftable due to their dependency on [Digilines](https://content.luanti.org/packages/Jeija/digilines/) which does not currently support these games.\n\nThis mod will also optionally remove the AdvTrains crafting recipes that are based on ingredients from \"Minetest Game\" that are unavailable in the current game.  This should be safe in most cases.  However, if using another mod that provides alternate crafting recipes for the items from AdvTrains then this feature should be disabled via the mod settings since it might remove those alternate recipes.\n\nNote that because this mod is a patch, it is susceptible to being broken by future changes to the crafting recipes in AdvTrains and material changes in the games that this mod attempts to support.\n\nFinally, this mod also provides an API so that other mods can customize the material substitution mapping used in the crafting recipes created by this mod if desired.  See [API_reference_guide.md](API_reference_guide.md) for details.\n\n",
  "maintainers": ["Marnack"],
  "media_license": "CC-BY-SA-4.0",
  "name": "advtrains_crafting_compatibility_patch",
  "provides": ["advtrains_crafting_compatibility_patch"],
  "release": 31955,
  "repo": "https://github.com/Marnack/advtrains_crafting_compatibility_patch",
  "score": 8.5,
  "screenshots": ["https://content.luanti.org/uploads/93b9581de6.png"],
  "short_description": "Enables crafting of advtrains items in games that are not based on Minetest Game.",
  "state": "APPROVED",
  "tags": ["transport"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/93b9581de6.png",
  "title": "AdvTrains Crafting Compatibility Patch",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/Marnack/advtrains_crafting_compatibility_patch/releases/31955/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "Marnack/advtrains_crafting_compatibility_patch": [
      {
        "is_optional": false,
        "name": "advtrains",
        "packages": ["orwell/advtrains"]
      },
      {
        "is_optional": false,
        "name": "advtrains_train_track",
        "packages": ["orwell/advtrains"]
      }
    ],
    "orwell/advtrains": []
  },
  "hash": "17jza8k92dxld44dl1b4ljzlnb6d4j6lkrnjk54rfvrgms4d7g0a"
}
