{"author":"FaceDeer","content_warnings":[],"created_at":"2018-05-27T15:48:10.242555","dev_state":"MAINTENANCE_ONLY","donate_url":null,"downloads":19432,"forum_url":"https://forum.luanti.org/viewtopic.php?t=20058","forums":20058,"game_support":[],"issue_tracker":"https://github.com/minetest-mods/hopper/issues/","license":"MIT","long_description":"Hoppers are nodes that can transfer items to and from the inventories of adjacent nodes. The wide end of a hopper is its \"input\" end, if there's a chest or other compatible container it will take one item per second into its own internal inventory. It will also draw in items that have been dropped here. The narrow end of the hopper is its \"output\" end. It will attempt to inject items into a compatible container located at its output end. If there's no compatible container and the hopper's \"eject\" mode has been enabled it will instead dump the items out into the world.\n\nAlso included in this mod are a \"chute\" node and a \"sorter\" node. These allow for items to be routed over short distances and distributed in sophisticated ways.\n\nA chute simply moves items into adjacent nodes. You'll need to use a hopper or sorter to inject items into it to move along. A screwdriver is a useful tool for getting chutes aimed correctly.\n\nA sorter has two different outputs. Its inventory has a \"filter\" grid; place items in this grid to set the sorter's filter. Items that match the filter will be sent out the output with the large arrow and other items will be sent out the output with the smaller arrow. A \"filter all\" option will cause the sorter to attempt to send all items in the direction of the large arrow and then if that fails send them in the direction of the smaller arrow. This allows you to have an \"overflow\" storage should the sorter's primary target fill up, or when used in combination with a selective container (like the furnace's fuel slot, for example) it allows the target inventory to do the filtering for you.","maintainers":["FaceDeer"],"media_license":"CC0-1.0","name":"hopper","provides":["hopper"],"release":29666,"repo":"https://github.com/minetest-mods/hopper","score":629.1,"screenshots":["https://content.luanti.org/uploads/tsqiK4viYK.png"],"short_description":"Adds hoppers to transport items between chests/furnace etc.","state":"APPROVED","tags":["building","technology"],"thumbnail":"https://content.luanti.org/thumbnails/1/tsqiK4viYK.png","title":"Huni","translation_url":null,"type":"mod","url":"https://content.luanti.org/packages/FaceDeer/hopper/releases/29666/download/","video_thumbnail_url":null,"video_url":null,"website":null,"dependencies":{"FaceDeer/hopper":[]},"hash":"0mibcxxlspa1md4xnb72v8j0rx68fxykg50hjv365pf29h3ycq55"}