{
  "author": "RedundantC",
  "content_warnings": [],
  "created_at": "2023-12-20T09:37:06.980473",
  "dev_state": "DEPRECATED",
  "donate_url": null,
  "downloads": 7778,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": null,
  "license": "Other (Free/Open)",
  "long_description": "### Wisdom Check Part 1: post mortem analysis \nI decided to enter the game jam in order to achieve the goals of learning Lua, understanding the minetest game engine, and gaining knowledge of the cdb publishing process. The following is a post mortem analysis of what when well and what went wrong during our games development.\n\n### What Went Well:\n\nMinetest: Overall I enjoyed working with the minetest engine and found it to be fast, easy to use, and a good opportunity to refresh my knowledge of a programming language I hadn't used since learning love2d. I was able to find the necessary information in the documentation after spending a few hours on it (shout out to dump()). I also think I'd like to compile the engine from source just for fun, I have plenty to learn and it could be interesting if only for my personal enjoyment.\n\nPlaytesting & Level Design: This part was great, by setting the backend and player_backend to dummy we were able to test changes quickly. There was talk of using schematics, but while it would have helped separate the concerns of programming and level design I don't believe that to be a positive thing given our team size and the illegibility of reading such files. By plugging directly into the world generator we kept the world state legible and the room we made looked nice (well before we had to trim textures anyway).\n\n\n### What Went Wrong:\n\nProject Management: During this particular project, we encountered numerous challenges that significantly impacted our progress. The issue of overlapping responsibilities created confusion within the team, resulting in duplicated efforts and wasted time. This experience serves as a reminder of the critical role that effective project management plays in ensuring the overall success of any project. Properly coordinating and balancing tasks, and setting realistic timelines as an important role in any successful project.\n\nMinimal Scope: Despite the limitations and challenges faced, the team made the best of the time they had to create a small game. Issues such as library licencing compatibility and team members being pulled for overtime during the holiday season contributed to the decision to complete the original goals in the smallest possible game. While there is still room for improvement and further development, we acknowledge that expanding on a joke that didn't land initially won't make it any funnier. Moving forward, I plan to focus on creating a fun game with a strong, central mechanic that can carry the entire experience.\n\nLicencing: Fuck fuck fuck fuck fuck, with a side of fucking awful. It is no exaggeration to say this was (and still is) the biggest pain in our ass. I'll definitely be using cc0 everything next time, cause pulling from default was like pulling teeth from a stampede of horses. Aside from textures there were issues with importing libraries, voice actors not wanting there audio in the public domain and just general headache with what was and wasn't \"The Right Way\" and for a first project it was kinda alot. We had originally planned for about a week to solve any external licencing and packaging concerns but due to personal reasons we ended up leaving it up to the last minute. Which was to reiterate FUCKED!\n\nRegarding the feedback received, there were numerous constructive insights that we can learn from. Going forward I think it would be wise to establish a foundational knowledge base and tool suite to enable rapid game and mod development. The initial motivation for publishing this project was to force myself to dedicate time to minetest, but the unexpected and intriguing response from the community has been both surprising and entertaining. I never anticipated people showing this much interest in a seemingly insignificant game meant for testing features and exploring the engine. This experience has taught me a valuable lesson; Don't Post Cringe. In the future, I will ensure that any published code is fully developed and polished. It's truly humbling to witness a considerable number of individuals engaging with our creation, considering I initially anticipated less than 25 players, yet there have already been 100 downloads at the time of this writing. However our primary focus will be preparing for next year, by dedicating the libraries textures and other resources we would have loved to have this year to the public domain, in the meantime, I invite anyone to share their criticisms of the game, as I believe it will only make us stronger and more prepared for next year.\n\n##### I'll leave you with the words we have hung up in our offices, words that remind us we're only human.\n\nNo one is invisible,\n\nNo one is immortal,\n\nEveryone has a weakness.\n\nRegards Ↄ\n\n\n",
  "maintainers": ["RedundantC"],
  "media_license": "CC-BY-SA-4.0",
  "name": "wis_part1",
  "provides": [
    "controls",
    "formspec_ast",
    "greglib",
    "hud_fs",
    "hud_notify",
    "sounds",
    "wield_events",
    "wis",
    "wis_inject_media",
    "wis_port_mineclonia"
  ],
  "release": 22501,
  "repo": "https://github.com/RedundantC/wis_part1.git",
  "score": -599.4,
  "screenshots": ["https://content.luanti.org/uploads/13d2e4ed2c.png"],
  "short_description": "Fear of Surprises (game jam 2023 entry)",
  "state": "APPROVED",
  "tags": ["jam_game_2023", "oneofakind__original", "singleplayer"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/13d2e4ed2c.png",
  "title": "Wisdom Check Part 1",
  "translation_url": null,
  "type": "game",
  "url": "https://content.luanti.org/packages/RedundantC/wis_part1/releases/22501/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "RedundantC/wis_part1": []
  },
  "hash": "16nf1liaaap1y31z1pjs8y3xqvp5m0kbs1qcl3pqj1mv47xkvn6n"
}
