{
  "author": "cronvel",
  "content_warnings": [],
  "created_at": "2019-11-25T14:43:08.635176",
  "dev_state": null,
  "donate_url": null,
  "downloads": 2884,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=23708",
  "forums": 23708,
  "game_support": [],
  "issue_tracker": null,
  "license": "MIT",
  "long_description": "## Respawn\n\n-- Manage respawn points, interesting places, teleportation and death records\n\n\n### Features\n\n* Create/manage as many respawn points you want, to be used randomly (e.g. on player death or first connection)\n* Create/manage as many team respawn points you want\n* Create/manage global map place\n* Each player can have its own personal places (stored and used separately from the global places)\n* Each place and respawn retains not only the position, **but also a direction where to look**,\n  ideal for creating great spot on the map where you already look at the right thing once teleported\n* Place have a short name (i.e. an ID, without space) and a full name (that can have space)\n* Check close to which place you are\n* Powerful teleport command\n    * teleport self or teleport other (with different privileges)\n    * teleport to a respawn point, a global place, an own place, a coordinate, your last death place, or next to a player\n    * teleport whole teams to their respective team respawn\n* Assign any player to a team, list team members\n* List any type of places\n* List any player death\n* Every death are displayed and logged, with the reason and the place it happened (if closed to a known global place)\n* Have a setting allowing players to respawn to their team respawn instead of using a regular respawn point (disabled by default)\n* Have a setting allowing player to respawn to their personal own place named \"home\" instead of using a regular respawn point (disabled by default)\n\n\n\n### Commands overview\n\nFor the complete syntax, see the in-game help.\n\n* /list_teams: list all teams with their members\n* /get_team: display the team of a player\n* /set_team: set a team to a player\n* /list_respawns: List all respawn points.\n* /reset_respawns: Reset respawn points. Require the \"server\" privilege.\n* /set_respawn: Create a respawn point on your current player position. Require the \"server\" privilege.\n* /list_places: List all (global) places.\n* /reset_places: Reset (global) places, i.e. remove all places at once. Require the \"server\" and \"place\" privileges.\n* /set_place: Create a (global) place on your current player position, also accept a full name for tasteful place names.\n  Require the \"place\" privilege.\n* /remove_place: Remove one of the (global) place. Require the \"place\" privilege.\n* /list_own_places: List all your personal own places.\n* /reset_own_places: Reset all your personal own places, i.e. remove them all at once.\n* /set_own_place: Create a personal own place on your current player position, also accept a full name for tasteful place names.\n* /remove_own_place: Remove one of your personal own place.\n* /reset_all_player_places: Remove all personal places of all players at once. Require the \"server\" and \"place\" privileges.\n* /where: Tell you where you are, i.e. close to which place you are, if there is anyone close to you.\n  Search on both your own places list and the global places list. Require no privileges, but with the \"locate\" privilege\n  you can also see your coordinate and you can also locate any player.\n* /teleport: teleport yourself to a respawn point, a global place, a personal own place, your last death place, a coordinate,\n  or a player. Require the \"teleport\" privilege.\n* /teleport_other: teleport anyone to a respawn point, a global place, one of your personal own place (not their),\n  their last death place, a coordinate, close to you or any player. Require the \"teleport\" and \"teleport_other\" privileges.\n* /teleport_teams: teleport teams to their respective team respawn.\n* /list_deaths: list your or any player deaths with the cause and the place it occurs.\n\n\n\n### Privileges\n\n* teleport: Can use /teleport to self teleport to a registered respawn point, global place, own place, last death place.\n  Can teleport to xyz coordinates or close to another player in conjunction with the \"locate\" privilege.\n* teleport_other: Can use /teleport_other to teleport any player to a registered respawn point, global place, own place (yours),\n  last death place (their), or close to self.\n  Can teleport to xyz coordinates or close to another player in conjunction with the \"locate\" privilege.\n* place: Can use /set_place, /remove_place, /reset_places and /reset_all_player_places  to manage global places.\n* locate: Can use advanced /where command to locate other player and output coordinate, extend /teleport and /teleport_other\n  to support xyz coordinates and teleporting close to another player.\n* team: Can use /set_team to assign a player to a team.\n\n\n\n### Settings\n\n* enable_team_respawn: If enabled (default: disabled), players use their respective team respawn (if any).\n  Note: This have greater priority than home respawn (if set).\n\n* enable_home_respawn: if enabled (default: disabled), the player can respawn at their home instead of a regular respawn point.\n  Note: should not be confused with the *sethome* mod's home, the player should have typed the command `set_own_place home`\n  for this to work.\n\n",
  "maintainers": [
    "cronvel"
  ],
  "media_license": "MIT",
  "name": "respawn",
  "provides": [
    "respawn"
  ],
  "release": 2406,
  "repo": "https://gitlab.com/cronvel/mt-respawn",
  "score": 8.8,
  "screenshots": [
    "https://content.luanti.org/uploads/iRGcBLgUcz.png"
  ],
  "short_description": "Manage respawn points, interesting places, teleportation and death records",
  "state": "APPROVED",
  "tags": [
    "server_tools",
    "transport"
  ],
  "thumbnail": "https://content.luanti.org/thumbnails/1/iRGcBLgUcz.png",
  "title": "Respawn",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/cronvel/respawn/releases/2406/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "cronvel/respawn": []
  },
  "hash": "1mdkxljwqxpwfq0w1xv905ld0yz8v3ip5x8b4jypb363pqcg2z8s"
}
