{
  "author": "covertiii",
  "content_warnings": ["violence"],
  "created_at": "2025-02-09T17:45:15.408782",
  "dev_state": "BETA",
  "donate_url": null,
  "downloads": 636,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=29724",
  "forums": 29724,
  "game_support": [],
  "issue_tracker": "https://gitlab.com/billy.covert/mogue/-/issues",
  "license": "AGPL-3.0-or-later",
  "long_description": "Hello adventurer!  Welcome to Mogue, a Brogue-like realtime dungeon crawler built in Luanti.  You're on a quest to retrieve the Crystal of Yendor, rumored to be somewhere in depth 12 of the dungeons.  Bring it back up to the surface, place it on the pedestal and your name will forever be remembered.  Along the way, try to collect as much gold as possible to show off to future explorers of the dungeon.  But beware! The dungeon and its inhabitants do not take kindly to intruders. There will be traps you must avoid and monsters to sneak around, to fight, or to run away from.  If you die on your quest, you will lose any items you find, your stats will reset, and you'll need to start again at the top.  The dungeon itself will change its shape, and you will need to explore it anew.  But do not despair, as you explore the dungeon, there will be many chests containing items to help you on your way to retrieve the fabled crystal.\n\n## Items\n\nIn the chests you will find weapons, armor, staves, wands, charms, rings, potions, and scrolls.  There are three very important items you especially need to be on the look out for: potions of life, potions of strength and scrolls of enchanting.  \n\n  - The potion of life will permanently update your max health and fill it to the top.  \n  - The potion of strength will make you stronger.  You will be able to wield heavy weapons more effectively and wear heavier armor to your advantage.\n  - The scroll of enchantment can be used to permanently upgrade weapons, armor, staves, wands, charms or rings.  You pick what you want to upgrade.\n\n### Weapons\n\nWeapons are used to hit monsters.  Some weapons will do more damage than others, but those weapons will require you to be stronger to use.  If you do use them without the required strength, you may find your hits missing monsters more often than not.  You can lower the strength requirement of a weapon by enchanting it.  Pay attention to the messages the game sends you when you first wield a weapon, it'll tell the strength requirement of the weapon.  If you spam the weapon and don't wait for the weapon to reset, you will miss monsters more often than not as well.  Some weapons have a longer hit range.  These are useful so you don't have to get up so close to the monsters to fight them.  Weapons spawn in the dungeon with positive, negative or no enchantments.  These are hidden from you.  You can identify what they are by either killing 20 monsters with the weapon or using a scroll of identification on the weapon.  Watch out for monsters that will degrade your weapons if you hit them.  A scroll of protect weapon will protect your weapon from this fate.\n\n### Armor\n\nGood armor reduces the chance that a monster will hit you.  Higher armor class (AC) is better.  Heavier armor requires more strength.  You can also lower the strength requirement of armor by enchanting it.  Better protection comes at a cost; It makes you more noisy and increases the range at which monsters notice you (this is your stealth stat).  These will also spawn in the dungeon with positive, negative or no enchantments.  These will be hidden as well.  If you wear your armor for 500 seconds or more, you will become familiar with it and know what it's intrinsic enchantments are.  There are monsters that can degrade your armor if they hit you.  A scroll of protect armor will protect your armor from this fate.\n\n### Staves\n\nStaves are powerful magical items that shoot magical bolts.  There is a staff of fire that will shoot bolts of fire, catch terrain on fire, and catch the monster it hits on fire as well.  There is a staff of blinking that will teleport you to where the bolt goes.  Staves start with 2-5 charges and recharge over time.  Enchanting a staff will increase it's maximum charges, increase the effect of the bolt, increase the range of the staff and decrease the time it takes to recharge.  For example, a bolt of fire will go further, do more damage when it hits and burn enemies longer the more it's enchanted.  The staff of blinking will have a longer ranger.  There are other types of staves that have different effects to be found in the dungeons.\n\n### Wands\n\nAt the moment, there's only 2 wands to be found in the dungeons.  A wand of polymorph and a wand of teleportation.  A wand starts with 2-5 charges and does not recharge over time.  Extra charges can be added by enchanting the wand.  Some people question the wisdom in doing this through.  A wand of teleportation will teleport any creature it hits to a random place in the depth of the current dungeon you are on.  A wand of polymorph will change one monster into a different type of monster.  It's best not to use a wand of polymorph on a rat, cat or wolf.\n\n### Charms\n\nCharms are like staves in which they are rechargeable, but they only have one charge and they effect you in different ways instead of shooting to effect a monster.  For example, a charm of health will heal you for a percentage of your health.  A charm of protection will put a magical shield around you that monsters need to break through before they start getting at your health.  A charm of teleport can be used for a quick escape and teleport you to a random place in the level.  A charm of shattering will turn the walls around you into crystal that will then dissipate when touching air.  Enchanting a charm will increase the duration and potency of its magical effect and decrease the time it takes to recharge. \n\n### Rings\n\nRings increase some internal effect on the player.  Wearing a ring of regeneration will increase the players regeneration allowing them to heal more quickly.  Wearing a ring of stealth will decrease the range at which monsters notice the player. Wearing a ring of wisdom will decrease the time it takes all your staves to recharge.  Wearing a ring of transference will heal you a percentage of the damage that you deal to monsters.  Wearing a ring of reaping will decrease the time to recharge a stave each time you hit a monster.  Enchanting the ring will increase the potency of its effect.  Only one ring can be worn at a time.  Rings can spawn with positive or negative enchantments.  Negative enchantments will make worsen the effect of the ring.  For example a negative ring of regeneration will slow the regeneration time even more than wearing no ring.  Rings can be identified by wearing them for more than 500 seconds or by using a scroll of identity.\n\n### Scrolls\n\nScrolls are one time use items that have some magical effect.  There are scrolls of enchantment, identity, protect armor, protect weapon, shattering, and teleport.  Since they are one time use, they cannot be enchanted.\n\n### Potions\n\nThere are two type of potions - those that can be thrown and those that can be drunk.  Throwable potions will have some negative impact on when thrown.  A potion of descent will open up the current depth and drop monsters down to the next depth, then close back up.  A potion of incineration will explode in a giant ball of fire.  There are more to find and try out.  Drinkable potions include the potions life, strength, invisibility, haste, and levitation.  There are others as well.  Since these are one time use, they cannot be enchanted.\n\n\n## Player Stats\n\nAt the bottom of the screen you can see your character's stats.  There's Satiation, Health, Stealth, AC, Str, Depth, Dmg, Acc and Breath.  \n\n### Satiation\n\nThis is how hungry you are.  Eating ration of food will increase your satiation by 20 points and an apple 10.  Once your satiation is 2 or below, you start losing health points.  \n\n### Health\n\nThis is how much health you have.  When monsters successfully hit you, your health goes down.  When you health is 0 your character is dead and you need to restart your quest with a new character.\n\n### Stealth\n\nMonster need to be in the radius of your stealth range to have a chance to notice you.  Each second monsters are within your stealth range, they have a 49 percent chance to notice you.  If you hit a monster, they'll notice you right away and attack you.  Not moving will cut your stealth range in half.  Heavier armor will increase your stealth range.  A ring of stealth will reduce you stealth range.  When you are invisible your stealth range is 1.  If you are not invisible the lowest your stealth range can be is 2. \n\n### AC\n\nThis is your armor class.  Higher is better.  A higher armor class will reduce the chance that a monster will land a hit on you.  This stat is effected by the current armor you are wearing.\n\n### Str\n\nThis is your strength.  It can only go up by drinking a potion of strength.  There are certain monsters that can temporarily weaken you when they hit you.  Drinking a potion of strength or life will clear any weakness the player has.\n\n### Depth\n\nThis is the dungeon level you are on.  The crystal is on level 12.  However, there are deeper levels than 12.  If you desire an extra challenge, try to go deeper to collect more gold than a previous successful run.  Beware, there are more fearsome monsters under depth 12 and it can get harder to see the lower you go.\n\n### Dmg\n\nThis is the average damage the weapon you are wielding will do to a monster when you hit it.\n\n### Acc\n\nThis is the accuracy at which you will hit a monster with the weapon you are wielding.  If you are wielding a weapon with a higher strength requirement than what you current have, it will decrease your accuracy.  Monsters have a defense stat which get applied against your accuracy which can make some of them hard to hit than it would appear.",
  "maintainers": ["covertiii"],
  "media_license": "CC-BY-SA-4.0",
  "name": "mogue",
  "provides": [
    "3d_armor",
    "3d_armor_sfinv",
    "3d_armor_stand",
    "bones",
    "bows",
    "fire",
    "grenades",
    "hbhunger",
    "hudbars",
    "mg_arch",
    "mg_armor",
    "mg_bolts",
    "mg_book",
    "mg_burning",
    "mg_chest",
    "mg_combat",
    "mg_doors",
    "mg_dungeon_registration",
    "mg_effects",
    "mg_game",
    "mg_gui",
    "mg_hand",
    "mg_hud",
    "mg_ladder",
    "mg_mapgen",
    "mg_media",
    "mg_mobs",
    "mg_poison",
    "mg_potions",
    "mg_rings",
    "mg_scrolls",
    "mg_stealth",
    "mg_strength",
    "mg_tools",
    "mg_torch",
    "mg_traps",
    "mobkit",
    "pep",
    "player_api",
    "player_monoids",
    "playereffects",
    "sfinv",
    "signs_lib",
    "skinsdb",
    "wieldview"
  ],
  "release": 31861,
  "repo": "https://gitlab.com/billy.covert/mogue/",
  "score": 348.4,
  "screenshots": [
    "https://content.luanti.org/uploads/26d9d831da.png",
    "https://content.luanti.org/uploads/c0bdc60543.png",
    "https://content.luanti.org/uploads/7aee72230c.png",
    "https://content.luanti.org/uploads/6299bf098a.png",
    "https://content.luanti.org/uploads/334416e322.png",
    "https://content.luanti.org/uploads/a3715fd173.png"
  ],
  "short_description": "Roguelite Inspired by Brogue",
  "state": "APPROVED",
  "tags": ["adventure__rpg", "magic", "player_effects", "pve", "singleplayer"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/26d9d831da.png",
  "title": "Mogue",
  "translation_url": null,
  "type": "game",
  "url": "https://content.luanti.org/packages/covertiii/mogue/releases/31861/download/",
  "video_thumbnail_url": "https://content.luanti.org/thumbnails/youtube/cTe2jm57gYY.jpg",
  "video_url": "https://www.youtube.com/watch?v=cTe2jm57gYY",
  "website": "https://gitlab.com/billy.covert/mogue/",
  "dependencies": { "covertiii/mogue": [] },
  "hash": "0n9p9hz02xrxwsiivrbac3bjnd02gk4plm7sq5kr7az7jsz4s7sc"
}
