{
  "author": "Andrii",
  "content_warnings": [],
  "created_at": "2023-11-11T19:25:47.167046",
  "dev_state": "ACTIVELY_DEVELOPED",
  "donate_url": null,
  "downloads": 718,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=30390",
  "forums": 30390,
  "game_support": [],
  "issue_tracker": "https://gitlab.com/andriyndev/superquest/-/issues",
  "license": "MIT",
  "long_description": "# SuperQuest\nA Minetest mod that allows to create active quests and challenges.\n\n## Nodes\nThe mod contains the following nodes:\n\n- Flag\n- Digiline-requiring flag\n- Quest Machine\n- Flat Quest Machine\n\n## Completing quests\nTo complete a quest, you need to punch all the flags which belong to the quest. To get a reward, after punching all the flags, you need to punch a quest machine which belongs to the quest (network). Reward for the first completion might be different from reward for further completions. If the quest machine's internal inventory does not contain enough items, you won't be able to get the reward until it will be refilled. The maximum number of completions of a quest for one player might be restricted.\nFlags can also be triggered automatically when a player entered a cubic area around the flag specified in the flag's configuration, if the feature is enabled in mod's config. It was decided to use a cubic area instead of a spherical one to make it more customizable. Need to mention that in some time flags might not be triggered when the player entered the area. This might happen because of a big lag or the player entered it for a very short time (scanning occurs periodically, once per second by default); in this case, the flag should be punched manually.\nExcept of ordinary flags, there are also \"Digiline-requiring flags\" which can be activated only after receiving the corresponding Digiline message. How can the flag receive the corresponding message depends on the quest itself, and it's the quest owner's responsibility to make it clear for players which are completing the quest and which are not familiar with Digilines.\nTo complete a timed quest, it needs to be started first by pressing the \"Start\" button in the quest's Quest Machine. If the quest wasn't completed within the time limit, the progress (triggered flags) will be reset.\nPlayers can teleport to Quest Machines after completing the quest as well as last counted flag in case of death during completion of the quest if it's enabled by server and the quest's \nauthor, and if there is enough place to teleport. If the last counted flag doesn't support teleportation, the player will be teleported to the last counted flag which supported teleportation at the moment of counting if there is such a flag (if the teleportation to the flag became unavailable between the two events, the player won't be able to teleport).\nThis feature exists to allow players avoid extra actions like traveling from the last counted flag to the Quest machine which could be quite far from each other, or allow to continue\ncompleting the quest in case of death without necessity to start it from scratch. For this reason, the player can teleport only to the latest location, and it's cleared after taking the reward or logging out, so it shouldn't be used as a reliable method of teleportation. Teleportation is performed with a chat command specified in the corresponding section.\n\nBy right-clicking a quest machine, you can see:\n\n - How many flags you punched, and the total number of flags\n - Which reward you will get for completing the quest\n - How many rewards are currently available\n - How many times you completed the quest\n - The maximum number of completions to get a reward (0 = infinity)\n - For timed quests, the time limit for completing the quest\n\nNeed to mention that the number of available rewards for first and further completions are calculated based on the shared inventory of the Quest Machine, thus, if rewards for first and further completions contain the same items, receiving reward for the first completion might also affect the number of available rewards for the further completions, and vice versa.\n\n## Creating quests\nAfter placing flags or quest machines the placer becomes the owner of the node.\n\nAll flags and quest machines which belong to the same quest, must be assigned to the same network name. Under the hood, owner's name is also included into the network's name to prevent other players from altering the network. It's forbidden to use the # symbol in network name since it's reserver for internal usage.\n\nRight-clicking flags and quest machines displays menu in which the nodes can be configured. Flag's menu allows to:\n\n - Specify network's name\n - Specify coordinates of a cubic area, entering which automatically activates the flag for the player (if automatic triggering is enabled in the server's setting)\n - Specify the teleportation point (if teleportation is enabled in the server's settings)\n\nThe cubic area is specified by the means of the \"From coords\" and \"To coords\" fields which accept relative coordinates of two opposite angles of the cube relative to the flag's coordinates in the format x,y,z (for example, 8,5,7). All the values should be non-negative. Values in \"From coords\" are subtracted from the flag's coordinates while values in \"To coords\" are added to them.\n\nThe teleportation point is specified by coordinates in the format x,y,z (for example, 1,-1,0) relative to the flag's position. The field can be empty which means that teleportation is\ndisabled for the flag.\n\nMenu of Quest Machine allows to:\n\n - Specify network's name\n - Specify the maximum number of completions\n - Specify the time limit for completing the quest in seconds\n - Specify whether teleportation to the Quest Machine is enabled\n - Specify rewards\n - Manipulate Quest Machine's inventory\n - Switch to user mode, and vice versa\n - See the number of flags in the network\n - See the number of available rewards\n\nOwnership doesn't protect flags and quest machines from digging by other players. That's because flags and quest machines should be placed in protected areas anyway. Creating quest in unprotected areas might lead to possibility for players to modify the quest itself. This approach might also be reconsidered.\n\nIf the \"digilines\" mod is installed, SuperQuest provides Digiline-requiring Flags, as well as a set of Digiline messages for flags (ordinary and digiline-requiring) and quest machines which are described in the \"SuperQuest Digiline Guide\" which can be accessed by pressing the \"?\" button near the \"Digiline channel\" field. The only difference between ordinary and digiline-requiring flags is that digiline-requiring flags can be triggered only after receiving the corresponding Digiline signal. This allows to make Digilines-based mini games a part of quests. Digiline-requiring flags cannot be triggered just by sending the corresponding digiline signal without the same action from the player as for ordinary flags (punching or presence within its range), otherwise any player would be able to annoy any other player by continuous triggering a digiline-requiring flag for the user and triggering the \"*/* flags counted\" popup for them. It's the quest author's responsibility to make it clear for ordinary players (including those who are not familiar with Digilines) how to activate each digiline-requiring flag within the quest.\n\nThis is the responsibility of quests' authors to guarantee that the teleportation point is safe for teleportation, and the player, for example, won't fall to lava just by teleporting.\n\nYou can test your quests by switching to the user mode in the Quest Machine.\n\n### Chat commands\n\nList names of networks of the current user:\n```\n/superquest list_my_networks\n```\n\nList all the elements of a particular network of the current user:\n```\n/superquest list_my_network_elements <network_name>\n```\n\nCancel the current active timed quest:\n```\n/superquest cancel\n```\n\nTeleport to the last location (if available)\n```\n/superquest teleport\n```\n\n## Administrating quests\n\nPlayers with the \"superquest_admin\" privilege are allowed to edit all quests, including quests owned by other players. This privilege also gives access to administrative chat commands.\n\n### Administrative chat commands\n\nList players which own networks:\n```\n/superquest_admin list_owners\n```\n\nList networks of a player:\n```\n/superquest_admin list_player_networks <player_name>\n```\n\nList elements of a network of a player:\n```\n/superquest_admin list_player_network_elements <player_name>#<network_name>\n```\n",
  "maintainers": ["Andrii"],
  "media_license": "CC0-1.0",
  "name": "superquest",
  "provides": ["superquest"],
  "release": 31551,
  "repo": "https://gitlab.com/andriyndev/superquest/",
  "score": 312.2,
  "screenshots": [
    "https://content.luanti.org/uploads/0df29d519c.png",
    "https://content.luanti.org/uploads/0290d908bb.png",
    "https://content.luanti.org/uploads/cdb7ba5ea5.png",
    "https://content.luanti.org/uploads/8f670826ff.png",
    "https://content.luanti.org/uploads/fd51012305.png",
    "https://content.luanti.org/uploads/2b9674370a.png",
    "https://content.luanti.org/uploads/7e856a9f61.png"
  ],
  "short_description": "Allows to create quests with rewards which can be passed by triggering flags placed in different places",
  "state": "APPROVED",
  "tags": ["adventure__rpg", "puzzle", "sports"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/0df29d519c.png",
  "title": "SuperQuest",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/Andrii/superquest/releases/31551/download/",
  "video_thumbnail_url": "https://content.luanti.org/thumbnails/youtube/xPZR-5uggk0.jpg",
  "video_url": "https://www.youtube.com/watch?v=xPZR-5uggk0",
  "website": null,
  "dependencies": {
    "Andrii/superquest": [
      {
        "is_optional": false,
        "name": "font_api",
        "packages": [
          "BuckarooBanzay/mesecons_lab",
          "jgordon510/gridlocks",
          "mt-mods/display_modpack"
        ]
      },
      {
        "is_optional": false,
        "name": "display_api",
        "packages": [
          "BuckarooBanzay/mesecons_lab",
          "jgordon510/gridlocks",
          "mt-mods/display_modpack"
        ]
      }
    ],
    "mt-mods/display_modpack": [
      {
        "is_optional": false,
        "name": "xcompat",
        "packages": [
          "1248/regnum",
          "BuckarooBanzay/mesecons_lab",
          "bell07/whynot_game",
          "mt-mods/xcompat",
          "mt-mods/dreambuilder_game",
          "BuckarooBanzay/super_sam",
          "Kimapr/nonsensical_skyblock",
          "jgordon510/gridlocks"
        ]
      }
    ]
  },
  "hash": "1nnqd9jnvjn4b233mvr6qx9sh185jmlm89c5f9llahn1vr4rdpf6"
}
