{
  "author": "prestidigitator",
  "content_warnings": [],
  "created_at": "2023-03-14T18:26:38.617456",
  "dev_state": null,
  "donate_url": null,
  "downloads": 416,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=29277",
  "forums": 29277,
  "game_support": [],
  "issue_tracker": "https://notabug.org/prestidigitator-mt/minetest-mod-pronouns/issues",
  "license": "LGPL-2.1-or-later",
  "long_description": "This Minetest mod allows player to set displayed and queryable pronouns for themselves.\nPronouns appear parenthesized after the player's name in their in-world hovering\nnametag.\n\n## Features\n* The mod persists server settings and player pronouns in mod storage.\n* The order of a player's pronouns is preserved.\n* There is a maximum length on each pronoun (e.g. \"them\").\n* There is a maximum length of the combined pronoun string (e.g. \"he/him/they/them\").\n* Pronouns can be limited to a restricted whitelist, for servers concerned about\n  unrestricted chat and/or nametags.\n* All of the above restrictions can be circumvented by moderators.\n* The API allows overriding behavior, automation, and compatibility with other mods.\n\n## Basic Use\nTo set your pronouns, use the command:\n\n    /pronouns <pronouns>\n\nwhere `<pronouns>` is a list of pornouns separated by spaces and/or slashes (/).\n\nTo add or remove pronouns to your existing list, use the commands:\n\n    /pronouns add <pronouns>\n    /pronouns remove <pronouns>\n\nTo see what pronouns you have set (and which are preapproved so they can be used\ndespite length restrictions or a restricted whitelist), use the command:\n\n    /pronouns\n\nTo get the pronouns of someone else (like if you're only interacting with them in chat\nand can't see their nametag), use the command:\n\n    /pronouns for <player>\n\nwhere `<player>` is the player's name.\n\n## Moderation\nA \"moderator\" for this mod is anyone with the \"pronouns\" privilege.  They may change\nthe configuration and set pronouns for other players.  Any pronoun a moderator\nsets/adds for another player is remembered, and that player may make use of it when\nchanging their own pronouns (for example, if there is a length limit of 2 and the\n\"them\" pronoun has not been preapproved, a moderator may add it to the list of a\nplayer's pronouns, and the player may thereafter use it themself, even if they\ntemporarily remove it from their pronoun list).\n\nTo view and change the mod's settings, use the command:\n\n    /pronounsconf\n\nEach setting may be changed using an appropriate subcommand:\n\n    /pronounsconf max-length <number>\n    /pronounsconf max-total-length <number>\n    /pronounsconf restrict (true|false)\n    /pronounsconf approve <pronouns>\n    /pronounsconf approve add <pronouns>\n    /pronounsconf approve remove <pronouns>\n\nSee also (`/help pronounsconf`).\n\nTo set the pronouns for another player, use the commands:\n\n    /pronouns for <player> <pronouns>\n    /pronouns for <player> add <pronouns>\n    /pronouns for <player> remove <pronouns>\n\nThis allows setting the pronouns of both online and offline players.  However, the\nplayer must have logged into the server at some point while the pronouns mod was\ninstalled/active, so that the mod knows the name represents a real player.\n\n## API\nAll API functions are available under the namespace `pronouns` (note that if the name\nof the mod has been changed in `mod.conf`, this namespace will change too, so replace\n`pronouns.…` below as appropriate in that case).\n\nMany of the API functions have a \"documentation comment\" above them in the Lua source\ncode, so check there for more information.\n\n### Settings\nThese are the API equivalent of the settings commands.\n\n    pronouns.get_max_length()\n    pronouns.set_max_length(max_len)\n    pronouns.get_max_total_length()\n    pronouns.set_max_total_length(max_len)\n    pronouns.get_restricted()\n    pronouns.set_restricted(bool)\n    pronouns.get_preapproved()\n    pronouns.set_preapproved(pros)\n    pronouns.add_preapproved(pros)\n    pronouns.remove_preapproved(pros)\n    pronouns.reset_settings()\n\n### Permissions\nThese allow another mod to check whether an operation by one player on another is\nallowed according to the semantics defined by this mod (including privilege checks,\nlength limits, and whitelist restrictions).  None of these checks are done by the API\nfunctions which actually do the setting; cooperation between mods is assumed, so it is\npresumed that if another mod \"bypasses\" the checks by failing to call these methods,\nthere is a good reason for it.\n\n    pronouns.can_moderate(actor)\n    pronouns.check_privs(actor, target)\n    pronouns.can_set(actor, target, pros)\n    pronouns.can_add(actor, target, pros)\n    pronouns.can_remove(actor, target, pros)\n\n### Nametag Hooks\nThis API function allows other mods to set \"hooks\" that will be called by this mod when\nsetting a player's nametag (this is done when the player logs in, their pronouns are\nchanged while they are logged in, or this function is called).\n\n    pronouns.set_nametag_hooks(pre, post)\n\nThis is for both compatibility with other mods that set players' nametags, and for more\nversatile filtering when desired.  For example, if a server's moderation team were\nconcerned about the pronoun sequence \"she/it\" being set for some reason, another mod\ncould use the post hook to post-process the whole `<name> (<pronouns>)` nametag string\nto search for and somehow modify or remove that sequence.\n\nThe function returns the old pair of hooks, so the calling mod can call them in a\n\"chain of responsibility\" type pattern when and if appropriate.  Note that using `nil`\nfor either hook will remove any existing one, so your mod may want to test the return\nvalues and set the old hook back in place if it doesn't have one to install itself.\n\nThe whole mechanism of handling pronouns for logged in players can also be replaced by\nsetting a pronoun handler function using:\n\n    pronouns.set_pronoun_handler(handlerf)\n\nwhich allows another mod to replace or augment the use of the hooks and setting of the\nplayer nametag property entirely.\n\n### Player Pronouns\nThese are the API equivalents of the `/pronouns` commands.\n\n    pronouns.get(player)\n    pronouns.get_approved(player)\n    pronouns.set(player_name, pros, approved)\n    pronouns.add(player_name, pros, with_approval)\n    pronouns.remove(player_name, pros, with_approval)\n    pronouns.clear_all()\n\n### Misc\n\n    pronouns.parse(str)\n",
  "maintainers": [
    "prestidigitator"
  ],
  "media_license": "LGPL-2.1-or-later",
  "name": "pronouns",
  "provides": [
    "pronouns"
  ],
  "release": 17546,
  "repo": "https://notabug.org/prestidigitator-mt/minetest-mod-pronouns",
  "score": 459.4,
  "screenshots": [
    "https://content.luanti.org/uploads/222cb0ecfe.png"
  ],
  "short_description": "Allows players to set displayed and queryable pronouns for themselves.",
  "state": "APPROVED",
  "tags": [
    "chat",
    "multiplayer"
  ],
  "thumbnail": "https://content.luanti.org/thumbnails/1/222cb0ecfe.png",
  "title": "Pronouns",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/prestidigitator/pronouns/releases/17546/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "prestidigitator/pronouns": []
  },
  "hash": "1avnbmm48n2yd6vj3nm3c21zb85588lgiinhbldcrg01lcjxcmfy"
}
