{
  "author": "Avicennia_g",
  "content_warnings": [],
  "created_at": "2019-11-24T10:07:02.206296",
  "dev_state": null,
  "donate_url": null,
  "downloads": 1840,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": "https://github.com/Avicennia/nc_stucco/issues/new/choose/",
  "license": "MIT",
  "long_description": "# **Nodecore Stucco**\n\nRecent bugfixes:\n\n\n-12/6/2019 - Fixed a bug causing crashes when trying to pummel plain dry slate nodes.\n\n-12/5/2019 - Fixed bug causing occassional crashes and muted node sound.\n\n\n*Add a touch of aesthetic to your Nodecore building!*\n\nA very simple mod adding a handful of patterned nodes that can be crafted with relative ease in your Nodecore world.\n\nCurrently 2 materials are supported, but others are planned.\n\n\"Clay\" \n\nThe softer material, made with a mixture of dirt and ashes, gentle, warm brown color.\n\nand \"Slate\"\n\nThe harder, darker, stronger material, made with a dense packing of aggregate and more aggregate.\n\nProcess:\nPummel the ingredients together (one on top of the other) to mix together your desired substance. Take the newly made mixed node and place it near source nodes of water; it will take in water and become soggy. After soggification, remove from water and leave it to dry for a bit,* but be careful*! \n\nSoggy nodes are too wet to be worked on!\n\n**You can only change the pattern when it is moist or damp.**\n\nTo do this, just fastenin a stone chip into the top of your a wooden stick to give it a hard nib for it to really sink into that tacky wet material.\n\nOnce you have your stone-tipped stylus, you can punch a wet material node to change it's design.   Right-clicking will reverse the design to the previous. \n\nAlso be careful, nodes cannot be changed once they have completely dried out.\n\nNodes will lose their moisture after being made and become hardened, saving your designs permanently.\n****\nIf your node is dried you can recycle them by crushing them with a hammer of appropriate hardness.\n\nFence Posts (WIP) can be obtained by using a hatchet on a damp node.\n\n\nPlease feel free to message me with any issues, bugs and requests at a.germinans@gmail.com or feel free to ping me in the Unofficial Minetest Discord! \n\n-Avi",
  "maintainers": ["Avicennia_g"],
  "media_license": "MIT",
  "name": "nc_stucco",
  "provides": ["nc_stucco"],
  "release": 2624,
  "repo": "https://github.com/Avicennia/nc_stucco",
  "score": 3.2,
  "screenshots": [
    "https://content.luanti.org/uploads/y9JpVpboU6.png",
    "https://content.luanti.org/uploads/0P07gkf6id.png",
    "https://content.luanti.org/uploads/Y8vKxT7RvY.png",
    "https://content.luanti.org/uploads/VXx4PRBW2L.png",
    "https://content.luanti.org/uploads/cyE9pmCg9y.png",
    "https://content.luanti.org/uploads/LKvD9Ambk0.png",
    "https://content.luanti.org/uploads/R70hHQTZCv.png",
    "https://content.luanti.org/uploads/JhuAp4gXxZ.png"
  ],
  "short_description": "Adds a few decorative building nodes to Nodecore through simple and crude masonry.",
  "state": "APPROVED",
  "tags": ["building", "decorative"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/y9JpVpboU6.png",
  "title": "Nodecore Stucco",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/Avicennia_g/nc_stucco/releases/2624/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "Avicennia_g/nc_stucco": []
  },
  "hash": "1xv557qs874k4q7dpybh4p5rw89fglxkz83iqi74a9bmcp18vady"
}
