{
  "author": "Don",
  "content_warnings": [],
  "created_at": "2025-04-03T05:55:40.656660",
  "dev_state": "WIP",
  "donate_url": "https://donbatman.github.io/donate.html",
  "downloads": 18,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=13639",
  "forums": 13639,
  "game_support": [],
  "issue_tracker": "https://github.com/minetest-mods/mymonths/issues/new",
  "license": "MIT",
  "long_description": "Mymonths adds a few things to Minetest. Please only use on new worlds. It has not been tested in multiplayer yet.\nIf anyone wants to help develop this then please let me know. It is still in development so there may be issues. Please report all issues or suggestions.\n\nMonths - there are 12 months in a Minetest year. January - December. Each month has 14 days. Each week has 7 days, Monday - Sunday.\n\nLength of days - In the summer months the days are longer then the nights. Spring and fall have days that are the same and in the winter the nights are longer.\n\nLeaves - In the spring leaves grow on trees. Summer time apples grow. In the fall the leaves turn colour and eventually fall off the tree. Through the winter there are no apples or leaves. In the spring they grow back again.\n\nHolidays - There are some holidays throughout the year.\n- Dec 14 - New Years Eve\n- Jan 1 - New Years Day\n- March 12 - Friendship Day\n- April 10 - Miners Day\n- June 5 - Minetest Day\n- Aug 12 - Builders Day\n- Oct 8 - Harvest Day\n\nWeather - Based off Jeija's weather mod. This adds rain, storm, snow, snowstorm, hail and sandstorm. Weather depends on what time of year it is and what biome you are in. There is a setting which make it so storm and snowstorm causes damage but is off by default.\n\nCommands - You will need the mymonths priv to use most commands\n/setweather - rain, storm, snow, snowstorm, hail, sandstorm, clear\n/setmonth - 1-12 or jan - dec or January - December or january - december\n/setday - 1 - 14\n\nThese commands do not need a priv\n/weather - tells you what the weather is right now\n/date - tell you the day, month and time\n/holidays - gives a list of the holidays and the date\n\nEveryday at 6am The time and date is show in chat. If it is a holiday it will say the holiday at the same time.\n\nThere is a settings.txt file that allows you to turn on and off different parts of the mod. Weather is a bit laggy since it uses particles. If you have an older computer you will want to turn the weather off.\nRename the settings.txt.example file to settings.txt. Change the setting to either true of false\ndamage - whether the storms cause damage or not\nuse_weather - turns weather on or off\nleaves - whether or not the leaves change\nsnow_on_ground - whether or not snow accumulates on the ground when it snows\nuse_puddles - whether puddles appear on the ground when it rains or when snow melts.\n\nIf you have sofars lightning mod then storms look and sound much better.\n\nContributors - Nathan Salapat,sofar, tenplus1 and Don\n\nCode Licence - MIT\n\nMedia Licence - CC0\n\nexcept for\n\n  - Rain / Snow: CC-BY-SA 3.0, credit goes to TeddyDesTodes, from his weather mod",
  "maintainers": ["Don"],
  "media_license": "CC-BY-SA-3.0",
  "name": "mymonths",
  "provides": ["mymonths"],
  "release": 30692,
  "repo": "https://github.com/minetest-mods/mymonths.git",
  "score": 9.5,
  "screenshots": [
    "https://content.luanti.org/uploads/8fdf42795b.png",
    "https://content.luanti.org/uploads/150b9a88ed.png"
  ],
  "short_description": "Adds days of the week and months. Also weather, including rain and snow.",
  "state": "APPROVED",
  "tags": ["environment"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/8fdf42795b.png",
  "title": "Mymonths",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/Don/mymonths/releases/30692/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": "https://donbatman.github.io/mymonths.html",
  "dependencies": { "Don/mymonths": [] },
  "hash": "1amhwjcynqjakbhkf8vjl12kgyvgda00437z275h6hj1yh0fjq3n"
}
