{"author":"Noodlemire","content_warnings":[],"created_at":"2020-07-25T23:02:10.340572","dev_state":null,"donate_url":null,"downloads":1462,"forum_url":"https://forum.luanti.org/viewtopic.php?t=25132","forums":25132,"game_support":[],"issue_tracker":"https://github.com/Noodlemire/node_damage/issues/new/choose/","license":"LGPL-2.1-only","long_description":"This is an API mod that enables nodes to be damaged and repaired. The damage level is persistent until repairs occur, and shows itself through cracks on the node. Other than when a node isn't damaged at all, there are three levels of damage that the node can go through before being destroyed.\n\nOn its own, this mod doesn't do much. It adds a testing hammer to the creative inventory which can damage nodes on left-click, and repair nodes on right-click, to give a feel for how this mod works. Also, if the tnt mod is enabled, explosions from regular tnt blocks will damage nodes that are just outside of the destruction radius.\n\nIn order to register cracked versions of all applicable nodes without using a million optional dependencies, this mod first queries existing nodes when it is loaded, and saves the names of every node. You must then reload the world for the mod to register cracked versions of the nodes it found. It will also detect when new nodes have been added to the game which weren't included before, meaning that their nodes'll also only be crackable the second time they're loaded.\n\nIf you're a modder interested in this premise, you can see the short api.txt included with the mod.","maintainers":["Noodlemire"],"media_license":"LGPL-2.1-only","name":"node_damage","provides":["node_damage"],"release":9078,"repo":"https://github.com/Noodlemire/node_damage.git","score":4.9,"screenshots":["https://content.luanti.org/uploads/nosAQ9kdW0.png"],"short_description":"Enables nodes to be partially damaged, and to be repaired afterwards.","state":"APPROVED","tags":["library"],"thumbnail":"https://content.luanti.org/thumbnails/1/nosAQ9kdW0.png","title":"Node Damage","translation_url":null,"type":"mod","url":"https://content.luanti.org/packages/Noodlemire/node_damage/releases/9078/download/","video_thumbnail_url":null,"video_url":null,"website":null,"dependencies":{"Noodlemire/node_damage":[]},"hash":"1hzg83af9ca2ai17pgiklysq9a59kblw52rm9j64hcmy0r75z35b"}