{
  "author": "jwmhjwmh",
  "content_warnings": [],
  "created_at": "2021-09-25T17:52:19.432656",
  "dev_state": "AS_IS",
  "donate_url": null,
  "downloads": 2184,
  "forum_url": "https://forum.luanti.org/viewtopic.php?t=27325",
  "forums": 27325,
  "game_support": [],
  "issue_tracker": "https://github.com/TurkeyMcMac/large_slugs/issues",
  "license": "LGPL-3.0-or-later",
  "long_description": "## Overview\n\nThis mod adds several slug species,\nimplemented as different nodes. They very slowly wander around, sticking to\nsurfaces, dying and asexually reproducing to balance their population. This\nbehavior can be tweaked or disabled if it becomes detrimental to performance.\n\n\n## Species\n\nDifferent species spawn on different surfaces, and their movement is restricted\nto these different surfaces.\n\n### Grass Slug\n\nThe light brown grass slug spawns on regular grass on the surface. It can only\nmove on grass and dirt.\n\nGrass slugs can be cooked and eaten for two food points.\n\n### Pine Slug\n\nThe dark brown pine slug spawns in pine forests. It can only move on dirt, pine\ntrees trunks, and the ground covering of the pine forests.\n\nPine slugs can be cooked and eaten for two food points.\n\n### Rainforest Slug\n\nThe yellow-brown rainforest slug spawns in rainforests. It can only move on\ndirt, jungle tree trunks, and the ground covering of the rainforests.\n\nRainforest slugs can be cooked and eaten for three food points.\n\n### Cave Slug\n\nThe gray cave slug spawn at level -32 and below on stone. It can only move on\nstone, cobblestone, and coal-bearing stone.\n\nCave slugs can be cooked and eaten for three food points. Two cave slugs can be\ncrafted into a lump of coal.\n\n### Iron Slug\n\nThe rust-colored iron slug spawns at level -128 and below on stone. It can only\nmove on stone, cobblestone, and iron ore.\n\nTwo iron slugs can be crafted into a lump of iron.\n\n### Mese Slug\n\nThe yellow mese slug spawns at level -512 and below on stone. It can only move\non stone, cobblestone, mese, and mese-bearing stone.\n\nThree mese slugs can be crafted into a mese crystal fragment.\n\n\n## Behavior\n\nIf behavior is enabled, an ABM runs every 5 seconds\\* to update active slugs.\nThe updates are spread throughout the interval. Each interval, one out of every\n5 slugs\\* is actually updated. Each slug may check a radius of 5 nodes\\* around\nthem and act based on the nearby population of their species. One out of 6\\*\nwill choose to die if there is more than 1 other slug\\* nearby. Of those\nremaining, one out of 6\\* will try to reproduce if there are 0 other slugs\\*\nnearby. Those that neither die nor try to reproduce will try to move.\n\n\\* These are default values. They can be changed in the settings.",
  "maintainers": ["jwmhjwmh"],
  "media_license": "CC-BY-SA-3.0",
  "name": "large_slugs",
  "provides": ["large_slugs"],
  "release": 16417,
  "repo": "https://github.com/TurkeyMcMac/large_slugs",
  "score": 161.2,
  "screenshots": ["https://content.luanti.org/uploads/26c31cae94.png"],
  "short_description": "Adds node-based slug mobs to your world",
  "state": "APPROVED",
  "tags": ["food", "mapgen", "mobs"],
  "thumbnail": "https://content.luanti.org/thumbnails/1/26c31cae94.png",
  "title": "Large Slugs",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/jwmhjwmh/large_slugs/releases/16417/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": { "jwmhjwmh/large_slugs": [] },
  "hash": "19n32d9mv6f366hvwmawi5vhcp2cskvxirjlhli7ns2krsabn9nw"
}
