{"author":"sorcerykid","content_warnings":[],"created_at":"2020-09-03T00:02:25.431435","dev_state":null,"donate_url":"https://liberapay.com/sorcerykid","downloads":915,"forum_url":"https://forum.luanti.org/viewtopic.php?t=24361","forums":24361,"game_support":[],"issue_tracker":null,"license":"MIT","long_description":"Pluggable Helpers aims to encourage the cooperative development of helper functions in Minetest mods and games by automating the entire process from downloading to installation, including management of dependencies, within a distributed architecture backed by the BitBucket Cloud for secure version control.\n\nModularity is extremely important when it comes to maintaining large scale code-bases such as games and mods in Minetest. Helper classes and methods and even libraries serve this purpose. But so often they are re-implemented over-and-over again since nobody wants to rely on external dependencies in their mods and games. Eventually some helper functions may be integrated into the engine, but even that is often a lengthy review process with its own share of obstacles and pitfalls.\n\nThis is where Pluggable Helpers comes into the picture.\n\n*\"The core philosophy of Pluggable Helpers is to empower the community to create an evolving game-development API through the use of a jointly maintained public repository of helper classes, methods, and libraries that can be downloaded and installed on-the-fly with no intervention required by the end-user.\"*\n\nAlthough the Pluggable Helpers mod has no dependencies in and of itself, it does need to perform occasional HTTP requests. Therefore, it must be added to the list of `secure.http_mods` in minetest.conf.","maintainers":["sorcerykid"],"media_license":"MIT","name":"plugins","provides":["plugins"],"release":4973,"repo":"https://bitbucket.org/sorcerykid/plugins.git","score":3.6,"screenshots":["https://content.luanti.org/uploads/1AVykRdbwW.png"],"short_description":"Automated dependency management of helper functions within a distributed architecture","state":"APPROVED","tags":["complex_installation","developer_tools","library"],"thumbnail":"https://content.luanti.org/thumbnails/1/1AVykRdbwW.png","title":"Pluggable Helpers","translation_url":null,"type":"mod","url":"https://content.luanti.org/packages/sorcerykid/plugins/releases/4973/download/","video_thumbnail_url":null,"video_url":null,"website":"http://plugins.mytuner.net/","dependencies":{"sorcerykid/plugins":[]},"hash":"12ari5c7c31bc5xvj88afq9gfwclqfqxvcycvb8dy6lasc5frmm4"}