{
  "author": "erlehmann",
  "content_warnings": [],
  "created_at": "2023-11-20T14:47:52.874179",
  "dev_state": "MAINTENANCE_ONLY",
  "donate_url": null,
  "downloads": 177,
  "forum_url": null,
  "forums": null,
  "game_support": [],
  "issue_tracker": "https://git.minetest.land/erle/oddly_sized_checkerboard_testnodes_2/issues",
  "license": "LGPL-2.1-or-later",
  "long_description": "# Oddly Sized Checkerboard Test Nodes 2\n\n## Synopsis\n\nThe code in this mod generates 25 checkerboard textures in different sizes and registers nodes for them.\n\nThe bottom left square is gray, so that nodes placed next to each other are easier to identify.\n\nThese nodes can be used to find and debug unintended rendering differences in Minetest.\n\n## Usage\n\nThe nodes in this mod can be used to debug rendering issues related to non-16×16 textures sizes and/or texture scaling. This mod is intended to aid creators and users of games, mods or texture packs that contain or generate textures with a size other than 16×16. It can also be used to aid development of filtering and mipmapping code and to prevent rendering regressions when refactoring Minetest code.\n\nTo find bugs, place the nodes in this mod in the world and examine if the following assertions hold:\n\n* Nodes with the same tiling (e.g. 2×2) should look alike with different texture filtering settings.\n\n* Any single checkerboard test node should look the same with different versions of Minetest.\n\n* Any single checkerboard test node should look the same when rendered with different GPUs.\n\nIf you notice any unintended rendering differences, consider filing issues on Minetest or Mesa:\n\n* <https://github.com/minetest/minetest/issues>\n* <https://docs.mesa3d.org/bugs.html>\n\nRendering differences across GPUs that do not exist in other versions of Minetest are likely Minetest issues. Minetest core developers have claimed in the past that rendering issues are driver issues when they could not reproduce them – if they do, ask Mesa developers about it. Note that using the Mesa software renderer does not necessarily help with determining what the correct output should be.\n\nRendering differences across GPUs that do not exist in other versions of Mesa are most likely Mesa issues. Note that some Mesa drivers prefer fast rendering over correct rendering and that for some implementation-defined scenarios vendors have long-standing differences in opinion about how results should look.\n\n## History\n\nMinetest does not require regression tests for changes related to rendering. Therefore, rendering changes are not exhaustively tested across many different setups. These nodes were originally created to find and debug regressions related to texture filtering and scaling. They were used to demonstrate a regression with anisotropic filtering on Intel GPUs and to evaluate a patch for gamma-correct mipmap downscaling:\n\n* <https://github.com/minetest/minetest/pull/14006>\n* <https://github.com/minetest/minetest/issues/14007>\n\nThe code in this mod was offered to be included in Minetest, but the patch was rejected:\n\n* <https://github.com/minetest/minetest/pull/13955>\n",
  "maintainers": [
    "erlehmann"
  ],
  "media_license": "LGPL-2.1-or-later",
  "name": "oddly_sized_checkerboard_testnodes_2",
  "provides": [
    "oddly_sized_checkerboard_testnodes_2"
  ],
  "release": 21853,
  "repo": "https://git.minetest.land/erle/oddly_sized_checkerboard_testnodes_2",
  "score": 2.4,
  "screenshots": [
    "https://content.luanti.org/uploads/c008a9dd06.png"
  ],
  "short_description": "Adds oddly sized checkerboard test nodes.",
  "state": "APPROVED",
  "tags": [
    "decorative",
    "developer_tools"
  ],
  "thumbnail": "https://content.luanti.org/thumbnails/1/c008a9dd06.png",
  "title": "Oddly Sized Checkerboard Testnodes 2",
  "translation_url": null,
  "type": "mod",
  "url": "https://content.luanti.org/packages/erlehmann/oddly_sized_checkerboard_testnodes_2/releases/21853/download/",
  "video_thumbnail_url": null,
  "video_url": null,
  "website": null,
  "dependencies": {
    "erlehmann/oddly_sized_checkerboard_testnodes_2": []
  },
  "hash": "1nvxyigy3icqvy4bz6a2965175vs74ns2r7pyxxa073yf8b2gnkg"
}
